[
  {
    "title": "Tiger kills man in Chitwan",
    "url": "https://kathmandupost.com/province-no-3/2025/07/11/tiger-kills-man-in-chitwan",
    "author": "By Ramesh Kumar Paudel",
    "read_time": "1 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2019/default/tkp-no-image-bnw.jpg",
    "body": "A 68-year-old man was killed in a tiger attack on Friday morning while collecting fodder in a community forest in Chitwan district.Padam Bahadur Rana Magar of Gawai village in ward 13 of Khairahani Municipality was attacked in the Kumroj Buffer Zone Community Forest, according to the District Police Office, Chitwan.Rana Magar had entered the forest with two others at around 7am. While the others returned, he did not, prompting a search that began at 1pm. His body was found at around 2:45pm, said Deputy Superintendent of Police Rabindra Khanal, the police spokesperson.The forest lies adjacent to the Chitwan National Park, where similar fatal incidents involving tigers have occurred in previous years.According to Avinash Thapa Magar, the park’s information officer and conservation officer, 13 people have died and 37 others have been injured in wild animal attacks in the park’s buffer zone so far this fiscal year. The park’s buffer zone extends across settlements in four districts—Chitwan, Nawalparasi East, Makwanpur and Parsa.",
    "date": "2025-07-11"
  },
  {
    "title": "India opens gates of Dhauliganga dam, authorities urge caution",
    "url": "https://kathmandupost.com/national/2025/07/11/india-opens-gates-of-dhauliganga-dam-authorities-urge-caution",
    "author": "By Manoj Badu",
    "read_time": "1 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/thumb2-1752233971.jpg",
    "body": "India opened the sluice gates of the Dhauliganga dam early Friday, causing a rise in the water level of the Mahakali river, which flows along the Nepal-India border.According to the Indian officials, the gates were opened urgently to flush out silt as the reservoir at the Dhauliganga power station had reached a high water level.Following the opening of the gates, residents living along the banks of the Mahakali River in Nepal’s Darchula and Baitadi districts have been advised to remain cautious and stay away from riverbank areas.The National Hydroelectric Power Corporation (NHPC) of India, which operates the dam, said the gates opened around 1:30am on Friday will remain open until Saturday afternoon.\n\n",
    "date": "2025-07-11"
  },
  {
    "title": "Indian Embassy facilitates cricket training for Nepali U-19 players",
    "url": "https://kathmandupost.com/cricket/2025/07/11/indian-embassy-facilitates-cricket-training-for-nepali-u-19-players",
    "author": "By Post Report",
    "read_time": "1 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/Nepaliplayers-1752233739.jpg",
    "body": "The Embassy of India, Kathmandu, has facilitated a month-long professional training programme for three promising Nepali Under-19 cricketers as part of the Ambassador’s Cricket Fellowship for Nepali Youth, launched in June 2025.\n\nCricketers Naren Bhatta, Sahil Patel, and Puja Mahato are set to undergo training at the LB Shastri Cricket Shaala in Bhopal, India, from July 15 to August 14.\n\nThe Indian embassy said in a statement that the initiative aims to support the development of young cricket talent in Nepal and promote people-to-people ties between India and Nepal through a shared passion for the sport.\n\nThe professional exposure is expected to significantly enhance the players’ skills and contribute to Nepal’s cricketing aspirations.\n\nIndian Ambassador Naveen Srivastava met the players in Kathmandu on Friday in the presence of Chatur Bahadur Chand, president of the Cricket Association of Nepal, and conveyed his best wishes for their training.\n\nThe interaction highlighted the role of sports cooperation in strengthening bilateral ties, the embassy said.",
    "date": "2025-07-11"
  },
  {
    "title": "Kathmandu Metropolis to bring annual budget of Rs25.11 billion",
    "url": "https://kathmandupost.com/kathmandu/2025/07/11/kathmandu-metropolis-to-bring-annual-budget-of-rs25-11-billion",
    "author": "By Post Report",
    "read_time": "3 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/thumb1-1752232552.jpg",
    "body": "The Kathmandu Metropolitan City is all set to unveil an annual budget of Rs25.11 billion for the upcoming fiscal year 2025-26.\n\nA meeting of the revenue advisory committee, led by Deputy Mayor Sunita Dangol and the resource estimation committee, led by Mayor Balendra Shah, held on Friday decided to propose a budget of the said amount.\n\n“All procedures to unveil the budget of the upcoming fiscal year have been completed,” said Dhurba Kumar Kafle, assistant spokesperson at the city office.\n\n“Bureaucrats and elected representatives have been working on the budget for a long time. Now we have the ceiling, and the budget will be prepared accordingly.”\n\nAlong with the revenue advisory committee and the resource estimation committee, the city office also held a municipality executive committee on Friday that decided to call another executive meeting on Sunday morning and a municipal assembly meeting in the afternoon.\n\nThe mayor’s proposal to hold the next executive and assembly meetings on Sunday to present the metropolitan city’s annual budget was passed by the meeting unanimously.\n\n“The next executive meeting will endorse the budget, which will be presented in the municipal assembly meeting in the afternoon,” said Nurnidhi Neupane, information officer at the city office. “Mayor Shah will present the policy and programme of the metropolis while Deputy Mayor Dangol will present the budget in the municipal assembly.”\n\nThe metropolis has not been able to bring its annual budget on time due to a dispute between the federal government and Mayor Shah. Most local units, including five of the six metropolitan cities in the country, unveiled their annual budgets on June 24.\n\nMayor Shah had not convened an executive meeting for over six months. His reluctance to convene crucial meetings stems from a dispute with the federal government, which began after he sent the chief administrative officer on leave over corruption allegations.\n\nMayor Shah had sent Chief Administrative Officer Saroj Gruragain on leave on December 23, accusing him of being involved in financial irregularities related to the approval of a construction plan for Kathmandu Tower at the Old Bus Park.\n\nHowever, the federal government did not replace Guragain with another official as Shah expected, and insteadreinstatedGuragain himself amid Shah’s objection in the first week of April.\n\nMayor Shah had deployed municipal police to stop Guragain from entering the office. But their attempts failed as Deputy Mayor Dangol, along with other ward chiefs close to the ruling parties, and staffers, who had remained unpaid for months due to the chief administrative officer’s absence, assisted him in resuming office.\n\nIt has already been over six months since the last executive meeting was held at least once every month as per the Local Government Operation Act 2017.\n\nAs per the Local Government Operation Act and the Inter-Governmental Financial Management Act, local governments must present their annual budget by Asar 10 (June 24 this year).\n\nOther elected representatives and the bureaucrats of the city office had been urging Mayor Shah to put differences aside and bring the annual budget for the upcoming fiscal year, as they said that anyone’s ego should not hamper development and other regular works of the metropolitan city.",
    "date": "2025-07-11"
  },
  {
    "title": "Former minister Balaram Gharti Magar dies at 87",
    "url": "https://kathmandupost.com/national/2025/07/11/former-minister-balaram-gharti-magar-dies-at-87",
    "author": "By Kashiram Dangi",
    "read_time": "1 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/untitled111720251041401000x0-1752231733.jpg",
    "body": "Former minister Balaram Gharti Magar passed away on Friday morning while undergoing treatment at a hospital in Kathmandu. He was 87 and had been suffering from a prolonged illness, according to family sources.\n\nBorn on August 2, 1937 in then Mijhing VDC-5 of Rolpa, Gharti Magar was elected multiple times from the Rastriya Prajatantra Party, serving five ministerial terms during the Panchayat and multiparty periods.\n\nA trusted confidant of the former monarchs, Gharti Magar held several ministerial portfolios, including that of deputy prime minister.\n\nHe earned a reputation as a popular leader since the Panchayat era and remained active in politics and parliament for nearly three decades.\n\nGharti Magar published several books, including Rajyog, Mool, Hijo, Aaja, Bholi, Manav Adhikar: Ek Chintan, Purkha Ko Chino, and Aitihasik Ghatnakram–Part 1, reflecting on politics, development, and Eastern philosophy.\n\nIn 1960, he joined hands with Congress leader Khadananda Subedi to launch the “Gaun Farka Rastriya Abhiyan” (Return to Village National Campaign).\n\nGharti Magar also played a pivotal role in creating the Rolpa district, which was carved out by combining parts of Pyuthan, Dang, Rukum and Salyan, and is remembered as the “father of Rolpa’s development.”\n\nA leader who also studied history, science, Ayurveda and society, Gharti Magar was deeply inclined towards Eastern philosophy and valued political integrity. His writings reflected his vision for the nation’s political, developmental, and spiritual path.\n\nHe is survived by five daughters.\n\nFormer lawmaker Lekhnath Acharya described him as one of the most honest and humble leaders of Rolpa and the country. He said his contributions to the district’s development should be remembered.",
    "date": "2025-07-11"
  },
  {
    "title": "Foreign Minister Deuba returns home",
    "url": "https://kathmandupost.com/national/2025/07/11/foreign-minister-deuba-returns-home",
    "author": "By Post Report",
    "read_time": "2 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/aarjurana25420251026351000x0-1752231672.jpg",
    "body": "Minister for Foreign Affairs Arzu Rana Deuba returned home on Friday after participating in the 44th session of the Food and Agriculture Organisation (FAO) held in Rome, Italy. She also attended the High-Level Ministerial Conference organised on the sidelines of the event.\n\nDeuba addressed the main session of the FAO Conference, which was held from June 28 to July 4, as well as other high-level sideline meetings and programmes.\n\nDuring the meetings, she informed that Nepal has recognised the right to food as a fundamental right and the laws on the right to food and food sovereignty have provided a legal basis for its implementation, the foreign ministry said in a statement.\n\nDeuba drew the world community’s attention to the increasing impacts of climate change that vulnerable countries like Nepal face. She also urged the international community to support sustainable agriculture systems and climate finance for Nepal and other mountainous and landlocked countries.\n\nDeuba held a bilateral meeting with German Foreign Minister Johann David Wadephul in Berlin during her visit to Germany. They discussed a wide range of bilateral issues, including Nepal-Germany relations, mutual interests, and common global concerns.\n\nShe stressed the need for collective efforts to promote bilateral trade between Nepal and Germany further and encourage and promote networks between the private sectors of both countries.\n\nShe also urged Germany to invest in areas including chemical fertiliser production.\n\nShe proposed a direct flight between Nepal and Germany, sharing Nepal’s ongoing preparations for a smooth and sustainable graduation from a least developed country by 2026.\n\nShe expressed Nepal’s expectation of continued support in the form of resources, technology and financial support from Germany, the European Union and other partners.\n\nShe also sought Germany’s role in removing the European Union’s aviation safety ban on Nepali airlines, expressing concerns that the ban has seriously affected tourism promotion.",
    "date": "2025-07-11"
  },
  {
    "title": "Six charged with corruption in IT equipment procurement",
    "url": "https://kathmandupost.com/national/2025/07/11/six-charged-with-corruption-in-it-equipment-procurement",
    "author": "By Post Report",
    "read_time": "1 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/thumb-1752228770.jpg",
    "body": "The Commission for the Investigation of Abuse of Authority (CIAA) on Friday filed a corruption case against six individuals, including Sunil Paudel, the then executive director of the National Information Technology Centre, over alleged irregularities in the procurement of “high-compute infrastructure” equipment.\n\nAccording to the CIAA, the accused allegedly embezzled around Rs160 million during the fiscal year 2019-20 procurement process. The case was filed at the Special Court, with the CIAA seeking a recovery of Rs158.85 million and corresponding imprisonment and fines.\n\nThe defendants include former centre officials—director Saphal Shrestha, assistant director Ramesh Pokharel, computer engineer Ramsharan Gayak, and accounts officer Nim Bahadur Oli—as well as Arun Shrestha, chairperson and managing director of World Distribution Nepal Pvt Ltd, the company that received the contract.\n\nCIAA spokesperson Rajendra Kumar Paudel said the officials invited tenders in collusion with the contractor. A cost estimate of Rs310 million was prepared and the contract was awarded to World Distribution Nepal for Rs306.56 million on January 29, 2020.\n\nThe commission found that the centre procured overpriced and substandard equipment, violating the original specifications and contract terms.\n\nPaudel, then the executive director, has been named the main offender, and the CIAA has sought additional punishment for abusing his authority.\n\nHe is already serving a sentence in Dillibazar Jail after being convicted in earlier corruption cases.\n\nThe CIAA had arrested Paudel in 2023 and has since filed multiple cases against him, most of which have resulted in convictions. A case concerning Nepal Telecom’s billing system, however, remains sub judice.\n\nPaudel, who was appointed managing director of Nepal Telecom shortly after leaving the Information Technology Centre, was later suspended and dismissed following his arrest.\n\nInvestigations revealed that he colluded in awarding technology-related contracts in both institutions, causing substantial financial loss to the state coffers.",
    "date": "2025-07-11"
  },
  {
    "title": "Lumbini avoids Unesco’s danger list amid conservation efforts",
    "url": "https://kathmandupost.com/province-no-5/2025/07/11/lumbini-avoids-unesco-s-danger-list-amid-conservation-efforts",
    "author": "By Manoj Paudel",
    "read_time": "3 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/news/Lumbini-1752228268.jpg",
    "body": "Lumbini, the birthplace of the Buddha and a United Nations Educational, Scientific and Cultural Organisation (Unesco) World Heritage Site, has been spared inclusion on the List of World Heritage in Danger, after the World Heritage Committee acknowledged Nepal’s ongoing conservation and improvement efforts.\n\nThe decision was made during the 47th session of the UNESCO World Heritage Committee, held in Paris on Thursday which was chaired by Bulgarian professor Nikolay Nenov.\n\nThe committee decided not to place Lumbini on the danger list for one year, but will dispatch a reactive monitoring mission to evaluate the site’s current condition.\n\nUnescodescribesreactive monitoring as the process of reporting on the state of conservation of World Heritage properties that are under threat. According to Paragraph 169 of its Operational Guidelines, it is part of the procedure used to assess whether sites should be placed on the List of World Heritage in Danger or removed from the World Heritage List.\n\nThe decision to defer inclusion came after discussions recognised conservation-friendly and reformative steps taken. Based on the findings of the upcoming monitoring mission, the committee will later decide whether Lumbini should be reconsidered for the danger list, said Gyanin Rai, senior director at the Lumbini Development Trust, who attended the session.\n\nLumbini had been placed on the tentative danger list in 2024 following concerns raised in a 2022 monitoring report prepared by heritage experts Roland Lin Chih-Hung and Professor Yuga Kariya, who were deployed to the site by the World Heritage Centre and International Council on Monuments and Sites (Icomos).\n\nDiscussions took place at the 46th session held in Delhi last year on whether Lumbini should be added to the danger list. At that time, an amendment proposal submitted by India resulted in Lumbini avoiding the listing.\n\nHowever, Nepal’s proposals, concerns, and suggestions regarding Lumbini were acknowledged, and a 12-point decision and directive were sent via the Nepali Embassy in France.\n\nSanuraja Shakya, member-secretary of the Lumbini Development Trust, said Nepal had acted on all 12 points—covering conservation, legal clarity, and policy formulation—and submitted a Standard Operating Procedure (SOP) report that yielded a favourable outcome. “We addressed everything comprehensively,” he said. “This has yielded good results. We will continue with conservation-focused work.”\n\nOfficials said Unesco responded positively to Nepal’s adoption of an integrated management framework and sector-specific strategies aimed at protecting and managing Lumbini’s heritage. The five-sector strategies cover archaeology, visitor management, natural disasters, local development, and engagement with the Buddhist community.\n\nThe framework also serves as a broad guiding policy, while the sector strategies provide detailed operational plans. Additional efforts include conservation work on the Ashoka Pillar, Marker Stone, and Nativity Sculptures using new technology to prevent seepage and maintain cleanliness—the moves that UNESCO welcomed.\n\nUpgrades to the Maya Devi Temple included painting, installation of fans, lighting, and electricity.\n\nUnesco had earlier urged Nepal to prepare a deep, focused, and results-oriented plan to keep Lumbini from the danger list.\n\nEffective on-site implementation—beyond written commitments—resulted in the current positive decision, said Rai.\n\n“To keep Lumbini off the danger list, we invited global heritage experts and hosted the World Heritage International Conference, which proved highly impactful,” Rai said.\n\nShakya added that Nepal thoroughly studied Unesco’s past recommendations to understand points of concern and submitted a detailed State of Conservation (SOC) report.\n\nThe preparation involved close coordination with national and international experts, ministries, and the Department of Archaeology, he said.\n\nThe 47th session of the Unesco World Heritage Committee runs in Paris from July 6 to 16.\n\nUnesco enlisted Lumbini in the World Heritage List in 1997. The UN body has repeatedly expressed concerns regarding human activities and the construction of various structures in the Lumbini area.\n\nThe extended 45th session of the World Heritage Committee, held in Riyadh, Saudi Arabia, from September 10-25, 2023, sought clarification from the trust.\n\nAccordingly, the World Heritage Committee wrote a 10-point letter seeking clarification before February 1, 2024. The trust replied to the World Heritage Committee before the set deadline.\n\nThe UN agency expressed concern about the construction of an assembly hall and other structures in the area.",
    "date": "2025-07-11"
  },
  {
    "title": "Musk’s Tesla marks formal India entry with Mumbai launch event",
    "url": "https://kathmandupost.com/world/2025/07/11/musk-s-tesla-marks-formal-india-entry-with-mumbai-launch-event",
    "author": "By Reuters",
    "read_time": "2 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/world/imgi1DBGUEVFONNPRFI7NVDS6HPMGQI-1752226861.jpg",
    "body": "Tesla will open its first India showroom in Mumbai next week, having imported $1 million worth of cars and merchandise, marking its entry into the world’s third-largest car market despite CEO Elon Musk’s complaints about high import tariffs.\n\nIn an invitation to media late Thursday, the carmaker said the July 15 event was the “launch of Tesla in India through the opening of the Tesla experience centre at Bandra Kurla Complex,” located in the city’s leading commercial business district.\n\nGrappling with excess manufacturing capacity at its other factories and falling sales, Tesla has pivoted to selling imported cars in India on which it will need to pay about 70% import duty and other levies.\n\nCommercially available custom records from January to June showed Tesla imported vehicles, chargers and accessories into India worth close to $1 million, mainly from China and the United States.\n\nThe vehicles included six of Tesla’s best-selling Model Y at a shipment value of $32,500 each for five cars, and $46,000 for the long-range version, as well as several Superchargers.\n\nIndian Prime Minister Narendra Modi’s government has for years wooed Tesla, including forming a new policy to attract the carmaker to build its EVs locally.\n\nLast year, Musk had planned to visit India where he was expected to announce an investment of $2 billion-$3 billion, including in local EV manufacturing. But he cancelled the trip at the last moment.\n\nTesla has conveyed it is not interested in manufacturing in India at the moment.\n\nUS President Donald Trump has said that if Tesla were to build a factory in India to circumvent that country’s tariffs, it would be “unfair” to the US”\n\nTesla has hired for several of the three dozen positions it advertised in India earlier this year, bringing on board store managers, sales and service executives. It is looking for supply chain engineers and vehicle operators for its autopilot ambitions.",
    "date": "2025-07-11"
  },
  {
    "title": "Pakistan says armed men kidnap, kill nine bus passengers in restive province",
    "url": "https://kathmandupost.com/world/2025/07/11/armed-men-kidnap-kill-nine-bus-passengers-in-pakistan-say-officials",
    "author": "By Reuters",
    "read_time": "2 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2019/default/tkp-no-image-bnw.jpg",
    "body": "Authorities retrieved from Pakistan’s mountains the bullet-ridden bodies of nine passengers kidnapped by armed men in a spate of bus attacks in the troubled southwestern province of Balochistan, officials said on Friday.\n\nThere was no immediate claim of responsibility, but Baloch separatists, agitating for a greater share of resources, have figured in similar past killings of those identified as hailing from the eastern province of Punjab.\n\nGovernment official Naveed Alam said the bodies with bullet wounds were found in the mountains overnight, while a provincial government spokesman, Shahid Rind, said the passengers were seized from two buses on Thursday evening.\n\n“We are identifying the bodies and reaching out to their families,” he said, adding that the victims, working as labourers in the restive region, were returning home to Punjab.\n\nEthnic insurgents accuse Pakistan’s government of stealing regional resources to fund expenditure elsewhere, mainly in the sprawling province of Punjab.\n\nSecurity forces foiled three insurgent attacks on Thursday before the kidnappings, Rind said, accusing neighbour and arch rival India of backing the militants.\n\nThe Indian foreign ministry did not immediately respond to a Reuters request for comment.\n\nNew Delhi denies accusations by Islamabad that it is funding, training and backing the militants in a bid to stoke instability in the region, where Pakistan relies on China among international investors to develop mines and mineral processing.\n\n“India is now doubling down to further its nefarious agenda through its proxies,” the Pakistani army said in a statement in remarks that followed the worst fighting in nearly three decades between the nuclear-armed foes in May.\n\nThe Baloch Liberation Army (BLA) is the strongest among the insurgent groups long operating in the area bordering Afghanistan and Iran, a mineral-rich region.\n\nIn recent months, separatists have stepped up their attacks, mostly targeting Pakistan’s military, which has launched an intelligence-based offensive against them.\n\nTheir other main targets have been Chinese nationals and interests, in particular the strategic port of Gwadar on the Arabian Sea, with the separatists accusing Beijing of helping Islamabad to exploit resources.\n\n\n\nThe BLA blew up a railway track and took over 400 train passengers hostage in an attack in March that killed 31.",
    "date": "2025-07-11"
  },
  {
    "title": "Trump puts 35% tariff on Canada, eyes 15%-20% tariffs for others",
    "url": "https://kathmandupost.com/world/2025/07/11/trump-puts-35-tariff-on-canada-eyes-15-20-tariffs-for-others",
    "author": "By Reuters",
    "read_time": "3 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/imgi1U4UK3VKZJJKCVIEPV5GNUZPHRY-1752209087.jpg",
    "body": "US President Donald Trump said on Thursday the United States would impose a 35% tariff on imports from Canada next month and planned to impose blanket tariffs of 15% or 20% on most other trading partners.\n\nIn a letter released on his social media platform, Trump told Canadian Prime Minister Mark Carney the new rate would go into effect on August 1 and would go up if Canada retaliated.\n\nIn a post on X late on Thursday, Carney said his government will continue to defend Canadian workers and businesses in their negotiations with the US as they work towards that deadline.\n\nThe 35% tariff is an increase from the current 25% rate that Trump had assigned to Canada and is a blow to Carney, who was seeking to agree a trade pact with Washington.\n\nAn exclusion for goods covered by the United States-Mexico-Canada Agreement (USMCA) on trade was expected to stay in place, and 10% tariffs on energy and fertilizer were also not set to change, though Trump had not made a final decision on those issues, an administration official said.\n\nTrump complained in his letter about what he referred to as the flow of fentanyl from Canada as well as the country’s tariff- and non-tariff trade barriers that hurt US dairy farmers and others. He said the trade deficit was a threat to the US economy and national security.\n\n“If Canada works with me to stop the flow of Fentanyl, we will, perhaps, consider an adjustment to this letter,” Trump wrote.\n\nCanadian officials say a miniscule amount of fentanyl originates from Canada but they have taken measures to strengthen the border.\n\n“Canada has made vital progress to stop the scourge of fentanyl in North America. We are committed to continuing to work with the United States to save lives and protect communities in both our countries,” Carney added in his X post late Tuesday.\n\nThe prime minister said last month that he and Trump had agreed to wrap up a new economic and security deal within 30 days.\n\nTrump has broadened his trade war in recent days, setting new tariffs on a number of countries, including allies Japan and South Korea, along with a 50% tariff on copper.\n\nIn an interview with NBC News published on Thursday, Trump said other trading partners that had not yet received such letters would likely face blanket tariffs.\n\n“Not everybody has to get a letter. You know that. We’re just setting our tariffs,” Trump said in the interview.\n\n“We’re just going to say all of the remaining countries are going to pay, whether it’s 20% or 15%. We’ll work that out now,” Trump was quoted as saying by the network.\n\nCanada is the second-largest US trading partner after Mexico, and the largest buyer of US exports. It bought $349.4 billion of US goods last year and exported $412.7 billion to the US, according to US Census Bureau data.\n\nCarney, who led his Liberal Party to a comeback election victory earlier this year with a pledge to tackle trade challenges with the US, had been aiming to negotiate a trade deal with its key trading partner by July 21.\n\nTrump, in his letter, did not specifically address how trade negotiations were proceeding, but he said the “tariffs may be modified, upward or downward, depending on our relationship with your Country.”\n\nLast month, the Carney government scrapped a planned digital services tax targeting US technology firms after Trump abruptly called off trade talks saying the tax was a “blatant attack.”",
    "date": "2025-07-11"
  },
  {
    "title": "NEPSE this week",
    "url": "https://kathmandupost.com/money/2025/07/11/nepse-this-week-1752202883",
    "author": "By Post Report",
    "read_time": "1 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/thumb1726220193117267978501732240474-1741830500.jpg",
    "body": "",
    "date": "2025-07-11"
  },
  {
    "title": "Awards categories and their nominees for National Music Awards",
    "url": "https://kathmandupost.com/art-culture/2025/07/11/awards-categories-and-their-nominees-for-national-music-awards",
    "author": "By Post Report",
    "read_time": "2 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/202507053-1752201312.jpg",
    "body": "National Music Awards 2081, organised by Radio Kantipur, will take place on July 12 at the Godavari Sunrise Convention Center.\n\nLet’s take a look at the fifteen award categories and their nominees.\n\nThe categories are: Best Singer (Adhunik male), Best Singer (Adhunik female), The best playback singer (male), The best playback singer (female), Best music director, Best hiphop and R&B, People’s choice award, Best debut singer, Best singer (pop male), Best singer (pop female), Best lyricist, Best singer (lok male), Best singer (lok female) and Best band.\n\nShiva Pariyar, Satyaraj Acharya, Prabin Nepali, Bishow Nepali, and Sashi Gurung are the nominees for Best Singer (Adhunik male). Similarly, Rachana Rimal, Tika Prasain, Laboni Chakraborty, Babina Bhattrai, and Samikshya Adhikari are the nominees for Best Singer (Adhunik female).\n\nRoman Bajracharya, Sanup Paudel, Ashish Aviral, SD Yogi, and Nishan Bhattrai are the Best Playback Singer (male) nominees. Samikshya Adhikari, Jhuma Limbu, Sunita Thegim, Shanti Shree Pariyar, and Salina BK are the nominees for the Best Playback Singer (female).\n\nBB Anuragi, Sanjeev Baraili, Sunil Maskey, Suraj Pandit, and Kriti Neupane are nominated for Best Music Director. mmmmOmg Spark, Vek/Jamsey, Dmitri, Brijesh Shrestha, Yabesh & Bizen are nominated for Best Hi-Pop and R&B.\n\nThe nominees for the People’s Choice Award are Kuma Sagar & The Khwopa Band, Sushant KC/Indrakala Rai, Durgesh Thapa/Samikshya Adhikari, Shanta Rani Pariyar, and Shanti Shree Pariyar.\n\nSubhod Sagar Dhakal, RC Rimal, Subash Sundas, Neeru Budha Magar and Karan Pariyar are the nominees for Best Debut Singer.\n\nSushant KC, Sujan Chapagain, Sajjan Raj Vaidya, John Chamling Rai and Swoopna Suman are nominated for Best Singer (Pop male). Likewise, for Best Singer (Pop female), Astha Tamang Maskey, Rachana Dahal, Trishala Gurung, Samriddhi Rai and Sajja Chaulagain are nominated.\n\nSambhu Jamarkattel, Bhushan Kharel, Damodar Regmi, Dinesh Adhikari, and Abeeral Thapa are the nominees for Best Lyricist.\n\nRita Thapamagar, Anju Bishwakarma, Purna Kala BC, Devi Gharti, and Shanti Shree Pariyar are nominated for Best Singer (Lok female). Similarly, Shirish Devkota, Mausham Gurung, Khem Century, Prakash Dutraj, and Bishwo Dong are the nominees for Best Singer (Lok male).\n\nLastly, the nominees for Best Band include Kuma Sagar & The Khwopa Band, Swar Ft John Chamling Rai, Rockheads, Abhaya and The Steam Engines, Purna Rai & Dajubhai Haru.",
    "date": "2025-07-11"
  },
  {
    "title": "PM Oli urges sports council to expedite NPL preparations",
    "url": "https://kathmandupost.com/sports/2025/07/11/pm-oli-urges-sports-council-to-expedite-npl-preparations",
    "author": "By Post Report",
    "read_time": "1 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/sports/oli-1752201039.jpg",
    "body": "Prime Minister KP Sharma Oli has instructed the National Sports Council to expedite preparations for the second edition of the Nepal Premier League, urging the sporting authority to work with a “team spirit” and avoid any political interference in the development of sports.\n\nSpeaking at the inauguration of the National High Performance Centre and Sports Science Research Centre at Satdobato, Oli stressed the importance of organising the second edition of the NPL, which is organised by the Cricket Association of Nepal.\n\nThe tournament’s future came into question after earlier directives—allegedly issued under the instruction of Sports Minister Tejulal Chaudhary—ordered a halt to ongoing preparations.\n\n“The sports sector is gradually becoming an arena not only of national pride but also of income and enterprise,” Oli said, adding that stakeholders should cooperate with each other to strengthen Nepal’s sporting ecosystem.\n\nReferring to his recent visit to Spain, where he toured the Santiago Bernabéu Stadium, Oli also announced plans to construct a 50,000-capacity stadium in Suryabinayak, Bhaktapur, noting that the current capacity of Dasharath Stadium is inadequate for the growing sports craze in the country.\n\nIn a separate directive, Oli ordered the NSC to ensure the 10th National Games are held as scheduled from November 18 to 25 in Birendranagar, Surkhet.\n\nOli warned that any further delay would amount to “a matter of national embarrassment.”",
    "date": "2025-07-11"
  }
]