[
  {
    "title": "Sacked Russian transport minister found dead in his car with gunshot wound",
    "url": "https://kathmandupost.com/world/2025/07/07/sacked-russian-transport-minister-found-dead-in-his-car-with-gunshot-wound",
    "author": "By Reuters",
    "read_time": "3 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/world/Starovoit-1751906315.jpg",
    "body": "Russia’s sacked transport minister has been found dead in his car outside Moscow with a gunshot wound and the principal hypothesis is that he took his own life, state investigators said on Monday, hours after President Vladimir Putin fired him.\n\nA presidential decree published earlier on Monday gave no reason for the dismissal of Roman Starovoit after barely a year in the job, though political analysts were quick to raise the possibility that he may have been dismissed in connection with an investigation into corruption in the region he once ran.\n\nReuters could not independently confirm these suggestions, though a transport industry source, who declined to be named due to the sensitivity of the matter, said Starovoit’s position had been in question for months due to questions about the same corruption scandal, which centred on funds earmarked for fortifying Russia's border with Ukraine in the Kursk region.\n\nThere were conflicting reports about the timing of Starovoit’s death. Russia's Investigative Committee, which probes major crimes, said in a statement it was working to establish the precise circumstances.\n\nVarious Russian media cited law enforcement sources as saying a pistol belonging to Starovoit had been found alongside his body in his car.\n\nBefore being appointed transport minister in May 2024, Starovoit had been governor of the Kursk region for nearly five years.\n\nThree months after he became transport minister, Ukrainian troops crossed the border into Kursk in the biggest foreign incursion into Russian territory since World War Two and were only pushed out earlier this year after fierce fighting and widespread destruction.\n\nIn April this year, Starovoit’s successor as governor, Alexei Smirnov, was charged with embezzling money earmarked for defence purposes amid accusations that the funds earmarked for border defences had been stolen, leaving Kursk more vulnerable to Ukrainian attack.\n\nPressed earlier on Monday by reporters on whether his dismissal meant Putin had lost trust in Starovoit over Kursk, Kremlin spokesman Dmitry Peskov said “a loss of trust is mentioned if there is a loss of trust”.\n\n“There is no such wording in the (Kremlin) decree.”\n\nTRANSPORT CHALLENGES\n\nStarovoit’s dismissal comes at a time of significant challenges for Russia’s transport sector as the war in Ukraine drags on for a fourth year.\n\nRussia’s aviation sector is short of spare parts and Russian Railways, the country's largest employer, is grappling with soaring interest costs as high rates - needed to curb higher inflation exacerbated by the war - take their toll.\n\nThe Kremlin said Andrei Nikitin, a former governor of the Novgorod region, had been appointed acting transport minister and it published photographs of him shaking hands with Putin in the Kremlin.\n\nAsked about Nikitin’s swift appointment, Kremlin spokesman Peskov said: “At present, in the president’s opinion, Andrei Nikitin's professional qualities and experience will best contribute to ensuring that this agency, which the president described as extremely important, fulfils its tasks and functions.”\n\nTwo transport industry sources said plans to replace Starovoit with Nikitin had been in the works since before last month's International Economic Forum in St. Petersburg.\n\nThe transport ministry declined to comment on Monday.\n\nAt his meeting with Putin, Nikitin spoke about working on the huge task of digitising Russia’s transport industry in an effort to reduce cargo bottlenecks and ensure smoother cross-border flows of goods.",
    "date": "2025-07-07"
  },
  {
    "title": "Pakistan confiscates 18 lions kept as pets in crackdown after attack",
    "url": "https://kathmandupost.com/world/2025/07/07/pakistan-confiscates-18-lions-kept-as-pets-in-crackdown-after-attack",
    "author": "By Reuters",
    "read_time": "1 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2019/default/tkp-no-image-bnw.jpg",
    "body": "Eighteen lions kept illegally as pets have been confiscated in Pakistan's Punjab region, authorities said on Monday as they launched a crackdown after one escaped from a house and attacked a woman and two children.\n\nThe woman suffered scratches and bruises, and the two children, aged five and seven, were hospitalised after the attack last week but their injuries were not life-threatening, provincial wildlife officials said.\n\nThe lion, which was kept without a licence in a house in Lahore, was confiscated and sent to a local safari park, said Mubeen Elahi, director general of the provincial Wildlife and Parks Department. The owner was later arrested, police said.\n\nKeeping exotic animals as pets has been fuelled by social media, with owners often showing off their animals online as status symbols.\n\n“According to the new regulations for keeping big cats, no individual is allowed to keep a lion without a licence, without adhering to the required cage size, and without following other standard operating procedures,” Elahi said.\n\nThe punishment is up to seven years in jail.\n\nAs well as confiscating the 18 animals, the department raided 38 lion and tiger breeding farms and arrested eight people for violating the rules, he said, adding that all farms will be inspected by the end of this week.\n\nThere are 584 lions and tigers in homes and breeding farms in Punjab, Pakistan’s most populous province, he said.\n\n“I know plenty of people who keep big cats as pets,” said Qaim Ali, 30, who himself had a lion but sold it after it attacked his nephew.\n\n“Most of them are not interested in breeding but keep them as a symbol of power and influence in society.”",
    "date": "2025-07-07"
  },
  {
    "title": "Nepal’s evolving ties with India and China | Idea of Nepal with Ajaya Bhadra Khanal",
    "url": "https://kathmandupost.com/videos/2025/07/07/nepal-s-evolving-ties-with-india-and-china-idea-of-nepal-with-ajaya-bhadra-khanal",
    "author": "By Post Report",
    "read_time": "1 min read",
    "image_url": "https://img.youtube.com/vi/B1CoG8uIctY/0.jpg",
    "body": "Khanal has over the past few years been involved in extensive research on Nepal-India and Nepal-China relations. In this interview, we discuss the current state of Nepal’s bilateral ties with its two neighbours, the status of BRI projects in Nepal, FDI from the two countries, and Nepal’s negotiation style, especially with China.",
    "date": "2025-07-07"
  },
  {
    "title": "Prime Minister Oli, Swiss Foreign Minister Cassis discuss deepening Nepal-Switzerland ties",
    "url": "https://kathmandupost.com/national/2025/07/07/prime-minister-oli-swiss-foreign-minister-cassis-discuss-deepening-nepal-switzerland-ties",
    "author": "By Post Report",
    "read_time": "1 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/PMOLI-1751896191.jpg",
    "body": "Prime Minister KP Sharma Oli held a meeting with visiting Swiss Foreign Minister Ignazio Cassis in Kathmandu on Monday, where both sides reaffirmed their commitment to enhancing Nepal-Switzerland bilateral relations.\n\nPrime Minister Oli's secretariat informed that the discussions held in the Prime Minister's official residence at Baluwatar focused on strengthening the longstanding friendship between the two nations and expanding cooperation in key areas of development.\n\nEarlier in the day, Home Minister Ramesh Lekhak hosted a working luncheon in honour of Foreign Minister Cassis and his delegation.\n\nAlso in attendance were foreign secretary Amrit Bahadur Rai and senior officials from the ministries of foreign affairs, home affairs, and finance.\n\nAccording to a press release issued by the Ministry of Foreign Affairs, the two ministers held cordial and productive talks on a wide range of bilateral issues, including economic cooperation, Nepal’s upcoming graduation from Least Developed Country (LDC) status, and the promotion of trade, tourism, and investment.\n\nDiscussions also touched on transitional justice and migration, both areas of shared interest between the two governments.\n\nBoth sides expressed satisfaction with the current state of bilateral ties and pledged to deepen cooperation in the coming years.\n\nIgnazio Cassisarrivedin Kathmandu on Sunday for an official visit and is scheduled to return to Switzerland on Tuesday.",
    "date": "2025-07-07"
  },
  {
    "title": "UN council votes to keep researching abuses for LGBT people despite US U-turn",
    "url": "https://kathmandupost.com/world/2025/07/07/un-council-votes-to-keep-researching-abuses-for-lgbt-people-despite-us-u-turn",
    "author": "By Reuters",
    "read_time": "1 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/world/RAINBOWFLAG-1751895233.jpg",
    "body": "The UN Human Rights Council voted on Monday to renew the mandate of an LGBT rights expert, a move welcomed by advocates amid the absence of the United States, a former key supporter that is now rolling back such protections.\n\nWestern diplomats had previously voiced concerns about the renewal of the mandate of South African scholar Graeme Reid who helps to boost protections by documenting abuses and through dialogue with countries.\n\nThe motion for a three-year renewal passed with 29 votes in favour, 15 against and three abstentions. Supporters included Chile, Germany, Kenya and South Africa while several African nations and Qatar opposed it.\n\n“The renewal of this mandate is a spark of hope in a time when reactionary powers worldwide are trying to dismantle progress that our communities fought so hard to achieve,” said Julia Ehrt, executive director of campaign group ILGA World.\n\nThe United States, which has disengaged from the council under President Donald Trump, citing an alleged antisemitic bias, was previously a supporter of the mandate under the Biden administration.\n\nSince taking office in January, Trump has signed executive orders to curb transgender rights and dismantle diversity, equity and inclusion practices in the government and private sector.\n\nHis administration says such steps restore fairness, but civil rights and LGBT advocates say they make marginalised groups more vulnerable.\n\nIn negotiations before the vote, Pakistan voiced opposition to the mandate on behalf of Muslim group OIC, calling it a tool to advocate “controversial views”.",
    "date": "2025-07-07"
  },
  {
    "title": "Seven-member parliamentary committee formed to probe ‘cooling-off period’ tampering in civil service bill",
    "url": "https://kathmandupost.com/national/2025/07/07/seven-member-parliamentary-committee-formed-to-probe-cooling-off-period-tampering-in-civil-service-bill",
    "author": "By Post Report",
    "read_time": "2 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/news/coolingoffperiodcommittee-1751891005.jpg",
    "body": "Speaker Devraj Ghimire has formed a seven-member special parliamentary committee to investigate suspected tampering with the ‘cooling-off period’ provision in the Federal Civil Service Bill.\n\nSpeaker Ghimire announced the committee’s formation during Monday’s House meeting.\n\nNepali Congress lawmaker Jeevan Pariyar will lead the panel, which is given 21 days to complete the task and submit a report.\n\nThe committee was formed under Rule 180 of the House of Representatives Regulations, which states that the House can form a special committee to address sensitive or serious matters.\n\nThe issue drewcontroversylast week after it was revealed that the bill endorsed by the plenary of the House of Representatives a week ago included a provision regarding the ‘cooling-off period’ which is just the opposite of what had been unanimously passed by the State Affairs and Good Governance Committee.\n\nThe committee had originally recommended retaining the clause, intended to ensure ethical transitions in government service.\n\nThe ‘cooling off period’ provision endorsed by the committee bars any government officials from political appointments for at least two years after their retirement or resignation.\n\nThe probe panel will examine how the bill’s original content—particularly the provision related to a two-year waiting period for officials before assuming new posts—was altered keeping the lawmakers in the dark.\n\nThe seven-member panel comprises two lawmakers each from the Nepali Congress and the CPN-UML, and one each from the CPN (Maoist Centre), the Rastriya Swatantra Party (RSP), and the Rastriya Prajatantra Party (RPP).\n\nAccording to the notice read out in the House meeting, Pariyar and Sushila Thing will represent Congress, Narayan Prasad Acharya and Ishwari Gharti will represent UML and Madhav Sapkota will represent Maoist Centre in the committee. Ganesh Parajuli of RSP and Roshan Karki of RPP are other members of the panel.\n\nThe committee has been entrusted with four specific tasks–finding how the tampering occurred; its reasons; identifying the persons involved in the tempering; and recommending corrective measures.\n\nThe investigation is expected to involve officials from the bill’s drafting process, including those from the Ministry of Federal Affairs and General Administration, the Ministry of Law, and the secretariat of the State Affairs Committee.\n\nIt can also take the support of experts if deemed necessary.",
    "date": "2025-07-07"
  },
  {
    "title": "NEPSE falls as turnover also declines",
    "url": "https://kathmandupost.com/money/2025/07/07/nepse-falls-as-turnover-also-declines",
    "author": "By Post Report",
    "read_time": "1 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/news/nepsedown-1751885683.jpg",
    "body": "The Nepal Stock Exchange (NEPSE) index declined by 22.35 points on Monday, closing at 2,684.01 points, down by 0.82 percent compared to the previous session.\n\nTotal turnover stood at Rs8.37 billion, down from Rs9.5 billion recorded on Sunday, signalling a fall in both investor activity and sentiment. A total of 19.41 million shares were traded in 71,313 transactions.\n\nAccording to NEPSE, share prices of 39 companies rose while 209 declined.\n\nOnly two sub-indices—Hotels & Tourism and Mutual Funds—registered gains, with the Hotels & Tourism sector rising by 41.80 points. All other sectors ended the day in the red.\n\nThe drop in both the index and turnover reflects a cautious start to the week, as investors appear to be taking a wait-and-see approach following several sessions of market volatility.",
    "date": "2025-07-07"
  },
  {
    "title": "Nepal to host Bangladesh for two international friendlies in September",
    "url": "https://kathmandupost.com/football/2025/07/07/nepal-to-host-bangladesh-for-two-international-friendlies-in-september",
    "author": "By Post Report",
    "read_time": "1 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/news1751870901-1751874402.png",
    "body": "Nepal are set to host Bangladesh in two international friendly matches on September 6 and 9 at the Dashrath Stadium in Kathmandu.\n\nBoth matches fall under the FIFA International Window, the All Nepal Football Association said.\n\nThe friendlies will serve as crucial preparations for Nepal ahead of their remaining matches in the AFC Asian Cup Qualifiers.\n\nNepal have been drawn in Group F alongside Malaysia, Laos, and Vietnam. The team has so far played two matches in the group stage but are yet to register a point, having lost both encounters.\n\nNepal are next scheduled to face Vietnam away from home on October 9 as part of the ongoing qualifiers.",
    "date": "2025-07-07"
  },
  {
    "title": "Parliamentary committee endorses names of three proposed Supreme Court justices",
    "url": "https://kathmandupost.com/national/2025/07/07/parliamentary-committee-endorses-names-of-three-proposed-supreme-court-justices",
    "author": "By Post Report",
    "read_time": "1 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/GopalDahalKTM23DG0338copy-1751872498.jpg",
    "body": "The Parliamentary Hearing Committee on Monday endorsed the names of three individuals proposed for appointment as Supreme Court justices and one member of the Judicial Council.\n\nAccording to joint secretary Nirmala Devi Lamichhane Wasti, the panel approved the nominations of senior advocate Meghraj Pokharel, Chief Judge of Janakpur High Court Shreekant Paudel, and Chief Judge of Dipayal High Court Shanti Singh Thapa as Supreme Court justices.\n\nThe committee also endorsed the nomination of Mahesh Kumar Nepal as a member of the Judicial Council.\n\nAccording to the committee, the nominations were unanimously approved following discussions on their vision and opinions. The committee held discussions with the individuals filing complaints regarding their nominees before conducting the hearing. Two complaints were registered against Pokharel and Paudel each, while Thapa faced one complaint.\n\nThe Judicial Council on June 10 recommended their names for appointment as justices in the top court.\n\nArticle 292 of the constitution requires the chief justice, justices, and those nominated to constitutional commissions and ambassadorial posts to pass parliamentary hearings before they take the oath of office.\n\nEarlier, the committee advised Minister for Law, Justice and Parliamentary Affairs Ajay Kumar Chaurasiya to ensure inclusivity in appointments to the judiciary and constitutional bodies. Minister Chaurasiya assured that the government would implement the committee’s suggestions.",
    "date": "2025-07-07"
  },
  {
    "title": "President Paudel felicitates Nepal’s U-16 cricket champions",
    "url": "https://kathmandupost.com/cricket/2025/07/07/president-paudel-felicitates-nepal-s-u-16-cricket-champions",
    "author": "By Post Report",
    "read_time": "1 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/OfficeofthePresidentofNepal2310000602681copy-1751872366.jpg",
    "body": "President Ramchandra Paudel on Monday lauded the rising enthusiasm for cricket in Nepal and commended the dedication of Nepali players, saying their recent success is a result of their commitment and hard work.\n\nCongratulating the ACC Men’s U-16 East Zone Cup champions at the Sheetal Niwas, the President’s Office, President Paudel said Nepal’s title win against Singapore in the final enhanced the country’s image and brought honour to all Nepalis.\n\nNepal defeated Singapore by two wickets in Saturday’s final to clinch the title. The team remained unbeaten throughout the tournament. Nepal had previously won the tournament in 2017, 2019 and 2023.",
    "date": "2025-07-07"
  },
  {
    "title": "Trump threatens extra 10% tariffs on BRICS as leaders meet in Brazil",
    "url": "https://kathmandupost.com/world/2025/07/07/trump-threatens-extra-10-tariffs-on-brics-as-leaders-meet-in-brazil",
    "author": "By Reuters",
    "read_time": "4 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/imgi1O3ICMAJP6ZOJ5PROLKO4GGMLNQ-1751870712.jpg",
    "body": "President Donald Trump said the US will impose an additional 10% tariff on any countries aligning themselves with the “Anti-American policies” of the BRICS group of developing nations, whose leaders kicked off a summit in Brazil on Sunday.\n\nWith forums such as the G7 and G20 groups of major economies hamstrung by divisions and the disruptive “America First” approach of the US president, the BRICS is presenting itself as a haven for multilateral diplomacy amid violent conflicts and trade wars.\n\nIn a joint statement from the opening of the BRICS summit in Rio de Janeiro released on Sunday afternoon, the group warned the rise in tariffs threatened global trade, continuing its veiled criticism of Trump’s tariff policies.\n\nHours later, Trump warned he would punish countries seeking to join with the grouping.\n\n“Any Country aligning themselves with the Anti-American policies of BRICS, will be charged an ADDITIONAL 10% Tariff. There will be no exceptions to this policy. Thank you for your attention to this matter!” Trump said in a post on Truth Social.\n\nTrump did not clarify or expand on the “Anti-American policies” reference in his post.\n\nTrump’s administration is seeking to finalize dozens of trade deals with a wide range of countries before his July 9 deadline for the imposition of significant “retaliatory tariffs”.\n\nThe original BRICS group gathered leaders from Brazil, Russia, India and China at its first summit in 2009. The bloc later added South Africa and last year included Egypt, Ethiopia, Indonesia, Iran, and the United Arab Emirates as members. Saudi Arabia has held off formally joining, according to sources, while another 30 nations have expressed interest in participating in the BRICS, either as full members or partners.\n\nIndonesia’s senior economic minister, Airlangga Hartarto, is in Brazil for the BRICS summit and is scheduled to go to the US on Monday to oversee tariff talks, an official told Reuters. India’s foreign ministry did not immediately respond to a request for comment.\n\nIn opening remarks to the summit earlier, Brazil’s President Luiz Inacio Lula da Silva drew a parallel with the Cold War’s Non-Aligned Movement, a group of developing nations that resisted joining either side of a polarized global order.\n\n“BRICS is the heir to the Non-Aligned Movement,” Lula told leaders. “With multilateralism under attack, our autonomy is in check once again.”\n\nBRICS nations now represent more than half the world’s population and 40% of its economic output, Lula noted in remarks on Saturday to business leaders, warning of rising protectionism.\n\nGROWING CLOUT, COMPLEXITY\n\nExpansion of the bloc has added diplomatic weight to the gathering, which aspires to speak for developing nations across the Global South, strengthening calls for reforming global institutions such as the United Nations Security Council and the International Monetary Fund.\n\n“If international governance does not reflect the new multipolar reality of the 21st century, it is up to BRICS to help bring it up to date,” Lula said in his remarks, which highlighted the failure of US-led wars in the Middle East.\n\nStealing some thunder from this year’s summit, Chinese President Xi Jinping chose to send his premier in his place. Russian President Vladimir Putin is attending online due to an arrest warrant from the International Criminal Court related to his war in Ukraine.\n\nStill, several heads of state were gathered for discussions at Rio’s Museum of Modern Art on Sunday and Monday, including Indian Prime Minister Narendra Modi and South African President Cyril Ramaphosa.\n\nHowever, there are questions about the shared goals of an increasingly heterogeneous BRICS group, which has grown to include regional rivals along with major emerging economies.\n\nIn the joint statement, the leaders called attacks against Iran’s “civilian infrastructure and peaceful nuclear facilities” a “violation of international law.”\n\nThe group expressed “grave concern” for the Palestinian people over Israeli attacks on Gaza, and condemned what the joint statement called a “terrorist attack” in India-administered Kashmir.\n\nThe group voiced its support for Ethiopia and Iran to join the World Trade Organization, while calling to urgently restore its ability to resolve trade disputes.\n\nThe leaders’ joint statement backed plans to pilot a BRICS Multilateral Guarantees initiative within the group’s New Development Bank to lower financing costs and boost investment in member states, as first reported by Reuters last week.\n\nIn a separate statement following a discussion of artificial intelligence, the leaders called for protections against unauthorized use of AI to avoid excessive data collection and allow mechanisms for fair payment.\n\nBrazil, which also hosts the United Nations climate summit in November, has seized on both gatherings to highlight how seriously developing nations are tackling climate change, while Trump has slammed the brakes on US climate initiatives.\n\nChina and the UAE signaled in meetings with Brazilian Finance Minister Fernando Haddad in Rio that they plan to invest in a proposed Tropical Forests Forever Facility, according to two sources with knowledge of the discussions about funding conservation of endangered forests around the world.",
    "date": "2025-07-07"
  },
  {
    "title": "Bodies of four murdered in Bhojpur sent to Dharan for autopsy",
    "url": "https://kathmandupost.com/province-no-1/2025/07/07/bodies-of-four-murdered-in-bhojpur-sent-to-dharan-for-autopsy",
    "author": "By Dipendra Shakya",
    "read_time": "1 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/news/murder-1751864907.jpg",
    "body": "The bodies of four members of a family who were brutally murdered in ward 1 of Ram Prasad Rai Rural Municipality in Bhojpur on Saturday night have been sent to the BP Koirala Institute of Health Sciences (BPKIHS) in Dharan for autopsy.\n\nThe district hospital in Bhojpur could not conduct the postmortem due to ‘technical limitations’, prompting the authorities to transfer the bodies. The Bhojpur Chief District Officer Suresh Panthi said the postmortem would be carried out on Monday.\n\nThe incident site lies around 32 kilometres from the district headquarters. The murder suspect, 30-year-old Rajendra Rai, was found seriously injured at the scene and is currently undergoing treatment at BPKIHS, Dharan.\n\nPolice have accusedRai of killing his wife and three in-laws using a sharp weapon. All were found dead at their home in Dhodlekhani.According to police, after the attack, Rai called the authorities himself and confessed to the crime. “I have killed people. Come and arrest me,” he reportedly told police during the phone call. Responding officers found him with a deep stab wound in his abdomen and rushed him to Bhojpur District Hospital before referring him to Dharan for further treatment.\n\nRajendra has claimed that he acted in self-defence, saying his mother-in-law attempted to stab him first, and that he seized the knife and used it to attack the family. Deputy Inspector General of Nepal Police Ishwar Karki, chief of the Koshi Province Police Office, said the case is still under investigation and all the information gathered are being verified.",
    "date": "2025-07-07"
  },
  {
    "title": "Survey of Kalanki–Basundhara Ring Road section completed",
    "url": "https://kathmandupost.com/national/2025/07/07/survey-of-kalanki-basundhara-ring-road-section-completed",
    "author": "By Bimal Khatiwada",
    "read_time": "2 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2019/third-party/thumb-1751864773.jpg",
    "body": "A Chinese technical team has completed a detailed survey of the 8.2-kilometre section of the Ring Road from Kalanki to Basundhara, marking an important step forward in the long-delayed road widening project.\n\nThe two-and-a-half-month survey was conducted by 18 technicians from China’s state-owned CCCC First Highway Consultants and Xi’an Fangzhou Engineering Consultants. The team arrived in Nepal on April 19 and is scheduled to return to China within a week.\n\nArjun Prasad Aryal, chief of the Development Cooperation Implementation Division at the Department of Roads, said the design report will arrive from China within three months. “Once the design is submitted, we will review it within a month, make necessary revisions, and send it back for final approval,” he said.\n\nAccording to Aryal, the construction contract process is expected to be completed within five months, and the contractor—who will be selected in China—will commence work shortly after. The project is being implemented under a government-to-government agreement signed in 2018, with financial support from the Chinese government.\n\nThe proposed road expansion will transform the existing road—currently four lanes from Kalanki to Sitapaila and two lanes beyond—into an eight-lane road, excluding service lanes. A flyover has been proposed at Machhapokhari to ease traffic congestion, and a bridge will be constructed near the Dhungedhara area of Banasthali to replace an existing culvert.\n\nSushil Babu Dhakal, chief of the Development Assistance Coordination and Quality Division under the Ministry of Physical Infrastructure and Transport, said the ministry has requested the Chinese engineers to design the bridge in a way that helps ease traffic flow.\n\nMeanwhile, work on the third section of the Ring Road—from Narayan Gopal Chowk to Dhumbarahi—has slowed considerably. Although the project had set a mid-July deadline for completion, only 35 percent of the work has been completed so far, according to Narayan Dutta Bhandari, chief of the Kathmandu Road Division.\n\n“We are now focused on completing blacktopping of one side of the road by mid-July,” said Bhandari. “But due to the monsoon, the work has been delayed. We now expect to finish this section by Dashain (October first week).” Construction of drainage systems, culverts, and retaining walls is currently ongoing.",
    "date": "2025-07-07"
  },
  {
    "title": "Swiss Foreign Minister Cassis arrives in Kathmandu",
    "url": "https://kathmandupost.com/national/2025/07/07/swiss-foreign-minister-cassis-arrives-in-kathmandu",
    "author": "By Post Report",
    "read_time": "1 min read",
    "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/GvMO0nMXIAAUWRB-1751862889.jpg",
    "body": "Switzerland’s Foreign Minister Ignazio Cassis arrived in Kathmandu on Sunday evening on a three-day official visit to Nepal.\n\nGanesh Prasad Dhakal, joint secretary and Head of the Europe Division at Nepal’s Ministry of Foreign Affairs, and other officials welcomed him to Tribhuvan International Airport.\n\nCassis is leading a high-level delegation and is expected to hold talks with senior Nepali leaders and government officials during his stay.\n\nThe visit aims to enhance bilateral cooperation in development, climate resilience, and economic partnership, officials said.",
    "date": "2025-07-07"
  }
]