{
  "politics": [
    {
      "url": "https://kathmandupost.com/politics/2025/07/07/hindu-state-debate-returns-in-congress",
      "title": "Hindu state debate returns in Congress",
      "body": "The issue of restoring Nepal’s Hindu state status has resurfaced in the ongoing central committee meeting of the Nepali Congress.\n\nThe renewed debate has revealed a deep ideological struggle within the grand old party over religion, identity, and voter alignment, especially as new political forces gain ground and public support for traditional political parties declines.\n\nAt the party’s Mahasamiti meeting held in February 2024, some members had even launched a signature campaign in support of declaring Nepal a Hindu state. Although the campaign did not get official recognition in the party, similar calls have continued to surface in recent years. This recurring discourse has been further amplified by public statements of several senior leaders.\n\nShekhar Koirala, a leader from the party’s dissident faction, has consistently expressed his support for a Hindu state through various public platforms.\n\nSimilarly, during Sunday’s Central Committee meeting, former general secretary of the party, Shashank Koirala, once again raised the issue. Referring to the seven-point agreement between the Congress and the CPN-UML to form the government last year, he stated that constitutional amendment had been identified as a key agenda of the deal.\n\nIn this context, he argued, the process of amending the constitution should start by redefining Nepal—currently enshrined as a secular state—as a Hindu state.\n\n“Let us begin the process of amending the constitution by reinstating Nepal as a Hindu state,” a Central Committee member of the Congress quoted Shashank Koirala as saying.\n\nThis is not his first such appeal. He had previously called for the same during the party’s Mahasamiti meeting last year.\n\nPrakash Sharan Mahat, the party spokesperson also emphasised the need for the party to address its declining public support. Speaking at the meeting of the Congress Central Committee, Mahat warned that if the party fails to retain its traditional voter base which believes in historical legacy, religion, culture, civilisation, and core ideology, it could face a big setback in upcoming elections.\n\n“Our party is old, and the public is increasingly disillusioned with old parties. New parties are emerging under new names. In such a context, the erosion of our traditional base must be taken seriously,” Mahat said.\n\nHe further cautioned that unless the party clearly and firmly presents its core values—particularly its religious and cultural beliefs—it risks serious damage.\n\n“We represent the people who follow Hinduism, Buddhism, Kiratism, and nature-worship traditions. This places the party at the centre of politics. The communists reject religion, but we are believers. That is the foundation of our party, and we must protect it,” Mahat stated.\n\nBut not all Congress leaders support the idea of a Hindu state. While Shekhar and Shashank—both active members of the influential Koirala family—have stood in favour of a Hindu state, Sujata Koirala, former deputy prime Minister and foreign minister, remains firmly opposed to the demand for amending the constitution to redefine Nepal’s religious identity.\n\nSujata is the only daughter of the late prime minister Girija Prasad Koirala, under whose leadership Nepal was declared a secular state in 2007, following the success of the second People’s Movement which ended monarchical rule.\n\n“Constantly changing the country’s official identity undermines stability,” Sujata Koirala told the Post. “I stand with the secular principles enshrined in our constitution.”\n\nShe further warned that giving special status to a single religion in a religiously diverse nation like Nepal could lead to unrest. Reversing the secular status, she argued, will not be a responsible political move.\n\nShe stated that the country’s current priority should be development, and accordingly, the party must also adopt development as its principal agenda. She further added that the current need is not a debate over religion.\n\nIn this connection, the Congress Professional and Intellectuals Department, along with the party-affiliated Democratic Lawyers’ Association (DLA), hadsubmitted a report to party president Sher Bahadur Deuba in March.\n\nAccording to Dila Sangroula, chief of the party’s department, under whose leadership the party had prepared the report, the report was prepared in line with the party’s priorities on constitutional amendments as pledged during the time of formation of the current government.\n\nA key recommendation in the report is holding a nationwide discussion on secularism. The 2015 Constitution declared Nepal a secular republic, but the study committee report suggests that the party should be open to discussing the proposal to reinstate the Hindu state.\n\nIt is not unusual for voices supporting the idea of Nepal as a Hindu state—reflecting what appears to be the desire of the majority of Nepalis—to emerge in various forums of the Nepali Congress, says political analyst Geja Sharma Wagle.\n\nWagle points out that while the Congress officially stands for religious freedom, it does not necessarily advocate secularism.\n\n“But the party continues to uphold Nepal’s status as a secular state as enshrined in the constitution,” Wagle further said, “Unless the party officially changes its stance, personal views of some leaders cannot be taken as representative of the party’s official position.”",
      "date": "2025-07-07",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/thumb5-1751849606.jpg",
      "read_time": "4 min read"
    },
    {
      "url": "https://kathmandupost.com/politics/2025/07/06/parties-agree-to-form-special-parliamentary-committee-to-probe-civil-service-bill-tampering",
      "title": "Parties agree to form special parliamentary committee to probe civil service bill tampering",
      "body": "After a week of dispute and controversy, five major political parties in the House of Representatives have decided to set up a special parliamentary committee to look into the tampering of the civil service bill.\n\nThe decision was taken on Saturday during a meeting convened by Speaker Devraj Ghimire with the chief whips of the Nepali Congress, the CPN-UML, the CPN (Maoist Centre), the Rastriya Swatantra Party and the Rastriya Prajatantra Party (RPP).\n\nOn Wednesday, the State Affairs and Good Governance Committee had requested the Speaker to form a high-level committee to probe the inclusion of a provision in the report on the Federal Civil Service Bill that dilutes the bill’s 'cooling-off period' mandate.\n\nAccording to UML Chief Whip Mahesh Bartaula, the decision to form the committee was made following a discussion held on Saturday between Speaker Dev Raj Ghimire and leaders of various parties.\n\nThe committee had also requested the Speaker to find out who inserted a provision that nullifies its decision.\n\nAccording to Bartuala, the committee will have seven members, two of them representing the Congress and the UML each and one each from the Maoist Centre, the Rastriya Swatantra Party (RSP), and the RPP. The Nepali Congress will lead the probe, he added.\n\nIt has been agreed that members of the parliamentary committee in question will not be included in the investigating body. The committee will be formed after the parties submit the names of their representatives on Monday. The committee will look into the matter and identify the individuals involved in the shortcomings.\n\nWhile preparing the report on the bill, representatives from the committee secretariat, the Ministry of Federal Affairs and General Administration, and the Ministry of Law were involved in drafting clauses that rendered the provision ineffective, the State Affairs Committee concluded following the controversy.\n\n“This act appears to be conspiratorial and malicious in the context of lawmaking. Therefore, it has been decided to request the Speaker of the federal parliament to arrange for a high-level parliamentary committee to investigate who was involved and how serious mistakes or offences were committed,” according to the decision forwarded by the committee to the Speaker.\n\nAccording to Bartaula, the decision to form the committee was made in accordance with Rule 180 of the Parliamentary Regulations. The names of the members who will be on the committee are expected to be announced during the House of Representatives meeting on Monday.\n\nSpeaker Ghimire has asked all the parties to submit the names by Sunday, and emphasized that the subsequent meeting of the Business Advisory Committee will finalise the matter.\n\nChief Whip Bartaula added that the upcoming meeting of Parliament will approve the decision to form the committee. The committee will likely be given 15 days for the study.\n\nHowever, Shekhar Adhikari, media coordinator for Speaker Ghimire, said the probe committee might be given three weeks to submit its report.\n\n“The decision to form the committee should be endorsed by Parliament. Therefore, the decision will be presented to the House on Monday. The committee will have a very short period to complete its task like within 15 days…. This is linked to the internal affairs of Parliament. This will also set an example that such mistakes would not repeat in the future and any parliamentary task would be completed on a credible basis,” said Bartuala, after the meeting with Ghimire.\n\nOn Monday, ahead of the House meeting, a meeting of the Business Advisory Committee will finalise the candidates for the probe committee, Hitraj Pandey, chief whip of the Maoist Centre, said. The House will endorse it the same day.",
      "date": "2025-07-06",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/sabhamukhsachetakchalphal-1751763773.jpg",
      "read_time": "2 min read"
    },
    {
      "url": "https://kathmandupost.com/politics/2025/07/05/after-jsp-nepal-nagarik-unmukti-geared-to-quit-congress-uml-coalition",
      "title": "After JSP-Nepal, Nagarik Unmukti geared to quit Congress-UML coalition",
      "body": "Angered by the Sudurpaschim chief minister’s move to remove its minister, the Nagarik Unmukti Party has decided to stay in the opposition in both provincial and federal legislatures.\n\nWhile its provincial parliamentary party on Friday decided to withdraw its support to the Nepali Congress-led Sudurpaschim provincial government, party chairperson Ranjita Shrestha has sought a similar decision at the federal level.\n\nGanga Ram Chaudhary, parliamentary party leader of the lower house, said the party chair has asked him in writing to call a meeting and decide to this effect.\n\n“I will call the parliamentary party meeting in a couple of days after returning to Kathmandu from Kailali,” he said. “It will take a formal decision.”\n\nParty’s lawmaker Arun Kumar Chaudhary is a state minister in the incumbent KP Sharma Oli government.\n\nThe party with four seats in the House of Representatives is furious with the CPN-UML-Nepali Congress coalition after its leader Rameshwor Chaudhary, provincial minister for industry, tourism and forest, was sacked by chief minister Kamal Bahadur Shah of the Congress.\n\nThe Nagarik Unmukti is the second party that is preparing to break the partnership with the ruling alliance.\n\nThe Janata Samajbadi Party’s central committee meeting held on June 21 and 22 also decided to withdraw its support to the Oli government concluding that it has failed to deliver on key issues such as controlling corruption, ensuring good governance and improving the economy.\n\nIt has also accused the incumbent government of failing to meet expectations on constitutional amendments, economic recovery and governance.\n\nJSP-Nepal, which has five members in the House of Representatives and three in the National Assembly, extended support to the Oli government without joining the Cabinet.\n\n“Our parliamentary party meeting on Saturday will take a necessary decision to this effect,” said Rekha Yadav, the party’s member at the lower house. “I am sure it will take a decision as directed by the central committee.”\n\nThe constitution mandates the prime minister to go for a floor test if any party in the government withdraws its support. Article 100 (2) of the Constitution of Nepal says “the prime minister shall table a motion for the vote of confidence in the House of Representatives if the party which the prime minister represents is divided or the party in the government withdraws its support.”\n\nHowever, some constitutional experts say the vote of confidence is necessary when the government risks falling into minority, which is the spirit of the constitution. “Generally, the prime minister goes for a floor test if the exit of any coalition partner might take into the minority,” said Mohan Lal Acharya, a constitutional lawyer.\n\nThe UML-Congress held a comfortable majority even after the exit of the Nagarik Unmukti and the JSP-Nepal. Support of 138 lawmakers is required to secure a majority in the 275-member House of Representatives.\n\nThe past practices are not the same.\n\nIn December 2019, theSamajbadi Party led by Upendra Yadav withdrew supportto the Oli-led government of the Nepal Communist Party. The prime minister did not opt for the floor test saying he held a comfortable majority.\n\nHowever, Pushpa Kamal Dahal faced the House after the Yadav-led party quit his government in May last year despite still enjoying a comfortable majority.\n\nEven as the exit of two regional parties doesn’t affect the government, it might face problems in the legislative process. The present coalition, which commands a strong majority in the House of Representatives, doesn’t have a majority in the National Assembly.\n\nThis means getting the bills endorsed from the upper house without the JSP-Nepal’s support would be impossible.",
      "date": "2025-07-05",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/WhatsAppImage20250705at73832AM-1751681648.jpg",
      "read_time": "2 min read"
    },
    {
      "url": "https://kathmandupost.com/politics/2025/07/05/congress-central-meeting-veers-off-agenda-as-members-level-personal-allegations",
      "title": "Congress central meeting veers off agenda as members level personal allegations",
      "body": "Six days back, Nepali Congress General Secretary Gagan Thapa tabled a 13-point agenda for discussion in the party’s Central Working Committee (CWC) meeting.\n\nThe points were mostly related to the party organisation, renewal and distribution of active Congress membership, the party’s roles in the government and Parliament, sister organisations, and contemporary political, social, educational, and administrative issues.\n\nSome leaders even cautioned the party leadership against possible unity between the communist parties.\n\nBut very few CWC members were focused on the core issues concerning the party organisation and those floated by Thapa for discussion.\n\nInstead, some senior party leaders indulged in attacking each other. This began with party’s senior leader Shekhar Koirala against Congress lawmaker and industrialist Binod Chaudhary.\n\nKoirala, who leads a dissident faction in the Congress, questioned Chaudhary’s eligibility to become a CWC member. Koirala gave the example of Sujata Koirala, who was barred from the CWC because her active membership had not been older than ten years. Was Chaudhary qualified to become a central member?, Koirala asked the party leadership at the meeting.\n\nThe next day, Chaudhary defended his position and urged that the Congress should have a provision for lateral entry and welcome professionals and experts from different fields in line with global practice. Chaudhary, who was earlier a member of parliament representing the CPN-UML, offered another explanation at the meeting on his entry into the Congress.\n\nThe next day, Dinesh Koirala, who is close to Shekhar, criticised Chaudhary while backing Koirala’s argument.\n\nAlso on Friday, Govinda Raj Pokharel, who is close to Shekhar Koirala, defended the role played by the Koirala family in establishing and nurturing democracy in the country.\n\nAs of Friday, only a few central members spoke within the allotted time and focussed on the meeting’s agenda.\n\nMost others seemed to be driven by personal frustration and inferiority in comparison to rival parties while polarisation within the Congress along factional and sub-factional lines seems to be growing, said a party leader.\n\nAnother tussle erupted between General Secretary Thapa and former minister Mohan Basnet, who faces corruption charges. The Commission for Investigation of Abuse of Authority in Mayfileda corruption case against Basnet and 15 others representing two companies at the Special Court.\n\nBasnet vehemently attacked Thapa at the meeting and urged him to rein in party leaders who continue to criticise him. Refuting the serious, apolitical, impolite, and inappropriate allegations, Thapa said he does not want to become tainted by taking them up.\n\n“I don’t want to become dirty by handling dirt,” Thapa said, referring to Basnet’s allegations. Thapa said the allegations crossed the bounds of “political ethics and civility”.\n\nCentral committee members including Ram Hari Khatiwada and Ajay Babu Siwakoti spoke in Thapa’s defence.\n\nThis shows that rather than engaging with pertinent issues concerning the public, the members seemed more interested in throwing mud at each other, focusing less on substance and more on incidents or individuals.\n\n“It is true that we have lost the plot,” a central working committee member said, adding that instead of focusing on real issues facing the party, they were wasting their effort vilifying each other.\n\n“The current Central Working Committee has neither seriously revisited past decisions nor examined their implementation—how many were executed, how many were delayed and what benefits they may have brought to the party, the country, or the people,” the member said. “Not even the energetic young office bearers nor the jumbo-sized central committee seems to have found this worthy of reflection.”\n\nLeaders from “anti-establishment” factions constantly repeated the issue of timely holding the party’s 15th general convention.\n\n“They, however, failed to ask where the process for drafting necessary constitutional amendments has reached as per the government’s pledge, or why the draft committee has not yet been formed,” a leader said. “They do not even seem to realise the urgency of this issue.”\n\nShekhar Koirala and other central members close to him have been asking for a prompt announcement of the date for the general convention. But leaders close to party President Sher Bahadur Deuba don’t seem to be in a hurry.\n\nOne of them is Gyanendra Bahadur Karki.\n\nSpeaking on Friday, the former finance minister said there is no point debating whether the next general convention will take place on time.\n\n“It is us who will hold the convention,” said Karki, a trusted aide to Deuba. “Instead of raising questions in the media when the general convention will be organised, all of us should focus on making it happen.”\n\nKarki also clarified that organising the general convention is not solely the responsibility of party president Deuba.\n\n“Holding the general convention is not the responsibility of one person—the president; it is the responsibility of the entire [central] working committee,” said Karki. “Even during the 14th general convention, questions were raised about when it would be held. But he [Deuba] managed to organise it within the stipulated time.”\n\nPokharel, former vice-chairman of the National Planning Commission, discussed the economy. There has been no improvement in the country’s economy amid a long period of slump, he remarked.\n\nOverall revenue collection has not crossed 75 percent of the target, he said. There is a decline in the bank’s interest rates but loan disbursement is still low and the economic situation bleak. Pokharel also raised the issue of the party’s poor performance in government, and Parliament, and holding the general convention on time.\n\nKhatiwada said he is ready to step down as chairman of the State Affairs and Good Governance Committee if the party instructs him to do so. Khatiwada is in the eye of the storm over tempering with the \"cooling-off period\" provision in the federal civil service bill as the chair of the House committee that thrashed out issues.\n\nOpposition parties have demanded his resignation. Speaking at the party meeting about the call for his resignation from the committee, Khatiwada said, “If the party tells me to step down saying that I am at fault as chairperson, I am ready to comply.”\n\nGovinda Bhattarai proposed that a system of “cooling-off period” be introduced in politics as well.\n\n“Not only in bureaucracy, we need a ‘cooling-off period’ in politics, too,” he said. “We should not allow entry into Nepali politics as soon as an individual of Nepali origin relinquishes the citizenship of a foreign country.”",
      "date": "2025-07-05",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/news/Congressccmeeting06302025IMG0782copy-1751681327.jpg",
      "read_time": "5 min read"
    },
    {
      "url": "https://kathmandupost.com/politics/2025/07/04/court-nod-to-oli-s-appointments-leaves-executive-unchecked",
      "title": "Court nod to Oli’s appointments leaves executive unchecked",
      "body": "The constitutional bench of the Supreme Court, which had divided opinions on the legality of appointments to constitutional commissions, remained similarly split on then KP Sharma Oli government’s decision to revise the Constitutional Council Act through an ordinance.\n\nAfter sitting on 15 writ petitions for almost five years, the top court on Wednesday upheld the decision of the Oli-led Constitutional Council to recommend chiefs and members of 11 constitutional commissions, as well as then President Bidya Devi Bhandari’s decision to appoint them without parliamentary hearings.\n\nWith then Speaker Agni Prasad Sapkota and leader of the main opposition Sher Bahadur Deuba refusing to show up in the council’s meeting, the Oli administration made a controversial amendment to the Constitutional Council (functions, duties, and procedures) Act, allowing three of the six-member council to nominate candidates for appointment to constitutional commissions.\n\nThe council, on December 15, 2020, recommended 38 candidates for various commissions. Of them, 32 were appointed on February 3 of the following year. Likewise, 20 others recommended on May 4, 2o21, were appointed on June 24 that year.\n\nThe May 4 recommendations came just before then Prime Minister Oli dissolved the House of Representatives.\n\nThe appointments were made citing a provision in the parliamentary regulations which says appointments would not be obstructed if a parliamentary hearing cannot be held within 45 days of the recommendation.\n\nFifteen different petitions were filed challenging the ordinance, recommendations, and the appointments.\n\nPassing the verdict on Wednesday mid-night, three—Sapana Pradhan Malla, Manoj Kumar Sharma and Kumar Chudal—of the five-member bench upheld the appointments scrapping the writ petitions against the revision in the Act, recommendations of the office bearers and their subsequent appointments.\n\nChief Justice Prakash Man Singh Raut and justice Nahakul Subedi, however, found that the recommendations and the appointments from December 2020 and February 2021, respectively, were unlawful, and called for their scrapping.\n\nRaut and Subedi said the recommendations of 38 were made without following a mandatory provision in the Act which says all the council’s members need to be informed about the meeting 48 hours in advance. Then Speaker Sapkotahad challenged the recommendations of 38 saying it was done without informing him about the meeting.\n\nRaut and Subedi, however, agreed with the other three justices in upholding the appointments of 20 others, noting that, unlike in the case of the 38, Sapkota had not claimed he was deprived of timely information about the meeting.\n\nJustices Sharma and Chudal have explicitly said the executive holds the authority to issue ordinances at its discretion. Others were silent on the Oli government’s move to issue the ordinance. However, by upholding the appointments made based on the ordinance, they effectively aligned with Sharma and Chudal, according to constitutional experts.\n\n“The whole bench has upheld the ordinance,” said senior advocate Dinesh Tripathi, one of the petitioners. “The Constitution’s Article 114 (related to ordinance) is for exceptional situations. There was no emergency for the Oli government to issue the ordinance. By upholding the decision to issue the ordinance, the court has left the executive unbridled. It has defeated the entire purpose of constitution and constitutionalism.”\n\nHe said the bench has essentially established that parliamentary hearing is not mandatory. Upholding the appointments made on the basis of parliamentary regulations and totally ignoring the constitutional provision of parliamentary hearing means regulation can supersede the constitutional provision, according to Tripathi. Except for Malla, who has issued an order for holding parliamentary hearings of the appointees, others have not deemed it necessary.\n\nExperts say it is hard to believe that the constitutional bench did not test the constitutionality of the ordinance, which they believe contradicts the spirit of the constitution. “The bench has failed to carry out its responsibility,” said Bipin Adhikari, professor at Kathmandu University School of Law.\n\nAccording to Article 137, the role of the bench is invoked when a case requires serious constitutional interpretation. However, the Raut-led bench delivered the verdict as if it were an administrative court, without addressing the core constitutional issues, according to experts.\n\n“The key question the court was supposed to address was whether issuing an ordinance falls within the limited authority of the executive, but it completely failed to do so,” said senior advocate Raju Prasad Chapagain.\n\nThe petitioners had demanded answers as to what is the prerequisite for issuing an ordinance? Can an ordinance amend or replace an existing Act (law) by fully reversing its spirit? Whether ordinances can be issued repeatedly on the same subject was another question the court was supposed to answer but hasn’t.\n\nOf the 52 appointees, whose jobs have been secured by the top court’s decision, three have already retired after attaining 65 years of age. The remaining 49 can complete a full six-year tenure given that they don’t attain the retirement age (except in case of the National Human Rights Commission) before completing their full term.",
      "date": "2025-07-04",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/masterpiece2-1751602230.jpg",
      "read_time": "4 min read"
    },
    {
      "url": "https://kathmandupost.com/politics/2025/07/03/house-committee-sees-heated-debate-over-cooling-off-clause-tampering",
      "title": "House committee sees heated debate over ‘cooling-off’ clause tampering",
      "body": "Amid controversy over tampering some of the provisions of the Civil Service Bill, the State Affairs and Good Governance Committee has requested the National Assembly to remove the clause that hinders the implementation of the 'cooling-off period' included in the bill.\n\nAfter a heated debate on Wednesday, the committee has requested Speaker Devraj Ghimire to form a high-level parliamentary committee to look into the inclusion of a provision in the report on the Federal Civil Service Bill that dilutes the bill’s 'cooling-off period' mandate.\n\nFollowing the discussion, the committee made two decisions. In its request to the National Assembly, the committee stated:\n\n\"A decision has been made to sincerely request the National Assembly to make necessary amendments to clause 43 of the report in accordance with the spirit in which the committee passed the provision related to the cooling-off period.”\n\nThe committee has also requested the Speaker to find out who inserted a provision that nullifies the committee’s decision.\n\n\"While preparing the report on the bill, representatives from the committee secretariat, the Ministry of Federal Affairs and General Administration, and the Ministry of Law were involved in drafting clauses that rendered the provision ineffective. This act appears to be conspiratorial and malicious in the context of lawmaking. Therefore, it has been decided to request the Speaker of the federal parliament to arrange for a high-level parliamentary committee to investigate who was involved and how serious mistakes or offences were committed,” reads the second decision.\n\nRamhari Khatiwada, the committee chair, faced pressing questions from members at the meeting on Wednesday. Padam Giri of the CPN-UML asked him to resign as chairman. He also demanded that committee secretary Suraj Dura resign for tempering with the provision.\n\nBut Khatiwada defended his position and denied any role in altering the provision. Khatiwada was even targeted by his own party, Nepali Congress, during the discussion on Wednesday. Many lawmakers told him to step down as he holds moral responsibility for nullifying the “cooling off period” for top bureaucrats before taking constitutional and diplomatic assignments.\n\nBut Congress lawmaker Dilendra Prasad Badu said that Speaker Ghimire is not willing to form an investigation committee.\n\n“I have requested the Speaker for support. But I don’t see the possibility of receiving that support. The bill has already been registered in the upper house. It is the minister who goes to present it [there]. Therefore, I want to tell the minister that now this committee will move forward with an amendment proposal,” said Badu, who is a member of the committee.\n\nGhimire was a CPN-UML lawmaker before his election as Speaker and the UML was in favour of removing the “cooling-off period” for top bureaucrats.\n\nOn the other hand, senior officials involved in the drafting process claimed that they were not allowed to see the final text.\n\nA joint-secretary at the Ministry of General Administration, Mira Acharya said there was no discussion with the ministry regarding the “cooling-off period” provision in the bill.\n\n\"It was not us who finalised the report submitted by the committee secretariat,\" said Acharya. \"While the sub-committee's report was discussed during the consultation, there was no mention of removing the clause under 82(4).”\n\nAcharya explained that even when reviewing sub-clause 4, the issue of resignation in relation to retirement had not been previously included. From that point on, Acharya added, she was no longer involved, denying knowledge of what happened next. She claimed that when she sought the report for a look, it was not provided to her.\n\n\"In such a situation,\" she questioned, \"how did the Ministry of Federal Affairs get involved at all?\"\n\nJoint-secretary at the Ministry of Law Subash Bhattarai said he was not involved in the preparation of the final report. “We were not even invited for clause-by-clause discussion at the final stage,” Bhattarai said. “The provisions in sub-clause 5 were neither removed nor added by us.”\n\nBoth Acharya and Bhattarai were in the process of drafting the bill representing their respective ministries. Khatiwada said, “My integrity and reputation have been put into question, but this action happened without my involvement. Even before, I had insisted that a two-year cooling-off period must be implemented. The subcommittee also recommended two years instead of one. The failure to align that clause appears to have occurred from the Ministry of Law and the secretariat’s secretary,” he said. Khatiwada added that the report containing this provision had been handed over to Minister of General Administration Rajkumar Gupta.\n\nChief Whip of the CPN (Maoist Centre) Hit Raj Pandey said there was conspiracy surrounding the “cooling-off period”. Speaking at Wednesday's meeting, Pandey said the issue of the cooling-off period is not new, and described the recent tampering as not just interference, but a well thought out conspiracy.\n\nRajendra Prasad Pandey, a Member of Parliament from the CPN (Unified Socialist), said that the manipulation surrounding the cooling-off period has dented the integrity of lawmakers in public imagination. Speaking at the same meeting, Pandey said this was not merely an error, but an act of misconduct, and called for an impartial investigation into the matter.",
      "date": "2025-07-03",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/GopalDahalKTM18188974204a764272bb93fa52a9ba002acopy-1751504076.jpg",
      "read_time": "4 min read"
    },
    {
      "url": "https://kathmandupost.com/politics/2025/07/02/lawmakers-demand-probe-into-civil-service-bill-tampering",
      "title": "Lawmakers demand probe into civil service bill tampering",
      "body": "Lawmakers across party lines on Tuesday demanded an investigation into the unauthorised and cunning tampering of the Federal Civil Service Bill, done without Parliament’s knowledge, and harsh punishment for those responsible.\n\nThe issue was discussed during the ongoing central committee meeting of the Nepali Congress, where it was condemned as a “betrayal”.\n\nAfter it became known that the provision of a two-year “cooling-off period” for senior government officials after retirement was removed from the bill, throughout Tuesday, Speaker Devraj Ghimire, former prime ministers, senior party leaders, and members of the parliament’s State Affairs Committee and Good Governance Committee—which was entrusted to prepare the Bill and make changes—demanded a thorough investigation into what they termed “outright manipulation”.\n\nSome lawmakers and members of the State Affairs and Good Governance Committee accused the Parliament Secretariat, employees from the ministries of law, and general administration and the committee chair Ramhari Khatiwada of colluding to manipulate the bill in a way that high-ranking civil servants would not be affected by the cooling-off provision. Khatiwada has dismissed the allegations.\n\nHe issued a statement on Tuesday, saying that the distortion of the spirit of the “cooling-off period” provision in the bill while presenting it in Parliament is a serious error and unforgivable act.\n\n“This is not normal,” he said. “I request the honourable Speaker to initiate an investigation into this matter. Likewise, I request the esteemed National Assembly to restore the cooling-off period provision.”\n\nKhatiwada told the Congress party meeting on Tuesday that the clause to dilute the two-year ‘cooling-off period’ provision was inserted by the Ministry of Law.\n\nKhatiwada said the provision passed by the committee was amended—as one sub-clause was changed and another added—before it reached Parliament. He added that Law Secretary Parashar Dhungana was absent from the meeting called by Speaker Devraj Ghimire.\n\nKhatiwada said, “A sub-clause was inserted without our knowledge—none of us on the committee knew about it. We were not informed about what was written in the sub-clause. Not just the committee, even Parliament was not informed about it.”\n\nNepali Congress spokesperson Prakash Sharan Mahat said the matter should be probed because it was an act of betrayal.\n\nHe said, “We believe in the cooling-off period. That is why a decision was made unanimously to include the provision. Perhaps, based on that trust, honourable members in the full House did not read clause-by-clause details. But that trust was betrayed. Those who have misused their positions must be investigated. The provision should be restored and culprits punished.”\n\nBesides Speaker Ghimire, former prime minister Baburam Bhattarai, Nepali Congress general secretaries Gagan Thapa and Bishwa Prakash Sharma, Congress leader Shekhar Koirala, UML leader Padam Giri, and Rastriya Swatantra Party lawmakers including Sumana Shrestha have also demanded an in-depth investigation into the breach of parliamentary procedure.\n\nAccording to Sub-section 4 of Clause 82 in the Federal Civil Service Bill, which has already been passed by the House of Representatives, civil servants who have retired or resigned are barred from holding constitutional, diplomatic or government-appointed positions for two years.\n\nHowever, after Sub-section 4 of Clause 82, additional provisions—Sub-section 5 and sections (Ka), (Kha), and Ga—were added, exempting secretaries, joint-secretaries, and the chief secretary from this cooling-off period. And this amended version was passed by the lower House onSunday.\n\nHalf of the 24 members of the State Affairs and Good Governance Committee, including Chairman Khatiwada, met with Speaker Devraj Ghimire and reported the manipulation.\n\nKhatiwada told the Speaker that the unauthorised additions amounted to a serious deception.\n\nHowever, recent developments suggest Chairman Khatiwada may not be as innocent as he claims.\n\nDuring the meeting with the Speaker, Khatiwada admitted that he had instructed Committee Secretary Suraj Kumar Dura to finalise the bill based on the findings of the committee’sreport—and “that is where the manipulation happened.”\n\nSecretary Dura admitted during the same meeting that he inserted the additional sections (Ka, Kha, and Ga) after Sub-section 5.\n\nThe final report submitted by the State Affairs Committee did not have these additional sections. Dura admitted that he met with Mira Acharya, joint-secretary at the Ministry of Federal Affairs and General Administration, and Subash Kumar Bhattarai, joint-secretary at the Ministry of Law, Justice and Parliamentary Affairs, and together they added the three sections.\n\nEven though Dura claimed that he and the two joint-secretaries coordinated to amend the bill, only Dura and chair Khatiwada’s signatures appear on the final report.\n\nThe names of the two joint-secretaries who helped manipulate the bill are not mentioned anywhere. But Dura confirmed that he had sat down with them to finalise the changes.\n\nAfter the tampered bill was ready, it was handed over to Khatiwada. After he signed each page, Dura also signed it. The bill was then presented to the House of Representatives.\n\nBoth Dura and Khatiwada were mum on the additional clauses until the bill was passed.\n\nDespite signing every page, Khatiwada continued to claim that not even a comma or full stop had been altered in the section concerning the cooling-off period.\n\nCommittee member Sarita Prasai said when she requested to review the finalised bill report—signed by the secretary and the chairperson—before it was submitted to the House of Representatives, Khatiwada told her it was “not necessary” and denied her access.\n\nEven if the National Assembly does not make any amendments, Speaker Devraj Ghimire has assured that the bill will be returned to the House for revision.\n\nHowever, one question remains unanswered: what action will be taken against the three civil servants and Chairperson Khatiwada for manipulating the bill and keeping Parliament in the dark?",
      "date": "2025-07-02",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/GopalDahalKTM171a3ef8715d2c44f694396d7f554bf713copycopy-1751421439.jpg",
      "read_time": "4 min read"
    },
    {
      "url": "https://kathmandupost.com/politics/2025/07/01/unexplained-sneaky-changes-in-civil-service-bill-spark-concerns",
      "title": "Unexplained, sneaky changes in civil service bill spark concerns",
      "body": "One of the highlights of the new Civil Service Bill was a provision barring top bureaucrats from taking up political appointments for two years after retirement. The widely-debated provision was seen as a step towards curbing the dominance of freshly-retired civil servants in constitutional appointments.\n\nThe provision was expected to prevent top bureaucrats from working in cahoots with the government of the day in instances of policy corruption, on a quid pro quo basis.\n\nThe provision hadn’t sat well with top bureaucrats. A team including Chief Secretary Ek Narayan Aryal and government secretaries lobbied hard for its removal as they visited almost all political power centres.\n\nThe parliamentary State Affairs and Good Governance Committee nevertheless finalised the new text of the Civil Service Bill on May 14 that incorporated the provision of a two-year ‘cooling-off’ period before top bureaucrats could be appointed to constitutional and ambassadorial positions.\n\nDespite intense lobbying, a larger political understanding had emerged to retain the cooling-off clause.\n\nSection 82(4) of the bill states that any employee who has resigned or retired must have completed at least two years before taking another government appointment.\n\nHowever, alongside the committee’s decision, a new rider has been incorporated into the bill. The bill’s Section 82(5) now includes a provision that runs contrary to the earlier clause, allowing civil servants to take another government appointment within two years of their resignation or retirement.\n\nThe latest version of the bill states that the cooling-off period is not applicable in the case of “other appointments made by the government of Nepal in constitutional or diplomatic postings”.\n\nThe text of the bill finalised by the committee was tabled in the House of Representatives and endorsed by overwhelming support but no lawmaker noticed the last-minute changes.\n\nBut when the final text was made public on Monday, the cooling-off provision had been tweaked.\n\nChairperson of the State Affairs and Good Governance Committee Ramhari Khatiwada himself expressed surprise at the move. “We are trying to find out the architect of this cunning act,” said. “The National Assembly will now correct it.”\n\nA bill becomes law only after both the House of Representatives and the National Assembly endorse it and the President approves it.\n\nUnder no circumstances will the cooling-off period provision be removed from the Civil Service Bill, Khatiwada added.\n\nSpeaking with journalists at Singha Durbar on Monday, he said that although the bill was passed by a majority vote in the lower house on Sunday, there had been some misunderstandings, which the committee members sat down and clarified.\n\nMinister for Federal Affairs and General Administration Raj Kumar Gupta had tabled the bill for endorsement in the House meeting on Sunday. Gupta represents the CPN-UML, which had been indirectly opposing the provision.\n\n“We suspect manipulation in the text by some senior officials at the Ministry of Federal Affairs and General Administration,” a Nepali Congress lawmaker said. “We also have serious doubts with the senior members of the Parliament Secretariat.”\n\nThis “tampering” is a result of a collusion between the ministry and parliament secretariat, the lawmaker added, and it will be changed in the National Assembly, which is yet to endorse the bill.\n\nIn the meeting on Monday, members of the State Affairs and Good Governance Committee discussed the possible manipulation in the text but they were also clueless about who was responsible for it. Yet there was a consensus that the added phrase needs to be removed in the National Assembly.\n\nHitraj Pandey, chief whip of the main opposition party, the Maoist Centre, stated that there is no confusion over the committee’s decision to set a two-year cooling-off period.\n\n“The committee’s decision cannot be changed,” he said. “The provision, arrived at after much struggle, cannot be altered. The committee’s decision clearly states a two-year cooling-off period.”\n\nCommittee members are meeting Speaker Devraj Ghimire on Tuesday morning to draw his attention to the alteration.\n\nThe cooling-off period will not be removed under any circumstance, Khatiwada reiterated, explaining that the bill clearly states that if any civil servant or employee resigns or is removed from service, they cannot be appointed to any constitutional or government position until two years after the date of their retirement from service.",
      "date": "2025-07-01",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2019/third-party/thumb2-1751337430.jpg",
      "read_time": "3 min read"
    },
    {
      "url": "https://kathmandupost.com/politics/2025/06/30/house-clears-bill-for-civil-service-shake-up",
      "title": "House clears bill for civil service shake-up",
      "body": "The Federal Civil Service Bill, one of the laws essential for full implementation of federalism, has been endorsed by the House of Representatives amid reservations from a few fringe parties.\n\nThe bill, registered in Parliament for the second time after the promulgation of the Constitution of Nepal in March last year, got through the lower house following the backing of major parties.\n\n“I consider the endorsement of the bill to be a historic and far-reaching policy milestone for a successful implementation of federalism,” said Speaker Devraj Ghimire, after the bill was passed by majority vote.\n\nSmaller parties including the Nepal Majdoor Kisan Party and the Aam Janata Party, led by Prabhu Sah, objected to the bill claiming that it is discriminatory against local and underprivileged communities in recruitment, and unfriendly to local governments.\n\nThough the bill was finalised by Parliament’s State Affairs and Good Governance Committee on May 17, pressure from the top bureaucrats to scrap provisions related to the cooling-off period after retirement delayed its endorsement by the lower house. Despite their lobbying, the House retained the provision while endorsing the bill.\n\nIf the bill is endorsed by the National Assembly without changes, which is highly likely, a civil servant who retires or resigns from the service will have to wait for two years before being appointed to any constitutional or diplomatic position. As it has been a common practice to appoint recently retired officials to constitutional positions, bureaucrats had lobbied for the provision to be scrapped.\n\nThe bill has also increased the retirement age of civil servants to 60 years, up from the existing 58. This provision, however, will be implemented gradually. The retirement age will continue to be 58 years until the fiscal year in which the bill is endorsed. It will then rise to 59 years and 60 years, respectively, in the succeeding fiscal years.\n\nThe erstwhile Pushpa Kamal Dahal government had registered the bill in the lower house on March 4 last year and it was forwarded to the House committee on May 28 after theoretical discussions. A total of 1,583 amendments were registered to the bill by lawmakers.\n\nThe bill envisions that the provincial civil service commissions will appoint chief administrative officers in local units under the respective provinces. However, until the provinces start their own recruitments, the federal government will depute such officers in bulk, and the provincial governments will assign them to local units. This arrangement can continue for a maximum of 10 years. Officers can be transferred between provinces once during their service period.\n\nThe bill places provincial secretaries under the respective provincial governments, thus meeting a longstanding demand of the provinces. However, for now, they will be deputed by the federal government. Provincial principal secretaries will continue to be under the federal government.\n\nThe bill also envisions reviving the additional secretary’s position in the civil service.\n\nAccording to the bill, additional secretaries will be ranked above joint-secretaries and below secretaries. They will be on the 13th level of the civil service. Secretaries will be on the 14th level, and the chief secretary on the 15th. These three positions will fall under the gazetted special category.\n\nThough there had been such a provision during the partyless Panchayat regime, it was removed after the restoration of democracy in 1990.\n\nThe bill has ended the provision of recruiting joint-secretaries through open competition. Once the law is enacted, the under-secretary will be the highest position available for lateral entry in the country’s bureaucracy. Gazetted third class (section officer) and non-gazetted first class will be the other entry points.\n\nThe bill has slightly revised the maximum age for entry in the civil service. While the entry age for men remains 35, it has been lowered to 39 from 40 years for women.\n\nIt has also lowered the tenure of secretaries to four years from five, and that of the chief secretary to two years from three.\n\nDespite the demand to curtail trade unionism, the parties have decided not to do so. The parties faced intense pressure from the civil servants to give continuity to the unions.",
      "date": "2025-06-30",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/e-1751248677.jpg",
      "read_time": "3 min read"
    },
    {
      "url": "https://kathmandupost.com/politics/2025/06/29/with-bhandari-back-oli-s-challenges-grow-in-the-uml",
      "title": "With Bhandari back, Oli’s challenges grow in the UML",
      "body": "It was no secret—and it now comes from the horse’s mouth.\n\nFormer President Bidya Devi Bhandari announced on Saturday her political ambitions, saying that she had returned to her former party CPN-UML. The former head of state’s plunge back into politics suggests she aims to lead the party—and possibly the country as its chief executive.\n\nAs discussions intensify within the ruling UML over a two-term limit and the 70-year age cap for leadership positions, former Bhandari, 64, announced her return to active politics amid a programme commemorating her late husband, Madan Bhandari.\n\nBidya Devi Bhandari has beentouring various parts of the countryfor some time, gathering information and assessing the possibility of her return to active politics. Last month, she led a delegation of politicians to China and toured the country for 10 days, meeting top Chinese Communist Party officials.\n\nBhandari announced her return to active politics amid a programme organised by the Madan Bhandari Foundation in Kathmandu on Saturday on the occasion of the late UML general secretary’s 74th birth anniversary. Before his mysterious death in a car accident in 1993, Bhandari had propounded ‘People’s multiparty democracy’ as the UML’s guiding ideology.\n\nAt the event held at the Rastriya Sabha Griha on Exhibition Road in Kathmandu, some party leaders and cadres said they were uncomfortable openly speaking to the media as they currently serve in various party committees. But they told the Post that they believe that time has come for a change in the party’s top leadership.\n\nFollowing Bhandari’s announcement to again become active in politics, some party leaders and cadres expressed their belief that she will assume a leadership role through the upcoming general convention.\n\nThe UML is witnessing strong calls for a change in leadership. Although party leaders and cadres had been subtly raising this demand for some time, his voice could get louder after Saturday’s developments.\n\nThe ruling party is set to hold its second Statute Convention from August 5 to 7 in Godavari, Lalitpur. This convention will also decide the date for the party’s 11th general convention that will elect the next leadership of the party.\n\nFormer President Bhandari recentlyrenewed her UML membership, although the party is yet to officially confirm it. Before becoming the country’s second President from 2015 to 2023, Bhandari was elected a vice-chair of the UML during its ninth general convention held in 2014 in Kathmandu. She dissociated herself from the party after being elected to the country’s top post.\n\nUML leaders at the event clarified that their call for fresh leadership does not stem from a lack of trust in KP Sharma Oli, but rather from the belief that the existing leadership has been ‘tested multiple times’. Bhandari’s leadership could revitalise the party and inject new vigour in it, some of the cadres gathered at the city hall said.\n\nThe secretariat meeting held on June 25 formed a committee led by Vice-chairman Bishnu Paudel to draft an amendment to the party statute. It also decided that the issues of age limit and two-year term will be finalised through the statute convention.\n\nIf the age limit and two-term policies are implemented, party’s current chief Oli, and senior vice-chairs Ishwar Pokhrel, Ashta Laxmi Shakya, Yubaraj Gyawali, and Ram Bahadur Thapa, among other septuagenarian leaders, will automatically be sidelined.\n\n“After being relieved from a different kind of political responsibility [President], I renewed my party membership with the noble objective of continuing my political journey within the UML,” Bhandari said on Saturday. “I am now reunited as a member of the UML family, and I take pride in that.”\n\nQuoting her late husband, she said: “There is no such word as ‘fatigue’ in politics.”\n\nAmid the speculation of her return to active politics, UML had awarded the ‘Republic Pride Honour’ to former President Bhandari on April 22 last year on the occasion of the 75th anniversary of the Communist Party of Nepal.\n\nBy honouring her, some UML leaders had hoped to discourage her from returning to active politics.\n\nNripendra Mahat, a party cadre from Humla who also attended the Saturday event, echoed this sentiment.\n\nIn the UML, the same individuals repeatedly getting leadership positions has strengthened those few leaders at the expense of the vast majority of cadres, he argued.\n\n“But it should have been the other way around—the cadres should have been stronger than the leaders,” Mahat remarked.\n\nMahat argued that the current second- and third-tier leaders are not in a position to lead the party, and therefore asserted that former President Bhandari should take the party’s mantle from its 11th general convention.\n\nDue to theleadership’s inefficacy, attendance at our party’s programmes had significantly declined, he said. “However, given the speculations of Bhandari’s return to active politics, the turnout in this event increased substantially. In terms of numbers, this is one of the best-attended events the party has organised of late,” claimed Mahat.\n\nHe was referring to the jam-packed hall of the Rastriya Sabhagriha where UML leaders and cadres gathered to listen to Oli and Bhandari.\n\nA section of UML leaders and members were publicly speaking through social media in the past few days, suggesting a special announcement would be made at the foundation’s event on Saturday.\n\nA senior leader of the party said the current leadership’s narrow-mindedness had disrupted the party’s smooth functioning. The leader added that with Bhandari’s announcement of return to active politics, the scenario now looks different.\n\nHowever, the leader also expressed confidence that Bhandari’s return to leadership would ultimately receive Oli’s backing.\n\nYet not all party leaders and cadres support Bhandari’s return. These sceptics’ main concern is that the UML may witness intensefactionalismfollowing her return, further weakening the party. Such groupism has already twice split the party.\n\nConstitutional law expert Bhimarjun Acharya also sees Bhandari’s return as problematic. He argues that after her return to the party, she might also want to hold the country’s top executive position—something the constitution does not envision.\n\n“Our constitution considers the role of the President as neutral. Even if the person had political affiliations before assuming office, engaging in party politics after serving as President seriously undermines the dignity of the [top] post,” Acharya told the Post. “This is inappropriate from both legal and moral standpoints.”\n\nPolitical analyst CK Lal also criticises the former President’s announcement. He argues that Bhandari’s move undermines the dignity of the country’s highest office and is another indication that politics in Nepal has become a profession devoid of moral values.\n\nPointing to Bhandari’s announcement just a month after her return from China visit, Lal said it cannot be said with certainty that this was due to “Chinese goodwill”.\n\n“China formulates its politics in such a way that they can be interpreted as both yes and no. I believe the same applies in Bhandari’s case,” Lal said.\n\nBefore former President Bhandari announced her return to active politics, Prime Minister and UML chairKP Sharma Oli, who was the chief guest at the event, remarked that some had expected the programme to mark the beginning of UML’s fragmentation.\n\nHowever, he asserted that this would not happen, emphasising, “The UML is one and it will stay united—it’s better not to dream of anything else.”\n\nBut some leaders from his own faction have reportedly opposed the former President’s return to party politics.\n\nAccording to UML insiders, during the party secretariat meeting on June 25, General Secretary Shankar Pokhrel expressed the view that the party statute should prevent a former President from returning to politics.\n\nReferring to the internal division over the former President’s political comeback, senior vice-chair Ishwar Pokhrel said on Saturday that such disagreements must be addressed following due process.\n\nOtherwise, it could give rise to resentment and ultimately be counterproductive for the party, he remarked.\n\nPokhrel blamed the growing dissatisfaction in the party in recent times on the top leadership and stressed that it is their responsibility to address the issue.\n\nHis remarks were clearly aimed at Oli, but the UML chair had left the venue when Bhandari and Pokhrel addressed party leaders and cadres. Prime Minister Oli left immediately after his speech, as he was due to travel to Spain later in the day. He leads a 21-member delegation to the Global Development Summit.\n\nSenior Vice-chairPokhrel also arguedfor a two-term limit and 70 years age cap, saying that the party had not abruptly introduced these provisions.\n\nHe also argued that as the former President is a political figure, she reserves all the right to return to party politics.",
      "date": "2025-06-29",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/news/olinadbidya-1751158286.jpg",
      "read_time": "7 min read"
    },
    {
      "url": "https://kathmandupost.com/politics/2025/06/27/parliamentary-panel-locked-in-dispute-over-private-schools-future-1750989255",
      "title": "Parliamentary panel locked in dispute over private schools’ future",
      "body": "The Education, Health and Information Technology Committee of the House of Representatives is struggling to finalise the school education bill, as cross-party lawmakers remain deeply divided over provisions to regulate private schools.\n\nWhile most of the ruling party lawmakers want the privately owned schools to continue to operate in the way they are doing, opposition lawmakers are pushing to make them service-oriented. At Thursday’s meeting, opposition leaders strongly stood for mandatorily converting the schools registered under the Company Act into trusts by allowing them a few years to transition. But most ruling party lawmakers argued that such a move should be voluntary.\n\nThe provision relating to regulating private schools has become the most contentious issue in finalising the bill. Those advocating for converting them into trusts argue that education should not be treated as a profit-making sector, but others claim controlling them would go against the principle of a three-pillar economy—public, private, and cooperative.\n\nStating that converting private schools into trusts is a must for turning them into service-oriented from profit-making, Rastriya Swantantra Party lawmaker Sumana Shrestha argued that they should be given 15 years to make the shift.\n\n“Let’s set a time limit. Fifteen years means the full cycle of a school that begins with Early Childhood Development,” she said. “Their bank loans [if any] can also be settled in that period. Allowing them to function as they do now goes against the very spirit of the constitution. It would be a betrayal of the public.” Shrestha said conversion to trusts does not mean nationalisation but just a move to make them non-profit.\n\nAmid growing complaints that private schools charge exorbitantly and have become profit-oriented, experts have long been calling for converting them into trusts. Dozens of lawmakers have registered proposals to amend the bill demanding their conversion into trusts.\n\nHowever, others want them to continue operating under the Company Act. “Private schools exist in every country—even in China. Let’s not prohibit them,” said Nepali Congress chief whip Shyam Ghimire.\n\nHe said rather than changing their registration, focus should be on effective regulation, transparent scholarships and setting minimum standards of their operation.\n\nChhabilal Bishwakarma, CPN-UML lawmaker who is also the coordinator of a sub-panel, echoed Sharma’s position. “The contribution of private schools cannot be undervalued,” he said. “Improving the quality of community schools would naturally reduce the number of private ones.”\n\nThe UML has always stood against regulating private schools. Prime minister and the party’s chair KP Sharma Oli often praises private schools and blames public schools for substandard education.\n\nOn January 15, 2019, a high-level education commission submitted its report to then prime minister, Oli, recommending the conversion of the private schools into trusts within 10 years. This would, according to the commission, stop the commercialisation of education.\n\nHowever, Oli never made the report public. His successor, Sher Bahadur Deuba, followed suit. It was only when Rastriya Swatantra Party’s Shrestha became the education minister in the erstwhile Pushpa Kamal Dahal government was the report made public.\n\nThe commission, according to its members, made its recommendations based on Article 31(2) of the Constitution, which makes the state responsible for compulsory basic and free secondary education for all. The commission said that leaving private educators to “generate profit”, as they currently do, would be tantamount to a breach of the constitution.\n\nPutting his view in Thursday's meeting, CPN (Maoist Centre) lawmaker Devendra Paudel, who also is a former education minister, said education is a service-oriented sector therefore, the schools should be converted into trusts.\n\n“The constitution mandates compulsory and free education up to grade eight, so we need to move ahead with a defined timeframe to convert the private schools’ ownership. The government must be courageous enough to implement it,” he said.\n\nRekha Sharma of the Maoist Centre shared the same position. “If medical colleges can be regulated, why not schools?” she said. “A grocery shop, a plastics factory, and a school are not the same. Therefore, what’s written in the constitution must be implemented. It cannot be that private schools will remain private forever. The state must show courage and determination [to convert them into trusts].”\n\nOn April 30, chief whips of the Congress and the UML inked a deal with the Nepal Teachers’ Federation to get the bill endorsed from the lower house by June 29. Two days to go for the deadline, the committee is yet to finalise it. Its meeting on Friday is expected to endorse the bill. The House of Representatives meets again on Saturday.",
      "date": "2025-06-27",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/WhatsAppImage20250627at63116AM-1750989202.jpg",
      "read_time": "3 min read"
    },
    {
      "url": "https://kathmandupost.com/politics/2025/06/26/three-years-since-its-establishment-rsp-is-forced-to-confront-questions-on-its-future",
      "title": "Three years since its establishment, RSP is forced to confront questions on its future",
      "body": "Three years ago, the Rastriya Swatantra Party entered Nepali politics with a bang, so to speak.\n\nThe party billed itself as a force different from the traditional parties that, it said, were neck deep in corruption, nepotism, and misgovernance.\n\nThe party, formed six months before the 2022 general elections, contested the polls on an anti-status quo, anti-corruption plank. The agenda quickly paid off.\n\nLed by Rabi Lamichhane, a former television host known for putting politicians and bureaucrats on the spot, the party achieved remarkable electoral success, becoming the fourth-largest party in Parliament with 20 seats.\n\nThe party’s early success also included a victory in the Tanahun by-election held in 2023, extending its strength to 21 seats in the House.\n\nThe party joined the government twice—even if only for months—once in coalition with the CPN (Maoist Centre) and then with the CPN-UML. Currently, it is in the opposition, obstructing the House overthe visit visa scam.\n\nThe party has witnessed several ups and downs within its short journey. As the glow of its success has dimmed, the party has had to confront its position in Nepali politics, and the way forward—its prospects and limitations.\n\nSo when the party marked its third establishment anniversary, it did so not in a triumphant mood but a solemn one, amid a leadership void, a cloud of controversy, and waning momentum for its once-popular anti-status quo agenda.\n\nMuch of the party’s apparent confusion centres around the party’s founding president Lamichhane, who is currently behind the bars on charges of embezzling millions of rupees the public deposited in cooperatives in five districts—Kathmandu, Kaski, Rupandehi, Chitwan and Parsa.\n\nLamichhane and his party members accuse traditional political forces of framing him in wrong charges but different courts sent him in judicial custody indicating his involvement in the irregularities. The cases are sub judice in all the five districts.\n\nObservers also find fault with the new party leaders not having patience to stay away from the government and raising public’s concerns from the opposition bench strongly.\n\nThey said the RSP didn’t honour the sentiment of the people by joining the government, not once but twice, within two years, and in the leadership of the same leaders whom they railed against in the past.\n\n“The basic tenet of democracy is to fulfil the promise made to the people during the election,” political analyst Shreekrishna Aniruddh Gautam said. “The election had given the RSP the mandate to be the opposition party. But they rushed to join the government twice, making a mockery of their promise to the public.”\n\nThe RSP had promised good governance, among other things, but they could not live up to that promise, Gautam added.\n\nLamichhane is in judicial custody in Rupandehi over allegations of misappropriating funds from the Supreme Cooperative of Butwal. The cooperative scam, in which Lamichhane is a key accused, has seriously dented the party’s pledges in good governance, observers say.\n\n“The controversy about the party chief Lamichhane’s involvement in irregularities has definitely dealt a serious blow to the momentum previously gained by the party,” said Jhalak Subedi, a political analyst.\n\nHowever, party spokesperson Manish Jha dismissed such claims and claimed that the party’s momentum has not slowed down.\n\n“The questions of misgovernance should have been asked to the ruling coalition leaders rather than to our party,” Jha said. “Our party respects the law of the country, therefore our party leader is in custody, whereas leaders of the ruling coalition, despite questions on their conducts, are not even ready to face it.”\n\nJha claimed that the case against Lamichhane was motivated by political vendetta. Lamichhane, a former home minister, was targeted, Jha claimed, because he moved forward to investigate the involvement of big party leaders on the Bhutanese refugee scam, the Giri Bandhu land swap scam and the Patanjali land scam.\n\nBefore that, the Supreme Court in January 2023 hadscrappedLamichhane’s status as lawmaker, saying that he didn’t have a valid Nepali citizenship. Later, he reacquired Nepali citizenship, fought the election and won the seat with bigger margins.\n\nDespite Jha’s dismissal, Lamichhane’s absence has reduced the party to a rudderless outfit.\n\nThe party is being led by Acting President DP Aryal after Lamichhane was sent to jail for judicial custody in April. A planned general convention in April was postponed, illustrating the RSP’s dependence on Lamichhane’s leadership.\n\nThough the party has announced its new general convention for March, its certainty is still under question.\n\nNewly appointed General Secretary Kabindra Burlakoti acknowledges the party’s bumpy path in Nepal’s political landscape.\n\n“The last three years have been a roller coaster for us,” Burlakoti said. “However, we will overcome all the challenges and present ourselves with a better version of ourselves.”\n\nBurlakoti also claimed that the party could not hold its general convention earlier due to unforeseen circumstances. He said the party is resolved to hold the convention on the postponed date.\n\nThe Ilam-2 by-election held last year proved to be a turning point in the new party’s political journey.\n\nAfter earlier successes in the general election of 2022 and the by-election held in 2023, the RSP suffered a surprising defeat, raising questions about its sustained appeal and capacity to operate beyond a protest platform.\n\nSubedi argued that the by-election sent a clear message that the party’s earlier momentum had come to a standstill.\n\nThe crisis deepened with the fallout of former general secretary Mukul Dhakal, who had launched a review campaign touring across 32 districts. Before he could present his report, internal conflicts and allegations—including claims that he prematurely shared findings with the media—led to his departure from the party. Dhakal, in turn, accused senior RSP leaders of harbouring personal grudges.\n\n“RSP entered politics to change the system, but it now seems to have become part of the system it vowed to reform,” said Chiranjibi Bhandari, a political commentator who is an assistant professor of conflict, peace and development studies at Tribhuvan University.\n\nBhandari adds that the RSP appears “directionless” in Lamichhane’s absence, with internal rifts and power struggles increasingly defining its public identity.\n\nJha refuted that charge.\n\n“If the current leaders of the Nepali Congress can follow Mahatma Gandhi without meeting him, if UML can follow Lenin without meeting him, and if the Maoist Centre can be guided by Mao’s ideology, what is wrong if our party follows its founding leader?” Jha said.\n\nBhandari also observed that while the RSP lags behind traditional parties in theorising its ideology and institutionalising itself, it is ahead in mobilising the diaspora populations and younger people, especially the Gen Z.\n\nThe party’s international outreach remains active, with at least five lawmakers currently abroad for diaspora programmes. Party’s acting chief Aryal was in Qatar a few days ago, Toshima Karki is in the US, Ganesh Parajuli is in Australia, while Hari Dhakal and Sobita Gautam were in India until recently. Vice-President Swarnim Wagle also plays a key role in expanding the party’s diaspora engagement.\n\nDespite its early achievements and appeal, the RSP is currently at a crossroads, with its founding leader embroiled in a legal case, internal cohesion weakening, and ideological clarity lacking.\n\nThe coming few months will provide a clearer picture on whether the party, a champion of alternative politics, can evolve into a powerful political force or fade into irrelevance—whether it comes out of the 2027 elections with a bang or a whimper.",
      "date": "2025-06-26",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/news/ghanti-1750899735.jpg",
      "read_time": "6 min read"
    },
    {
      "url": "https://kathmandupost.com/politics/2025/06/26/uml-gears-up-for-statute-convention",
      "title": "UML gears up for statute convention",
      "body": "The ruling CPN-UML has begun preparations for its second National Statute Convention with the party’s Secretariat meeting on Wednesday deciding to hold the Statute Convention in September first week.\n\nA UML leader said that the meeting assigned responsibilities to three leaders, including party chair KP Sharma Oli, to expedite the preparations for the convention.\n\nThe meeting entrusted Oli with the task of presenting the political report, Vice-chair Bishnu Poudel with drafting the statute amendment proposal, and General Secretary Shankar Pokharel with preparing the organisational proposal.\n\nThe issue of age limit for office bearers is taken as a major agenda to be decided by the convention.\n\nParty secretary Padma Aryal stated that a report will be submitted to the secretariat incorporating the suggestions from the lower committees ahead of the statute convention and a decision will be made accordingly.\n\n“Today’s meeting did not hold a detailed discussion on the age issue. However, there was consensus that a decision on the matter will be reached based on the suggestions from the party’s lower committees before the statute convention,” Aryal told the Post.\n\nAmid speculations within the UML regarding the 70-year age bar, Deputy General Secretary Pradeep Gyawali said that the matter will be settled by the statute convention.\n\n“There is no need to take it as a theoretical issue,” Gyawali said during a press briefing held at the party’s central office in Chyasal, Lalitpur.\n\nThe party’s ninth general convention, held in Kathmandu in July 2014, adopted a 70-year limit for leaders to hold any executive position in the party. As a result, some senior leaders, including Bharat Mohan Adhikari and Siddi Lal Singh, were sidelined from executive roles.\n\nOli was about to turn 70 during the 10th general convention. To avoid any bar for him, the party's statute convention in 2021 introduced a provision that individuals over the age of 70 would not be eligible to hold executive positions. However, in recent times, as Oli began to claim that the age limit was irrelevant, some party leaders had expressed their displeasure at such remarks.\n\nThe UMLremovedthe age limit in June 2023, making septuagenarian party chair Oli, among other top leaders, eligible to hold the top position yet again. The party removed the age limit citing the need to allow senior leaders including Mukunda Neupane who had joined the CPN (Unified Socialist) in 2021 to return to the UML.\n\nOli will also be ineligible to contest the top position if the party adopts the two-term policy instead of enforcing the age limit. He was elected the party chair through the 9th and 10th general conventions.\n\nIf the party continues the age limit, Vice-chairpersons Ishwar Pokhrel, Asta Laxmi Shakya, Yubaraj Gyawali and Ram Bahadur Thapa will disqualify to hold an office-bearer position in the party.\n\nThe secretariat meeting on Wednesday lifted the suspension of Standing Committee member Binda Pandey and Central Committee member Ushakiran Timalsina. Deputy General Secretary Gyawali said that the secretariat had decided to lift their suspension.\n\nThe UML had taken action against them after they publicly criticised the party’s decision to build the party’s head office with financial support from Min Bahadur Gurung, owner of Bhatbhateni Supermarket.",
      "date": "2025-06-26",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/RSSImage20250625at33704PM-1750899869.jpg",
      "read_time": "2 min read"
    },
    {
      "url": "https://kathmandupost.com/politics/2025/06/25/sudurpaschim-minister-defies-chief-minister-s-call-to-resign",
      "title": "Sudurpaschim minister defies chief minister’s call to resign",
      "body": "A minister in Sudurpaschim Province has refused to resign despite being instructed to do so by Chief Minister Kamal Bahadur Shah, deepening tensions within the ruling coalition.\n\nMinister for Industry, Tourism, Forest and Environment Rameshwar Chaudhary, appointed from the Nagarik Unmukti Party in May, was asked by Shah in a June 17 phone call to step down over alleged misconduct, including breaching financial discipline and making appointments without consultation.\n\nChaudhary has rejected the call and challenged the chief minister to remove him. “If he can, let him sack me,” party’s insiders quoted him as saying.\n\nDays after the instruction, Shah has not taken further action. His political adviser Jeetu Upadhyaya said the chief minister was “seriously discussing” the matter.\n\nNagarik Unmukti Party chair Ranjita Shrestha said the party would not ask Chaudhary to resign. “If the chief minister wants to remove him, that is his decision,” she said.\n\nShah’s Nepali Congress, in alliance with the CPN-UML and Nagarik Unmukti, leads the provincial government. The chief minister has the authority to appoint and dismiss ministers.",
      "date": "2025-06-25",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/25620250841121000x0-1750837589.jpg",
      "read_time": "1 min read"
    },
    {
      "url": "https://kathmandupost.com/politics/2025/06/25/parliamentary-probe-panel-on-visa-scam-splits-opposition",
      "title": "Probe panel on visa scam splits opposition",
      "body": "Nearly a month after the opposition’s demand, the government has constituted a committee to investigate the visit visa scam, a move welcomed by the main opposition but rejected by two other political parties.\n\nOn Monday evening, the Cabinet formed a panel, led by former chief secretary, Shankar Das Bairagi, with joint-secretaries from seven ministries as its members. Announcing its formation in Tuesday’s meeting of the House of Representatives, Home Minister Ramesh Lekhak detailed the terms of reference of the probe panel and claimed that it will dig out all aspects of the scam. “The committee will also provide suggestions for short-term, long-term, legal and institutional reforms,” he said. The committee has three months to accomplish its job.\n\nAs the Commission for the Investigation of Abuse of Authority (CIAA) is already investigating the visit visa case, the newly formed committee will study matters that fall outside the antigraft body’s jurisdiction. Starting May 27, the opposition parties started obstructing the House of Representatives demanding formation of a judicial or parliamentary probe panel and subsequent resignation of Lekhak.\n\nOn June 13, the CPN (Maoist Centre) ended the House obstruction after forging a two-point agreement with the ruling parties, which included conducting a study to resolve the long standing issues relating to immigration and visit visa. The government announced that the probe committee was formed in line with the deal.\n\nThe main opposition said it has cautiously welcomed the government’s decision to form the committee respecting the June 13 agreement. Putting his party’s views in Parliament,Barshaman Pun, Maoist Centre deputy general secretary, said the CIAA has been investigating the matter but there are several other issues the newly formed committee needs to dig out.\n\nFollowing complaints about the scam, the commission, in the third week of May, started its investigation, keeping Tirtha Bhattarai, then immigration chief at Tribhuvan International Airport, at the centre.\n\n“It should investigate the problems seen in the respective state agencies—from the past to the present—and examine how and why crimes have occurred in the gray areas of governance,” he said. “We have heard that travel agencies, manpower companies, airlines, and even national and international officials are involved in these cases. It is expected to look into all these matters.”\n\nStating that his party will be vigilant at the committee, he said his party expects fact-based investigation and the report and recommendations in line with the people's sentiments. “If the investigation is not carried out in a factual and credible manner, it will lead to public distrust,” he said. “The report that doesn’t address the concerns from the different quarters will not be acceptable.”\n\nUnlike the Maoist Centre, the Rastriya Swatantra Party (RSP) and the Rastriya Prajatantra Party (RPP) not just rejected the Bairagi-led committee but also boycotted the House meeting. Both the parties claimed that the panel led by the former bureaucrat can not probe the issue linked with the home minister.\n\nAddressing the House, Swarnim Wagle, RSP vice-president, even questioned Bairagi’s integrity claiming that the committee would turn out to be the government’s rubber stamp. “He (Bairagi) himself is under the radar of competent investigation agencies. How can someone under the scanner lead the investigation?” he asked. “This is why we are demanding an investigation commission chaired by a sitting or former judge.”\n\nWhile announcing the committee in the House, Lekhak said it was formed under his recommendation. Citing his statement, Wagle said, “The home minister is indirectly involved in the visit visa. When did we start practicing forming the committee by the accused himself? We may be new, but we are not fools.” Questioning the intention behind forming a retired bureaucrat-led committee, he said Bhattarai was a morning walk partner to Lekhak.\n\nSeconding Wagle, RPP chief whip, Gyanendra Shahi, claimed the government was unwilling to find out the reality relating to the visit visa scam. “This is a new conspiracy to cover up the crime and grant impunity to the home minister who is involved in this case,” said Shahi. “Now we will not just protest in the House but also in the streets.”\n\nLike the opposition, the political observers are also not convinced that a committee led by Bairagi will be able to carry out an impartial and fair investigation. Sanjeev Humagain, who teaches to PhD students in Tribhuvan University, said the Nepali Congress and CPN-UML, being ruling parties, had a duty for proper consultations with the opposition before announcing the probe panel. “The way the investigation panel has been announced gives ample room to suspect the ruling party's intention. Can the committee with a home ministry joint-secretary as a member take a statement against the home minister?,” he said. “The terms of reference of the committee are also so shallow that there is no need for a separate committee to carry out those tasks. A department within the ministry can accomplish them.”",
      "date": "2025-06-25",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/thumb-1750812305.jpg",
      "read_time": "4 min read"
    },
    {
      "url": "https://kathmandupost.com/politics/2025/06/25/budget-passed-amid-criticism-from-both-ruling-and-opposition-lawmakers",
      "title": "Budget passed amid criticism from both ruling and opposition lawmakers",
      "body": "While opposition parties, as well as some leaders from the ruling coalition, have accused the government of presenting a lopsided budget for the fiscal year 2025-26 alleging that it is focused primarily on the home districts of some leaders, Prime Minister KP Sharma Oli has denied such claims.\n\nResponding to questions raised during Tuesday’s session of the House of Representatives regarding the budgets allocated to the Office of the Prime Minister, the President, the Vice President, and others, Oli asserted that the budget aimed to balance development works across the country.\n\n“I would like to emphasise that the budget presented by the government is comparatively balanced, equitable, and result-oriented,” Prime Minister Oli said. “It has been designed to ensure balanced development based on geographical, regional, and thematic needs and considerations.”\n\nOli, however, stated that due to the dearth of resources, the budget could not satisfy the wants of all lawmakers. He pledged that efforts will be made in the future to address their grievances.\n\n“We need rapid development across many areas, but the budget is limited. Therefore, it is natural that not all lawmakers can be satisfied with the allocation. Efforts will be made to address the imbalance between demand and supply in the coming days,” Oli said.\n\n“We are in need of investments. For that, we must bring in both private sector and foreign investments,” Oli added.\n\nEarlier, expressing their views, even lawmakers from ruling parties had criticised the budget for lacking balance and being tailored to appease the constituencies of some leaders. They argued that the budget fails to address the broader needs of the country as a whole.\n\nAt Sunday’s discussion, Congress lawmaker Arjun Narsingh KC had expressed his frustration over an unequal distribution of the budget. He called for the formation of a parliamentary committee to investigate whether the budget allocations had been appropriate.\n\nSimilarly, CPN-UML lawmaker Surya Thapa voiced his discontent over the allocation of budget under headings named after Ganesh Man Singh, criticising Deputy Prime Minister and Minister for Physical Infrastructure and Transport Prakash Man Singh—who is also a Congress leader. Ganesh Man, a former Congress leader and father of Deputy PM Singh, led the people’s movement in 1990.\n\nDespite criticism, the House of Representatives on Tuesday passed the Rs1.96 trillion budget for the fiscal year 2025/26.\n\nThe appropriation bill-2025, presented in Parliament by Finance Minister Bishnu Paudel, was approved by a majority vote during Tuesday’s House session. Discussion on the budget was delayed due to the opposition parties’ obstruction of the House demanding a committee to investigate the visit visa scam.\n\nCongress lawmaker KC remarked that Nepal’s parliamentary system has no tradition of addressing lawmakers’ voices in an apt manner.\n\n“The budget was bound to pass, as the two major parties command a vast majority in the House. But the real question is whether the concerns raised by lawmakers were addressed,” KC told the Post.\n\nLikewise, responding to questions about the national budget, Prime Minister Oli stated that the “take and pay” provision was removed out of concern that it might affect the country’s energy sector.\n\nOli made this remark in response to a question raised by a lawmaker in Tuesday’s House meeting, asking why the “take and pay” provision was included in the budget and then withdrawn.\n\nThe budget for the upcoming fiscal year, unveiled on May 29, stated that Power Purchase Agreements (PPAs) for run-of-the-river (RoR) projects developed by the private sector would be made only under the “take and pay” modality.\n\nThis provision sparked criticism and concerns that it placed private sector investments in hydropower at risk and discouraged further investment in the sector.\n\nOn Monday, Congress President Sher Bahadur Deuba had urged Prime Minister Oli and Finance Minister Bishnu Paudel to remove the provision.\n\nPrakash Sharan Mahat, who is both a Member of Parliament and spokesperson for the Congress, said that the government backed down from the “take and pay” provision in the budget after party president Deuba took a firm stance and strongly urged the prime minister and the finance minister to remove it from the budget.\n\nResponding to questions about the budget, Prime Minister Oli on Tuesday also proposed constitutional amendments to address difficulties seen in the charter’s implementation. He says that such amendments are necessary to make the democratic system more effective, to accelerate the pace of development, and to foster greater national unity.\n\nAlthough the prime minister called for an amendment to the constitution, the incumbent government has made no move over the past year towards this goal. One of the key points in theseven-point agreementreached during the formation of the coalition between the Congress and UML last year was precisely the issue of constitutional amendment.\n\nCongress spokesperson Mahat, however, claims that the coalition government is actively engaged in the process of constitutional amendment. He maintains that, aside from a few unalterable provisions enshrined in the constitution, other areas can be amended, and that the government is working in that direction.\n\n“This is not something that can happen overnight; we are committed to giving concrete shape to constitutional amendments,” Mahat told the Post.\n\nMeanwhile, Prime Minister Oli also made it clear that he will not make any compromises on democracy and the constitution. While he expressed his tolerance for personal criticism, he firmly stated that he would not tolerate any disrespect towards the constitution.\n\nOli said that the constitution could be amended to strengthen democracy and uphold national unity. However, he urged members not to make comments that would demean the constitution.\n\n“I can endure criticism, opposition, and even insults directed at me personally,” Prime Minister Oli said. “But I cannot accept insults towards the constitution, the sacrifices made, the struggles of the past, the system we have embraced, and the principles we uphold.”\n\nOli also urged the lawmakers to exercise restraint while speaking on such matters.",
      "date": "2025-06-25",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/GDKTMDG3572-1750812636.jpg",
      "read_time": "4 min read"
    },
    {
      "url": "https://kathmandupost.com/politics/2025/06/22/ministers-under-fire-for-skipping-budget-discussion",
      "title": "Ministers under fire for skipping budget discussion",
      "body": "On Thursday, the House of Representatives was supposed to deliberate on the budget allocated for seven ministries. The agenda for the meeting had been finalised in consultations with the chief whips of the ruling parties.\n\nHowever, once the meeting entered its business, the Speaker announced the deferral of the discussions for four ministries. Deliberations on the budget allocated for the Ministry of Defence; the Ministry of Energy, Water Resources and Irrigation; the Ministry of Health and Population; and the Ministry of Federal Affairs and General Administration didn’t happen as the respective ministers failed to turn up for the meeting.\n\nA similar story repeated the very next day. Speaker Devraj Ghimire had to cancel the deliberations on the budget for the Ministry of Culture, Tourism and Civil Aviation; the Ministry of Youth and Population; and the Ministry of Women, Children and Senior Citizens as the respective ministers did not appear in the House.\n\nGhimire announced that the scheduled deliberations concerning the three ministries would be removed from the House agenda after Nepali Congress lawmaker Ram Hari Khatiwada drew the House’s attention to the respective ministers’ absence.\n\nDeliberations on the budgets for the three ministries cannot proceed in the absence of the respective ministers, said Khatiwada.\n\nAs the scheduled discussions could not happen on Thursday and Friday, they were pushed to Saturday. The lower house had to discuss the budget for 10 ministries, 45 percent of the total ministries, in a single day.\n\n“The ministers are undermining the House. They are openly flouting the parliamentary rules and practice by ignoring the budget discussion,” Hitraj Pandey, CPN (Maoist Centre) chief whip, said on Thursday.\n\nNot just the opposition lawmakers, even those from the ruling parties came forward to criticise the ministers’ negligence of House proceedings.\n\n“Some ministers didn’t show up yesterday [Friday] or the day before [Thursday]. As a result, we are discussing the budget of 10 ministries today [Saturday]. I would like to ask our ministers what could be more important than attending the ongoing discussions on appropriation bills in Parliament? What compelled you to be elsewhere instead of here? This is a very serious question,” said CPN-UML lawmaker Yogesh Bhattarai while participating in the deliberations on Saturday.\n\nIn parliamentary democracy, the government—the prime minister and the ministers—is accountable and answerable to Parliament. As the respective ministers need to answer the questions raised during the budget deliberations, their presence is necessary on the day the respective ministries’ budget is discussed. However, either the ministers remain absent on the scheduled day of discussion or arrive late.\n\nThe lower house meeting, called for 11 am on Saturday, was delayed by an hour as most of the ministers failed to arrive on time. “What exactly are our ministers supposed to do if they can’t make time for a budget discussion? This is a serious matter of [lack of] accountability,” said Bhattarai.\n\nExperts on parliamentary affairs say the absenteeism of ministers in Parliament, even during budget deliberations, shows their lack of accountability towards the House and also that budget deliberation has become mere ritual.\n\n“Even lawmakers do not actively participate in budget discussions because they are ritualistic,” said Som Bahadur Thapa, former secretary at the Parliament Secretariat.\n\nThe House is often empty during budget deliberations, Thapa says. Lawmakers typically attend only to mark their presence, stay until their turn to speak, and then leave. As per parliamentary regulations, any bill, including those related to the budget, can be put to a vote only when at least 25 percent of the members are present.\n\nHowever, there is no such rule for deliberations, which is why the lawmakers often tend to skip meetings after marking their presence, according to officials at the secretariat.",
      "date": "2025-06-22",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/KRBKTMU3A9125-1750552802.jpg",
      "read_time": "3 min read"
    },
    {
      "url": "https://kathmandupost.com/politics/2025/06/20/fresh-setback-in-civil-service-bill-s-progress-over-cooling-off-time",
      "title": "Fresh setback in civil service bill’s progress over cooling-off time",
      "body": "The government has been widely criticised for allegedly trying to stall the Federal Civil Service Bill even after it was presented in the plenary of the House of Representatives. Prior to this, the bill was endorsed by the concerned House committee.\n\nLawmakers from the opposition parties and other stakeholders came down heavily on the government after the agenda of tabling the bill for deliberations was not included in the fortnightly calendar of the House of Representatives published on Wednesday.\n\nOpposition MPs have accused the government of trying to change the provision for a two-year cooling-off period included in the bill by the State Affairs and Good Governance Committee.\n\nThe provision restricts top bureaucrats from political appointments for two years after leaving office.\n\nThe bill passed by the committee on May 16 was presented in the House meeting on June 15for further process.\n\nA parliamentary discussion on the legislation was earlier scheduled for Tuesday. But it was removed from the agenda, allegedly due to pressure from government secretaries. Speaker Dev Raj Ghimire also adjourned the House meeting until Thursday to delay the discussion on the bill,a member of the House committee said.\n\nWhen a fortnightly calendar was published on Wednesday, the agenda of the Federal Civil Service Bill was not included, hinting that the government is not ready to carry the bill forward without modifying the cooling-off provision.\n\nAfter the State Affairs and Good Governance Committee of the House passed the Federal Civil Service Bill on May 16, top bureaucrats hadintensified lobbying against the new clause in the billbarring retired government employees from political appointments for two years after leaving office.\n\nNepali Congress lawmaker Hridaya Ram Thani, also a member of the committee, argues that providing a cooling-off period has become essential. Its absence would encourage a civil servant to leave office before retirement for a political appointment. This provision was apparently included after concerns that senior bureaucrats look to appease politicians in order to secure political appointments post-retirement.\n\nThani also said that the provision of a two-year cooling-off period was incorporated in the bill based on suggestions from Prime Minister KP Sharma Oli, who now allegedly wants to backtrack on the provision already passed by the committee.\n\n“There had been rigorous discussions within the committee on whether the retirement age for civil servants should be increased to 59 or 60 years,” Thani told the Post.\n\n“The Public Service Commission had recommended gradually increasing the retirement age to 60 years over a period of three years–by adding six months in the upcoming fiscal year, one year the next year, and another six months in the third year,” he said.\n\nAt present, civil servants retire at 58 on age grounds. Considering the rising life expectancy of Nepalis, there were suggestions that the retirement age threshold too be increased. According to the World Bank, when the current civil service was introduced, the average life expectancy of Nepali people was 58 years,which had climbed to 70by 2023.\n\n“The prime minister conveyed his message to the committee through three ministers, repeatedly suggesting that the retirement age be kept at 59 years, with a two-year cooling-off period. We proceeded accordingly,” Thani added.\n\nSpeaking in the House on Thursday, Hit Raj Pandey, chief whip of the main opposition CPN (Maoist Centre), urged the tabling of the bill without further delay.\n\nSimilarly, Rajendra Pandey, deputy parliamentary leader of the CPN (Unified Socialist), claimed that the government was reconsidering the bill after secretaries threatened to tender their collective resignations.\n\n“Even if 25 secretaries resign, new ones will be appointed. Vital policy decisions cannot be held back just because of the resignation threat,” Pandey said.\n\nBut Suresh Acharya, secretary at the Ministry of Energy, doesn’t buy the argument that the bill was stalled due to their pressure. He argues that the bill passed by a House committee can still be amended by the plenary of the lower house and also by the National Assembly. A bill becomes law only after both chambers of the federal parliament endorse it and the President then approves it.\n\nAcharya argued that there is no reason for the secretaries to lobby against the bill, and once a bill enters parliamentary proceedings, no one can arbitrarily halt its progress.\n\nHowever, he was quick to add that if the government intends to enforce a cooling-off period, it should not apply solely to civil servants. If such a provision is to be implemented, it must also apply to employees of other government agencies.\n\nNot only opposition leaders, even Ram Hari Khatiwada, Congress lawmaker who chairs the State Affairs and Good Governance Committee, expressed his dissatisfaction over the government’s dilly-dallying in moving the bill forward.\n\nPresenting the Bill to Amend the Citizenship Act in Thursday’s House meeting, he drew the government’s attention to the delay in advancing the civil service bill.\n\n“I do not see the Federal Civil Service Bill included in today’s agenda,” Khatiwada said. “I hope it will soon be put on the agenda and passed.”\n\nAccording to two ministers, the issue of cooling-off period was thoroughly discussed at the Cabinet meeting on Monday. The discussion centred on exploring alternative provisions for secretaries in case the cooling-off period mentioned in the Federal Civil Service Bill could not be removed.\n\nDuring the Cabinet meeting, prime minister Oli was of the view that not all retired senior officials get political appointments and as such removing the two-year cooling-off period could be an option, said the ministers, quoting Prime Minister Oli.\n\n“These points were discussed in the Cabinet as matters requiring careful consideration. It was also noted that the experience of civil servants at retirement may be irrelevant after a few years,” a minister told the Post. “Therefore, the discussion centred on whether appointments could be made in a manner that serves public interest.”\n\nThe Cabinet decided this matter should also be discussed among the top leaders of three major political parties.\n\nPrime Minister Oli had indeed invited Congress President Sher Bahadur Deuba and Pushpa Kamal Dahal, leader of the main opposition, to discuss the cooling-off period, among other national issues.\n\nHowever, the top leaders could not meet on Wednesday as Dahal was in Chitwan. But the three did not meet on Thursday as well.\n\nHowever, leaders from coalition partners Congress and the CPN-UML did meet. Prime Minister Oli was joined by Deputy Prime Minister and Finance Minister Bishnu Paudel of the UML in the meeting. From the Congress, in addition to President Deuba, also present were Vice President Purna Bahadur Khadka, General Secretary Gagan Thapa, Home Minister Ramesh Lekhak, Foreign Minister Arzu Rana Deuba, and Minister for Energy and Water Resources Deepak Khadka. Thapa was attending a two-party meeting after a long interval.\n\n“Our discussion on Wednesday revolved around how to make the government’s functioning and delivery more effective, how to end the parliamentary obstruction and expedite the passage of bills, and recent political developments, including the budget,” Congress Vice President Khadka told the Post.\n\nKhadka claimed that the nearly four-hour-long meeting saw discussions on various bills, but not the one involving the cooling-off period.\n\nHowever, according to another leader privy to the discussion, the Civil Service Bill and the cooling-off period were the subject of discussion in the meeting.\n\n“There is still no consensus on the cooling-off period,” the leader said. “A decision has yet to be made on whether the two-year period is appropriate.”",
      "date": "2025-06-20",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/news/oli-1750384297.jpg",
      "read_time": "6 min read"
    },
    {
      "url": "https://kathmandupost.com/politics/2025/06/18/house-protest-helping-rastriya-swatantra-party-s-agenda",
      "title": "House protest helping Rastriya Swatantra Party’s agenda?",
      "body": "Rastriya Swatantra Party, the fourth largest party in the House of Representatives, is singlehandedly pressing for an investigation into the visit visa scam and punishment against officials promoting human trafficking through the Tribhuvan International Airport.\n\nOther opposition parties like the CPN (Maoist Centre) and the CPN (Unified Socialist) have left the RSP alone in the well trying to disrupt the House and demanding high-level probe into human trafficking. The party is also adamant on demanding Home Minister Ramesh Lekhak’s resignation even as the Commission for Investigation of Abuse of Authority is looking into the matter.\n\nAfter signing a two-point deal with the CPN-UML and the Maoist Centre, the RSP has been without allies except for the Rastriya Prajatantra Party (RPP) that occasionally presents its stance against the home minister. The RPP is a royalist outfit forcefully campaigning for the restoration of Hindu monarchy in Nepal.\n\nMaoist Centre Chairman Pushpa Kamal Dahal on Tuesday said that although they are in the opposition, they are compelled to act like a ruling party and strike a balance between the ruling and the opposition. The main opposition leader said that the situation had arisen due to the constitution and the existing laws.\n\nAfter signing a two-point agreement with the ruling alliance, Dahal feels the heat within his own party. But due to some necessities like passing the national budget and protecting Nepal’s constitution, political system, and the law and regulations, he was forced to compromise with the ruling parties, Dahal argues.\n\nIt has become increasingly difficult for the RSP to sustain its agenda for long but the party has been using new tricks to protest inside the House.\n\nAs an opposition party, the RSP will definitely benefit from the anti-incumbency factor as ruling parties become unpopular, said political analyst Mumaram Khanal, but it would be difficult for the new party to establish its agenda.\n\n“It looks like the party upped its ante because it wants to take revenge on the jailing of its president, Rabi Lamichhane,” said Khanal. “On the other hand, continued House obstruction will lead to public suffering. But they do not have the strength to sustain the protest. This makes it unlikely that a probe committee will be formed.”\n\nOn the other hand, the CIAA has not explicitly indicated the role of Home Minister Lekhak in the visit visa scam, Khanal argued.\n\nOn Tuesday too, the RSP urged the ruling parties to heed their demands.\n\nAn RSP lawmaker told the Post that they are in regular touch with the Nepali Congress leadership to end the impasse.\n\n“Since the Congress leadership is not taking our suggestions, we are clear that the UML is playing a dubious role in the entire episode. So we will not relent,” the RSP leader said. Lekhak is a Congress lawmaker.\n\nParty spokesperson and lawmaker Manish Jha said they will not back down from their demand for an investigation into those involved in organised crimes related to visit visas and human trafficking.\n\nRSP lawmakers were seen in the House wearing blue scarves. As part of their protest, they sat near the well wearing blue scarves to symbolise the global campaign against human trafficking.\n\nRSP lawmakers have been obstructing House proceedings since May 27. The party alleges that Nepali citizens are being trafficked out of the country under the garb of visit visas while the government shut its eyes to the problem.“We are raising our voice for the victims, and will not stop until justice is served,” said Jha.However, the protest prompted a strong reaction from the ruling Nepali Congress. The party accused RSP lawmakers of violating parliamentary rules by wearing unauthorised symbols inside the House. Congress chief whip Shyam Kumar Ghimire raised a formal objection that such displays could undermine decorum and set a disruptive precedent.\n\n“There is a rule that lawmakers must appear in proper, formal attire,” Ghimire said. “What happens if someone shows up in casual or any protest gear? This is not how to maintain the dignity of Parliament.”\n\nGhimire appealed to Speaker Devraj Ghimire to issue a warning and consider disciplinary action, including expulsion, against the protesting lawmakers. “The Speaker must take this seriously and act to protect the sanctity of the House,” he demanded.\n\nSantosh Pariyar, the RSP chief whip, said he spoke with the Speaker on Tuesday to discuss the impasse. “We will sit tomorrow too but I see no immediate solution to this issue,” he added.\n\nRSP leaders believe their popularity is rising due to the stance against the visa scam. “People support our agenda and our popularity is rising,” said Sishir Khanal, another RSP lawmaker. “Since big parties have been ignoring our demands, it is difficult to say when this fiasco will end.”\n\nMahesh Bartaula, chief whip of the prime minister’s party—UML, said the RSP made a blunder by wearing the scarves.\n\n“Such childish behaviour will only tarnish the country’s image internationally,” he told the Post. “We do not know when and how the RSP’s protest will end, but it is not helping them. Real politics is different and we are here to do politics for a longer term.”\n\nCiting the ongoing protests, the House meeting was on Tuesday deferred till Thursday.",
      "date": "2025-06-18",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/house-1750208170.jpg",
      "read_time": "4 min read"
    },
    {
      "url": "https://kathmandupost.com/politics/2025/06/16/speaker-pushes-house-proceedings-despite-opposition-protest",
      "title": "Speaker pushes House proceedings despite opposition protest",
      "body": "Speaker Devraj Ghimire proceeded with the meeting of the House of Representatives on Monday despite obstruction by the opposition lawmakers from the Rastriya Swatantra Party (RSP) and Rastriya Prajatantra Party (RPP).\n\nSoon after the meeting commenced, lawmakers from the two parties stood up from their seats in protest. Speaker Ghimire allowed RPP chair Rajendra Lingden to speak, who urged him not to push ahead the House proceedings forcefully while the opposition’s concerns remained unresolved.\n\nRSP Chief Whip Santosh Pariyar, speaking next, reiterated the party’s demand for the formation of a parliamentary committee to investigate the visit visa scam.\n\nDespite continued sloganeering, Speaker Ghimire pressed ahead with the day’s agenda and opened the floor for discussion on the government’s annual estimates of revenue and expenditure for the fiscal year 2025-26. RSP lawmakers intensified their protest, chanting slogans demanding the resignation of Home Minister Ramesh Lekhak and immediate action to stop human trafficking.\n\nEarlier in the day, Rastriya Swatantra Party (RSP) Acting Chairman Dol Prasad Aryal and Chief Whip Santosh Pariyarmet Speaker Ghimireto discuss the ongoing parliamentary deadlock. The party made it clear that it would continue its protest as the government had not addressed its core demands.\n\nThe RSP leaders said the government was not taking the visit visa scam seriously and was reluctant to initiate an independent investigation.\n\n“Our protest is necessary because the government has ignored our demands. We are not in a position to back down now,” the party leaders told the Speaker.",
      "date": "2025-06-16",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/WhatsAppImage20250616at23752PM-1750064214.jpg",
      "read_time": "1 min read"
    }
  ],
  "money": [
    {
      "url": "https://kathmandupost.com/money/2025/07/07/economists-warn-rising-bad-loans-could-threaten-financial-stability",
      "title": "Economists warn rising bad loans could threaten financial stability",
      "body": "A rise in nonperforming loans (NPLs) could pose serious risks to the economy, economists warned on Sunday.\n\nThe number of nonperforming loans typically rises during times of economic uncertainty. These are loans for which borrowers either do not or cannot make payments.\n\nAt a pre-monetary policy discussion titled“Tackling Non-performing Loans (NPLs): Role of Monetary Policy in Ensuring Financial Stability”, organised by the Society of Economic Journalists-Nepal in Kathmandu, economist Sameer Khatiwada said that extending loans simply to avoid bankruptcy is not a rational strategy.\n\n“We need to conduct a proper survey,” Khatiwada said. “The government's decision to bring the asset management company into operation is a good move, but more important is to conduct an asset quality review. That will help identify bad assets and make banking transactions more transparent.”\n\nAn asset management company is expected to manage banks' and financial institutions' bad loans and non-banking assets. The government is preparing to establish a separate institution dedicated to managing the rapidly increasing volume of bad loans in the financial system.\n\nAccording to third-quarter financial statements released by 20 commercial banks for the current fiscal year (as of mid-April), the average NPL ratio has climbed to 4.8 percent, up from 3.65 percent during the same period last fiscal year.\n\nBy mid-April, NPLs at nine of the 20 commercial banks had exceeded the 5 percent threshold, which financial experts consider unhealthy for the system.\n\nA recently published IMF report has also flagged rising risks in Nepal’s financial sector, noting that nonperforming assets have not been addressed effectively due to a lack of proper restructuring and delays in asset auctions.\n\nWhile Nepal’s external sector remains strong—with rising exports, tourism receipts, and remittance inflows outpacing import growth—challenges in the financial sector continue to mount.“Financial sector vulnerabilities have not yet eased,” the IMF warned. “NPLs rose to 5.2 percent as of April 2025, eroding bank capital buffers. The financial condition of savings and credit cooperatives (SACCOs) also remains concerning.”\n\nKhatiwada noted that while the expansionary monetary policy during the Covid-19 pandemic was appropriate, the rollback was abrupt, and interest rates were hiked too quickly.\n\n“Coordination between fiscal and monetary policy is essential,” he said, “as it enables both tools to work in tandem.”\n\nExperts also expressed concern that banks' NPL data may not reflect the actual situation, as figures are often underreported. If loan recovery does not improve in the coming months, many banks could face significant difficulties.\n\n“During the pandemic, monetary policy took on the heavy lifting, which weakened lending standards. Banks started issuing loans easily, ultimately creating the NPL problem,” Khatiwada said.\n\nNepal Rastra Bank Governor Biswo Nath Poudel stressed the need for a microeconomic approach that considers climate-related vulnerabilities.\n\n“Credit should be directed in a way that it reaches all segments of the population,” Poudel said, adding that rising NPLs in the agriculture and construction sectors must be addressed and corrected.\n\nHe acknowledged that while economic indicators show improvement, several pressing issues remain unresolved.\n\nRajesh Upadhyay, senior vice-president of the Confederation of Banks and Financial Institutions Nepal, pointed out that despite low interest rates, credit flow has declined, which suggests deeper underlying problems.\n\n“The fall in loan demand is largely due to a sharp decline in disposable incomes,” Upadhyay said.\n\n“With falling earnings and a growing number of youths leaving the country for work or education, consumption has dropped.”\n\nHe added that borrowers are struggling to manage loans due to the economic slowdown triggered by Covid-19 and the introduction of stricter working capital guidelines. “People are unable to repay their loans even by selling land.”\n\nEconomist Menuka Karki said that monetary policy appears to supplement fiscal policy in Nepal.\n\n“The private sector’s problems need to be addressed either by fiscal or monetary policy,” she said. “The core issue is the lack of coordination, and the failure to make fiscal policy expansionary,” Karki added.\n\nThe main objectives of monetary policy are to maintain price stability and balance of payments stability.\n\nSantosh Koirala, president of the Nepal Bankers’ Association, said the government should legally mandate the operation of asset management companies.\n\n“While banks have been doing asset management independently, there is a strong need for a separate and empowered asset management institution,” he said.",
      "date": "2025-07-07",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/photoSEJON-1751850908.jpg",
      "read_time": "3 min read"
    },
    {
      "url": "https://kathmandupost.com/money/2025/07/07/nepse-falls-as-turnover-also-declines",
      "title": "NEPSE falls as turnover also declines",
      "body": "The Nepal Stock Exchange (NEPSE) index declined by 22.35 points on Monday, closing at 2,684.01 points, down by 0.82 percent compared to the previous session.\n\nTotal turnover stood at Rs8.37 billion, down from Rs9.5 billion recorded on Sunday, signalling a fall in both investor activity and sentiment. A total of 19.41 million shares were traded in 71,313 transactions.\n\nAccording to NEPSE, share prices of 39 companies rose while 209 declined.\n\nOnly two sub-indices—Hotels & Tourism and Mutual Funds—registered gains, with the Hotels & Tourism sector rising by 41.80 points. All other sectors ended the day in the red.\n\nThe drop in both the index and turnover reflects a cautious start to the week, as investors appear to be taking a wait-and-see approach following several sessions of market volatility.",
      "date": "2025-07-07",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/news/nepsedown-1751885683.jpg",
      "read_time": "1 min read"
    },
    {
      "url": "https://kathmandupost.com/money/2025/07/06/nepse-rises-for-sixth-straight-session",
      "title": "NEPSE rises for sixth straight session",
      "body": "The Nepal Stock Exchange (NEPSE) index rose slightly by 2.40 points on Sunday, closing at 2,706, marking its sixth consecutive day of gains.\n\nTotal turnover stood at Rs9.5 billion, slightly down from the previous session’s Rs9.64 billion. The ‘Others’ group saw the highest gain of 3.06 percent, driven by strong performances from Himalayan Re and Nepal Reinsurance.\n\nFinance rose by 2.49 percent, while banking, investment, and manufacturing sectors also saw modest gains. Meanwhile, development banks, hydropower, and insurance sectors posted marginal losses.\n\nNepal Finance surged 10 percent, topping the gainers’ list, followed by Guardian Micro Life and Rapti Hydro. On the losing side, Green Development Bank fell 8.58 percent.\n\nAmong the most actively traded stocks were Nepal Reinsurance, Laxmi Sunrise Bank promoter shares, and Himalayan Reinsurance.",
      "date": "2025-07-06",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/money/nepseupnew-1751191787.jpg",
      "read_time": "1 min read"
    },
    {
      "url": "https://kathmandupost.com/money/2025/07/06/boat-plans-to-sail-beyond-india-with-nepal-launch",
      "title": "boAt plans to sail beyond India with Nepal launch",
      "body": "boAt, India’s number one audio wearable brand, officially announced its entry into the Nepali market on July 1, marking its first international expansion. The brand is now distributed nationwide by TeleTalk, a subsidiary of Ramesh Corp. Although boAt had made informal inroads in Nepal, it is now formalising its presence with its acclaimed Nirvana series. This premium range, which features top-performing active noise cancellation (ANC)-enabled earphones and earbuds, will now be available across leading offline and online retail platforms throughout Nepal. Aman Gupta, co-founder and chief marketing officer of boAt, was recently in Nepal for the official unveiling of key products. ThePost’sKrishana Prasainmet with Gupta to discuss boAt’s journey, vision, and global ambitions. Below are excerpts from the conversation:\n\nboAt has grown into one of India's most recognisable lifestyle brands in a short span. What was your vision when you started, and how has it evolved?\n\nboAt has been India's number one audio product brand for the past few quarters, and we’ve been doing really well. Even globally, boAt has performed impressively—we’ve been among the top five audio brands for the last four years. Now, we’re looking beyond India. We’ve expanded our business into Dubai, Sri Lanka, and Nepal. Initially, we were just testing the waters, but now we’re deploying a full-fledged team to do business and provide Nepali consumers with high-quality audio products made with love.\n\nOur original vision was to create sound systems catering to music lovers. As someone who appreciates good music, I felt the effort artists put into making music wasn’t matched by the quality of products available to consumers at a fair price. Most audio products were either overpriced or of poor quality. So we saw a gap in the market for well-designed, value-driven audio solutions. That’s how boAt was born. Fortunately, consumers have embraced the brand. Once people try boAt, they tend to stick with it.\n\nMany tech brands focus on features, but boAt has built a strong emotional connection with young consumers. How did you craft a brand identity that resonates deeply with this demographic?\n\nEvery brand has its ethos. Ours has always been to cater to the young consumers of India. They’re our target audience—they're smart and tech-savvy, and they pay close attention to reviews and product quality. We targeted them intentionally, and they reciprocated with love and loyalty. That’s the reason boAt has reached where it is today.\n\nThe Indian audio and wearable tech space is highly crowded. What are boAt’s key differentiators, and how do you plan to stay ahead of the curve?\n\nI wouldn’t say the market is crowded. I think the industry is just beginning to mature. There are still many unorganised markets out there. What we do at boAt is bring structure to that chaos. We offer high-quality products at reasonable prices, infuse aspiration into our product portfolio, and deliver cutting-edge technology to the consumer’s doorstep. That’s what defines boAt.\n\nOf course, there’s competition everywhere, but we stay ahead by outworking others. We have a dedicated research and development lab that consistently innovates. Our team in India is outstanding, and our manufacturing process is equally strong. We’re confident that good times are ahead.\n\nYou’ve often spoken about making boAt a global brand. What are your next steps for international expansion, and what challenges do you anticipate in scaling globally?\n\nEach country is unique and has its own set of dynamics. Nepal, for example, operates differently from Dubai. So, to expand globally, we must first understand the consumer in each market—what they need, the price points they expect, how to penetrate the market effectively, and how to ensure customer loyalty. It’s also about executing the marketing strategy correctly, setting up reliable distribution networks, and offering strong after-sales support, including warranty services. Every detail counts.\n\nHow do you assess the Nepali market for boAt products?\n\nNepal and India are closely connected—not just geographically but culturally, too. So, unlike other markets, we don’t feel the same level of pressure to understand Nepal. The two countries share many similarities. For instance, Nepali audiences have been long-time fans of Bollywood, and our cultural overlap helps us gauge what the Nepali consumer might want.\n\nThis perspective could help us grow beyond borders. We’ve seen a lot of love from Nepal already—many people from Nepal follow me on Instagram, and I’ve received numerous direct messages asking when I’ll visit and launch boAt officially. That kind of anticipation is heartening and validates our entry into the market.",
      "date": "2025-07-06",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/boat-1751763235.jpg",
      "read_time": "3 min read"
    },
    {
      "url": "https://kathmandupost.com/money/2025/07/05/ministry-revises-draft-bill-on-airline-liability-and-insurance",
      "title": "Ministry revises draft bill on airline liability and insurance",
      "body": "The Ministry of Culture, Tourism, and Civil Aviation has revised the draft bill governing domestic airlines’ liability and insurance responsibilities, and invited public feedback on it.\n\nThe updated draft, now available on the ministry’swebsite, signals a renewed push to advance long-stalled aviation reforms following Nepal’s ratification of the Montreal Convention 1999 in December 2018.\n\nWhile the Montreal Convention applies only to international air travel, this draft aims to align Nepal’s domestic aviation liability framework with global standards, said a ministry official.\n\nThe revised legislation outlines passengers’ rights and airline obligations during accidents, delays, or disruptions, aiming to ensure clarity and accountability across the sector.\n\nThe bill, which has been dormant since 2019, proposes comprehensive rules on passenger compensation, cargo liability, insurance coverage, and conditions under which carriers are exempt from responsibility.\n\nThe ministry has given a seven-day window for public feedback. After that, the draft will be submitted to the Ministry of Law for legal scrutiny.\n\nUpon approval, it will move to the Cabinet before being tabled in Parliament.\n\nUnder the proposed provisions, domestic airlines will be liable to pay compensation up to $100,000 if a passenger suffers serious injury, physical harm, or death due to an accident during boarding, flight, or disembarkation. In fatal cases, the compensation must be paid to the deceased passenger’s nearest legal heir.\n\nIn comparison, the Montreal Convention sets the liability cap at $202,500 for death or injury during international flights. This limit was last revised on December 28, 2024.\n\nThe draft bill requires airlines to arrange for appropriate medical treatment in cases of non-fatal injury or disability caused by an accident. In the event of a passenger’s death, the airline is responsible for returning the body to the family and providing advance payments to help cover immediate funeral and transport costs.\n\nThe draft also mandates compensation for flight delays and cancellations. If a scheduled flight is delayed or cancelled, passengers holding valid tickets must be informed at least three hours before the revised departure time.\n\nIf a flight is overbooked or unable to accommodate a ticketed passenger, the airline must offer one of the following: an alternative seat on another carrier flying to the same destination at a similar time, another immediate and cost-free travel option to the final destination, or a full refund with immediate ticket cancellation.\n\nClear guidelines have also been laid out for baggage-related claims. If checked luggage is lost or damaged, airlines must compensate up to $20 per kilogram, not exceeding a total of $5,000, to be paid in Nepali currency.\n\nFor unchecked baggage—items carried by passengers into the cabin—the airline must compensate up to $400, also in local currency, for loss or damage.\n\nThe draft sets a liability cap of $20 per kilogram for loss or damage to cargo unless the shipper has explicitly declared a higher value in writing. Airlines are deemed responsible for losses resulting from negligence by the airline, its staff, or authorised agents.\n\nThe airline must compensate the affected party if the cargo is not delivered on time. The cargo is considered undelivered if it does not arrive within three days when no specific delivery date was agreed upon. It is officially regarded as lost if it is not delivered within 15 days of the scheduled date or within 30 days of acceptance if no delivery time was set.\n\nThe bill also outlines scenarios under which airlines are exempt from liability. Airlines will not be held responsible for delays or cancellations resulting from weather disturbances, natural disasters, airport or air traffic service disruptions, or security-related restrictions imposed by government authorities.\n\nAdditionally, the airline is not liable if injury or harm results from the passenger’s gross negligence or a pre-existing medical condition, provided the airline can produce evidence supporting its claim.\n\nThe draft also includes provisions related to third-party liability in the event of aircraft accidents.\n\nIt sets mandatory insurance coverage based on the aircraft’s weight: $25 million for aircraft weighing up to 10,000 kilograms, $35 million for those between 10,001 and 35,000 kilograms, and $60 million for aircraft over 35,000 kilograms.\n\nIf a passenger is injured or disabled during a flight, claims for compensation and medical costs must be filed with the airline or its agent within 60 days, supported by the necessary documentation. If the airline rebuts the claim, the affected party may file a lawsuit in a relevant court within 35 days of receiving the notice.\n\nThe draft introduces the concept of unlimited liability for some instances.\n\nCompensation for injuries or disabilities will be calculated based on the severity of the harm, the resulting loss of income, and the long-term impact on the passenger’s earning ability.\n\nFurther, the bill directs the government to review compensation limits every 10 years and adjust them according to inflation and current market conditions. Any such revisions must be officially published in the Nepal Gazette.",
      "date": "2025-07-05",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/money/1040622Airport4-1751680181.jpg",
      "read_time": "4 min read"
    },
    {
      "url": "https://kathmandupost.com/money/2025/07/04/nepse-this-week-1751599872",
      "title": "NEPSE this week",
      "body": "",
      "date": "2025-07-04",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/thumb1726220193117267978501732240474-1741830500.jpg",
      "read_time": "1 min read"
    },
    {
      "url": "https://kathmandupost.com/money/2025/07/04/janakpur-fish-house-by-masterchef-santosh-opens-in-naxal",
      "title": "Janakpur Fish House by MasterChef Santosh opens in Naxal",
      "body": "",
      "date": "2025-07-04",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/ashgsshgsghsd-1751598849.jpg",
      "read_time": "1 min read"
    },
    {
      "url": "https://kathmandupost.com/money/2025/07/04/uk-executive-gets-us-probation-in-nepal-airbus-purchase-scam",
      "title": "UK executive gets US probation in Nepal Airbus purchase scam",
      "body": "Deepak Sharma, a UK-based executive at AAR Corp—the aviation services firm that supplied two Airbus A330 jets to Nepal Airlines—has been sentenced to three years of probation for his role in a foreign bribery scheme.\n\nSharma’s sentencing took place on June 27, overseen by US District Judge Amit Mehta.\n\nAccording toMLex’sreporting, Judge Mehta sentenced Sharma to three years of probation. He is required to spend the first six months in a residential community centre, complete 200 hours of community service, and then self-deport from the United States.\n\nIn addition, Sharma was ordered to pay a $150,000 fine and forfeit $130,835.\n\nAlthough Sharma faced a maximum sentence of 60 months in prison, federal prosecutors requested a reduced sentence of 40 months, citing his extensive cooperation with the investigation.\n\nHis defense team requested no prison time, highlighting both his collaboration with authorities and his deteriorating health, which requires daily medical attention.\n\nSharma reportedly became emotional during his sentencing hearing while delivering his statement to the court.\n\nHe expressed “profound remorse” for his actions, explaining how his desire to protect his job had escalated into active participation in bribing officials in Nepal and South Africa on his company’s behalf.\n\n“The sentencing guidelines overstated the gravity of Sharma’s offence because he wasn’t personally enriched by the crime and had no ownership stake in the company,” Judge Mehta stated during sentencing, as cited in the media report.\n\nAAR Corp, for its part, admitted corporate responsibility for the actions of its officers, directors, employees, and agents.\n\n",
      "date": "2025-07-04",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/money/Widebody-1751593554.jpg",
      "read_time": "1 min read"
    },
    {
      "url": "https://kathmandupost.com/money/2025/07/03/hotels-struggle-to-retain-staff-as-trained-workers-flock-abroad",
      "title": "Hotels struggle to retain staff as trained workers flock abroad",
      "body": "Hotels and restaurants across Rupandehi are experiencing a growing labour shortage, despite offering steady employment at the local level.\n\nThe booming hospitality sector, especially in Bhairahawa and surrounding areas, has created thousands of jobs, yet employers say retaining staff has become a major challenge as most workers treat the job as a stepping stone to go abroad or shift to higher-paying casinos.\n\nWith a surge in tourism and hotel investments, many hotels and restaurants are hiring large numbers of staff and offering on-site training. These jobs provide local youths an opportunity to earn while gaining experience in a growing industry. However, hotel owners say that only 27 to 30 percent of their staff remain long-term, while the majority leave within months. Many employees quit after completing basic training, resulting in a cycle of costly retraining and high turnover.\n\n“Hospitality jobs have become informal training centres for those planning to go abroad,” said Rupak Gautam, managing director of Royal Tiger Recreation Pvt Ltd. “They agree to work for a year but often leave well before completing their contracts.”\n\nHis company provides employee benefits like provident fund, health and accident insurance, and even pays up to Rs200,000 per month depending on position.\n\nYet, foreign employment remains more attractive.\n\nRoyal Tiger alone employs around 600 workers in roles such as kitchen staff, housekeepers, drivers, and security guards. Despite the incentives, new workers are needed almost every week.\n\n“We train them with food, lodging, and uniforms, investing over a lakh per person,” said Tika Baral, operator of the Lumbini Buddha Garden Resort. “Still, many leave to go abroad or join other hotels.”\n\nThe constant churn is also due to students who join for short stints while studying and then move on. Even graduates in hotel management fail to stay long in the sector. Baral says some of his earliest employees are no longer with him. He believes the sustainability of the hotel business hinges on reliable, skilled workers. “Without trained staff, service quality drops, and long-term business becomes difficult,” he said.\n\nIndustry insiders say the problem extends beyond just hotels and restaurants. Casinos operating in the region, which offer significantly higher wages, are pulling in trained hospitality staff. A single casino may employ up to 1,000 workers, creating additional pressure on the hotel labour market.\n\nAccording to Chandra Prakash Shrestha, president of the Siddhartha Hotel Association, more than 150 quality hotels operate between Belahiya and Lumbini, employing over 10,000 workers. Across the district, an estimated 50,000 people are employed in the hospitality sector. “Employees are the backbone of our business,” said Shrestha. “But it’s difficult to retain them because of the lure of foreign jobs and better-paying alternatives.”\n\nThe situation is not unique to a single hotel.\n\nRajesh Malhotra, deputy general secretary of the Hotel Entrepreneurs Federation Nepal, said that in his decade of running Hotel Sunstar, 90 percent of his staff have resigned. “We’ve stopped expecting long-term commitment and now hire fresh youth and train them ourselves,” he said. “But preparing one employee costs at least Rs100,000, and it’s disheartening when they leave shortly after.”\n\nMalhotra noted that young people come in with some education and skills, but the starting salary of Rs10,000–12,000, despite food and lodging provisions, often isn’t enough for their growing expenses. As a result, they leave in search of better opportunities.\n\nHotel Association Nepal (HAN) president Binayak Shah echoed these concerns, saying the hospitality sector nationwide is facing a skilled worker crisis. Those trained in Nepal often find better prospects abroad.\n\nIn response, HAN is conducting waiter-level and other vocational training programmes in Kathmandu and other major tourist hubs. “We’re focused on skill-building with the goal of retaining youth in the country,” said Shah. “Even if they go abroad, skilled Nepali workers can find good jobs in hotels there. But our main goal is to keep them here.”\n\nDespite the growth of the hospitality sector and the creation of thousands of jobs, hoteliers are grappling with a revolving door of employees. Unless long-term solutions are found to attract and retain workers, they say the growth and quality of Nepal’s hospitality industry could be at risk.",
      "date": "2025-07-03",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/money/1-1751504545.jpg",
      "read_time": "3 min read"
    },
    {
      "url": "https://kathmandupost.com/money/2025/07/03/nepse-maintains-upward-momentum-turnover-hits-rs9-64-billion",
      "title": "NEPSE maintains upward momentum, turnover hits Rs9.64 billion",
      "body": "The Nepal Stock Exchange (NEPSE) index extended its rally on Wednesday, gaining 9.14 points to close at 2,703.86 — a rise of 0.33 percent. This marks the fifth consecutive session of growth for the domestic bourse.\n\nInvestor activity remained high, with a total turnover of Rs9.64 billion. According to NEPSE, 24,976,366 shares were traded in 96,411 transactions throughout the day.\n\nOut of the 13 sectoral sub-indices, five ended in negative territory. The hotel and tourism, hydropower, investment, microfinance, and trading groups all posted declines. However, life insurance led the day’s gains with a jump of 345.88 points, followed by non-life insurance which climbed 279.19 points.\n\nShare prices of 122 companies increased, while 125 declined.\n\nAmong individual gainers, Nepal Finance Company surged by 9.98 percent, Khanikhola Hydropower added 7.17 percent, Samriddhi Finance climbed 7.08 percent, Bhugol Energy Development rose 6.78 percent, and Sayapatri Hydropower gained 6.57 percent.",
      "date": "2025-07-03",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/money/nepserebound-1751537998.jpg",
      "read_time": "1 min read"
    },
    {
      "url": "https://kathmandupost.com/money/2025/07/02/nepse-continues-upward-trend-turnover-nears-rs10-billion",
      "title": "NEPSE continues upward trend, turnover nears Rs10 billion",
      "body": "The Nepal Stock Exchange (NEPSE) index surged by 34.42 points on Wednesday to close at 2,694.82, marking a 1.29 percent rise from the previous session.\n\nInvestor sentiment remained robust, with total turnover reaching an impressive Rs9.74 billion. A total of 30,182,341 shares of 317 companies changed hands through 89,468 transactions.\n\nAll sectoral sub-indices ended the day in positive territory. The life insurance group led the rally with a gain of 2.83 percent, followed by non-life insurance at 2.51 percent and development banks at 2.31 percent.\n\nOther notable gainers included the banking sector, which rose by 1.36 percent, finance by 1.99 percent, hotels and tourism by 0.71 percent, and hydropower by 0.47 percent. The investment sub-index edged up by 1.01 percent, while manufacturing and processing increased by 0.69 percent, microfinance by 0.56 percent, and the mutual fund group by 0.06 percent. The trading and others sub-indices rose by 1.76 percent and 0.91 percent, respectively.\n\nAccording to NEPSE, Green Development Bank Limited and Khanikhola Hydropower Company saw the highest gains of the day, with their share prices climbing by 9.99 percent. On the downside, the '9% ICFC Finance Limited Debenture–2088' posted the biggest loss, falling by 3.31 percent.",
      "date": "2025-07-02",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/news/nepseupnew-1751365748.jpg",
      "read_time": "1 min read"
    },
    {
      "url": "https://kathmandupost.com/money/2025/07/02/rains-rice-planting-send-vegetable-prices-soaring",
      "title": "Rains, rice planting send vegetable prices soaring",
      "body": "With monsoon rains damaging roads and farmers getting busy in transplanting paddy, prices of most of the green vegetables in Kathmandu valley have started soaring.\n\nHighways connecting Kathmandu Valley—Tribhuvan Highway, Prithvi Highway or BP Highway—are being obstructed time and again, impacting the supply chain. The Valley receives most of its vegetable supply from its surrounding districts. Some kitchen items are imported from India.\n\nPaddy transplantation is underway in various parts of the country, but only around 16 percent of the total crop area has been planted by the end of June. This progress is shy of the 17.2 percent recorded during the same period last year, official figures show.\n\nWithin a gap of two weeks, vegetable prices have nearly doubled, according to the records with the Kalimati Fruits and Vegetable Market Development Board.\n\nThe wholesale prices of most vegetables like tomato, potato, onion, carrot, cabbage, radish, eggplant, cow pea, green pea, French bean, sword bean, soybean green, bitter gourd, pointed gourd, snake gourd, smooth gourd, sponge gourd, pumpkin, squash, okra, mushroom and chilli have gone up.\n\n“The prices are on an upward trajectory with farmers planting paddy on vegetable fields, resulting in dwindling supplies. High temperatures and rain lead vegetables to decay quickly. As a result, prices have rocketed,” said Binay Shrestha, information officer at the Kalimati Fruits and Vegetable Market Development Board.\n\nThe highways had not been disrupted for a long time. This blockage makes vegetable supply fluctuate, Shrestha said.\n\nWith the major festivals approaching, Shrestha predicted that prices of vegetables will shoot up until the end of the festive season in October.\n\nAccording to the Nepal Rastra Bank, the year-on-year consumer price inflation stood at 2.77 percent in mid-May, compared to 4.40 percent a year ago. Food and beverage inflation stood at 1.52 percent whereas non-food and service inflation remained 3.45 percent in the review month.\n\nThe inflation on vegetable prices declined by 8.11 percent during the review period.\n\nTomato small (tunnel) wholesale price has increased by 8.67 percent to Rs42.60 per kg. In retail, tomatoes are priced at Rs90 to Rs100 per kg.\n\nPotatoes red, Indian and Mude have also increased by 5.45 percent, 11.76 percent and 2.70 percent, respectively. Potato red now costs Rs42.60 per kg, Potato red (Indian) is priced at Rs38 a kg and Potato red (Mude) Rs38. In retail, these varieties sell between Rs65 and Rs70 a kilo.\n\nOnion wholesale price has grown 16.50 percent to Rs48 per kg. In retail, onion prices range from Rs65 to Rs70 per kg.\n\nThe wholesale price of eggplant has jumped 46.07 percent to Rs26 per kg in a span of two weeks. Eggplant sells for Rs75 to Rs80 per kg in retail.\n\nCowpea long and short wholesale prices have increased by 45.83 per and 63.04 percent to Rs35 per and Rs75 per kg, respectively.\n\nThe wholesale price of green peas has gone up 18.03 percent to Rs180 per kg.\n\nThe price of French beans (local) has jumped 18.03 percent to Rs48 per kg in wholesale. The retail price ranges from Rs70 to Rs80 per kg. The wholesale price of French beans (hybrid) has risen 53.60 percent to Rs48 per kg.\n\nSword bean price has jumped 47.06 percent to Rs75 per kg.\n\nThe wholesale price of soybean green went 17.02 percent up to Rs110 per kg. Seasonal soybean green is priced between Rs160 and Rs170 per kg retail.\n\nBitter gourd price grew 18.26 percent to Rs34 per kg wholesale at the Kalimati market. In retail, bitter guard prices range from Rs70 to Rs80 per kg.\n\nBottle gourd prices increased by 82.35 percent to Rs31 per kg. The vegetable is priced at Rs70 to Rs80 per kg in the retail market. The wholesale price of smooth gourd jumped 46.88 percent to Rs47 per kg.",
      "date": "2025-07-02",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/money/PaddyFeildsandCultivation06192025473copy-1751423875.jpg",
      "read_time": "3 min read"
    },
    {
      "url": "https://kathmandupost.com/money/2025/07/01/nepse-climbs-nearly-29-points-as-turnover-crosses-rs7-billion",
      "title": "NEPSE climbs nearly 29 points as turnover crosses Rs7 billion",
      "body": "The Nepal Stock Exchange (NEPSE) index extended its upward momentum on Tuesday, gaining 28.91 points to close at 2,660.39. This marks a 1.09 percent rise from the previous trading day and the third consecutive session of growth.\n\nInvestor activity remained strong, with 70,214 transactions carried out involving 15,764,001 shares. The total turnover reached Rs7.03 billion, up from Monday’s Rs6.38 billion, indicating renewed investor interest.\n\nOut of the traded companies, 217 recorded gains while only 31 saw a decline, highlighting a bullish market sentiment.",
      "date": "2025-07-01",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/news/nepseupnew-1751365748.jpg",
      "read_time": "1 min read"
    },
    {
      "url": "https://kathmandupost.com/money/2025/07/01/bagmati-slows-ride-hailing-rules-after-gandaki-backlash",
      "title": "Bagmati slows ride-hailing rules after Gandaki backlash",
      "body": "Bagmati province is delaying the legalisation of ride-hailing services, fearing a backlash similar to last month’s protests by transport operators in Gandaki province after the rollout of the guidelines there.\n\n“We submitted the draft guidelines to the Finance Ministry of the federal government about a month and a half ago, but it is still awaiting discussion,” said Birendradev Bharati, secretary at the Bagmati provincial Ministry of Labour, Employment and Transport.\n\nOnce approved by the Finance Ministry, the draft will be forwarded to the Law Ministry and then submitted to the provincial cabinet for final approval.\n\n“The process has slowed after the Gandaki province's guidelines faced strong resistance from transport operators,” he said. “If transport entrepreneurs also protest here, implementing the rule will be futile. We hope the federal government will take the lead and provide a clear way forward.”\n\nGandaki became the first province to enforce guidelines to regulate ride-hailing companies on May 13, becoming the first province to do so. However, the move sparked uproar, particularly after allowing vehicles with private number plates, especially motorbikes, to operate as public transport.\n\nThe Federation of Nepalese National Transport Entrepreneurs and several transport labour unions strongly opposed the guidelines, arguing that the new rules contradicted the Motor Vehicles and Transport Management Act of 1993.\n\nThey staged protests, including a nationwide suspension of both long- and short-route public transport.\n\nPublic transportation in Gandaki province stopped on May 30, after the guidelines were published in the provincial gazette on May 15. Transport entrepreneurs claimed that allowing red-plated private vehicles to operate commercially undermined their investments and violated national transport law.\n\nFollowing intense pressure, the Gandaki provincial government suspended the implementation of the guidelines on June 3 for one month after a formal request from the federal government.\n\nProvincial officials argue that the new guidelines promote oversight, taxation, and commuter safety in the growing digital transport sector, critics say the delay could empower syndicates that have long resisted competition from app-based services.\n\nMany citizens took to social media to condemn the protests by transport entrepreneurs, accusing them of monopolistic practices and expressing how ride-hailing apps had made commuting far more convenient.\n\nThrough these apps, users can book, track, and pay for rides via smartphones, which has helped navigate Kathmandu’s notoriously congested streets.\n\nApp-based ride-hailing has dramatically transformed urban transportation in Nepal, especially in the Kathmandu Valley. Motorbike ride-hailing services, in particular, have become a major source of employment for young people.\n\nAdding fuel to the controversy, the Supreme Court issued an interim order last Tuesday preventing the Gandaki Provincial government from suspending the guidelines.\n\nA division bench of justices Til Prasad Shrestha and Mahesh Sharma Poudel ruled in response to a writ challenging the provincial government’s June 3 decision to pause enforcement.\n\nThe ride-hailing debate intensified after the Auditor General’s 61st annual report raised concerns about using private vehicles for commercial purposes.\n\nThe report pointed to a lack of registration with the Department of Transport Management, potential tax evasion, and inadequate sector regulations.\n\nNepal’s Motor Vehicles and Transport Management Act (1993) prohibits using private vehicles for commercial transport, creating legal complications around tax collection and enforcement for ride-hailing companies, many of which currently operate in a legal grey area.\n\nThis regulatory vacuum has raised broader concerns about fair competition, rider safety, and labour protections for gig workers in the rapidly expanding digital economy.\n\nThe proposed guidelines in Bagmati province aim to formalise and regulate ride-hailing services operating through mobile apps. Companies must register with the provincial government concerned, maintain a local office, ensure passenger safety, and comply with regulated fare structures.\n\nIn February 2023, the federal government amended the Industrial Enterprises Act (2020), officially recognising ride-hailing as a legal, service-oriented business seven years after such services began operating in Nepal.\n\nIn January 2024, the Supreme Court directed the government to expedite legislation to regulate ride-hailing platforms, citing the sector’s rapid growth and lack of oversight.\n\nFollowing the Supreme Court’s directive, Gandaki province officially became the first to legalise ride-hailing.\n\nUnder Gandaki’s new rules, unregistered ride-hailing and vehicle rental service operators face a fine of Rs100,000.\n\nCompanies offering two-wheeler ride-sharing or rental services must pay an approval fee of Rs25,000 and an annual renewal charge of Rs12,500. For four-wheelers, the fees rise to Rs50,000 and Rs25,000, respectively.\n\nInterestingly, while the guidelines set out these registration and approval fees, they do not yet specify fare rates for ride-sharing or rental services.\n\nTo register with a ride-hailing company, a two-wheeler owner must pay Rs500, while a four-wheeler owner pays Rs2,000. The companies must submit Rs5,000 for each two-wheeler and Rs20,000 for each four-wheeler as a service charge to the transportation office.\n\nAlthough vehicle owners are exempt from annual renewal charges, ride-sharing companies can collect a service fee of up to 12 percent per transaction from affiliated riders or drivers.\n\nThe Gandaki guidelines also impose operational limits. Registered vehicles may not operate beyond a 20-kilometre radius, and riders may not work more than 12 hours a day.\n\nThe guidelines prohibit giving rides to passengers accompanied by children under 10 or the elderly.\n\nAdditionally, riders must have held a driver’s licence for at least a year to be eligible for registration. In compliance with existing laws, all registered vehicles must carry third-party insurance and coverage for the rider and passengers.\n\nNepal's ride-sharing saga began making legal headlines in 2019 when advocate Shyam Kumar Shrestha filed a petition to cancel Pathao Nepal’s registration.\n\nThe Supreme Court refused to issue a stay order and dismissed the petition on June 27, 2019.\n\nThe full text of the verdict was only released in April 2025.\n\nWithout proper guidelines, many consumers continue to face problems such as price gouging and safety issues, with no established mechanism to address their grievances.\n\nAs the debate continues, the federal and provincial governments are under pressure to balance promoting innovation in transport and upholding existing laws and investments in public transport infrastructure.",
      "date": "2025-07-01",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/shutterstock515156239-1751336622.jpg",
      "read_time": "4 min read"
    },
    {
      "url": "https://kathmandupost.com/money/2025/07/01/btl-enters-nepal-market-with-limbic-advertising-as-strategic-partner",
      "title": "BTL enters Nepal market with Limbic Advertising as strategic partner",
      "body": "BTL, a rapidly expanding Indian electronics brand under the renowned Bajaj Tubes (P) Limited group, has officially entered the Nepali market through a strategic partnership with Limbic Advertising. The two companies signed a Memorandum of Understanding (MoU) in Kathmandu to solidify their collaboration on marketing strategy, brand alignment, and market entry planning. Under the agreement, Limbic Advertising has been appointed BTL’s official brand consulting and advertising partner in Nepal. The partnership aims to introduce BTL’s diverse range of innovative home appliances to Nepali households with a strong focus on market positioning and brand visibility. “We aim to ensure that BTL’s innovative product range reaches every Nepali household with strong brand positioning and impactful visibility. We trusted Limbic for their strategic and insight-driven approach,” said Naveen Bajaj, CEO and Director of Bajaj Tubes Limited. Limbic Advertising will oversee the brand’s local launch, spearheading efforts in strategic positioning, multi-platform advertising campaigns, influencer collaborations, in-store branding, and comprehensive brand consultation. “Being directly trusted by such a reputed Indian group is both an opportunity and a responsibility for us,” said Pragya Sharma, Managing Director of Limbic. “To help consumers understand the product's true value, we will deploy a balanced approach of strategy and creativity. We’re thrilled to deliver standout campaigns—thanks to their clear input and the creative freedom they’ve given us.”",
      "date": "2025-07-01",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/BTL-1751339356.jpg",
      "read_time": "1 min read"
    },
    {
      "url": "https://kathmandupost.com/money/2025/07/01/aloft-kathmandu-thamel-earns-waste-smart-certificate",
      "title": "Aloft Kathmandu Thamel earns Waste Smart certificate",
      "body": "\n\nAloft Kathmandu Thamel has been awarded the prestigious Waste Smart Certificate by Creasion Ventures Inc., in collaboration with Creasion Nepal. This award recognises the hotel’s outstanding commitment to sustainability through structured plastic waste recycling and inclusive livelihood initiatives. This accolade comes shortly after the hotel signed a Memorandum of Understanding (MoU) with Navish Nepal Pvt. Ltd., alongside Creasion Ventures, to implement a systematic plastic waste collection and recycling program. Under the initiative, plastics and bottles are collected regularly and recycled responsibly, per national environmental standards and global best practices. “This collaboration reflects our belief that environmental responsibility is a core pillar of hospitality, especially under Marriott International’s Serve 360 initiative,” said Vikram Singh, General Manager of Aloft Kathmandu Thamel. “We are proud to take the lead in setting new sustainability standards in Nepal.”",
      "date": "2025-07-01",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/GMSirRecyclyingimage-1751339698.jpg",
      "read_time": "1 min read"
    },
    {
      "url": "https://kathmandupost.com/money/2025/06/30/nepse-posts-modest-gain-on-monday",
      "title": "NEPSE posts modest gain on Monday",
      "body": "The Nepal Stock Exchange (NEPSE) index posted a modest rise on Monday, increasing by 9.19 points to close at 2,631.48, marking a 0.35 percent gain from the previous session.\n\nMarket activity remained moderate, with investors executing 63,371 transactions involving 14,172,525 shares, resulting in a total turnover of approximately Rs6.39 billion.\n\nOf the listed companies, 145 saw gains, while 103 recorded losses, reflecting a balanced yet cautious sentiment among investors.\n\nAmong the 13 sub-indices, sectors such as finance, hotel and tourism, hydropower, and others closed in the red. In contrast, manufacturing and processing, life insurance, and non-life insurance posted gains.\n\nRapti Hydro and General Construction, Dhaulagiri Microfinance, and Wean Nepal Laghubitta each surged by over 9 percent, emerging as the day’s top performers.\n\nOn the losing end, Panchakanya Mai Hydropower declined by 4.92 percent, followed by Green Development Bank at 4.65 percent, and People’s Hydropower Company at 3.75 percent.",
      "date": "2025-06-30",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/money/nepseupnew-1751191787.jpg",
      "read_time": "1 min read"
    },
    {
      "url": "https://kathmandupost.com/money/2025/06/30/upper-tamakoshi-project-resumes-full-power-generation",
      "title": "Upper Tamakoshi project resumes full power generation",
      "body": "Nepal’s largest hydropower plant, the 456-megawatt Upper Tamakoshi project, has resumed round-the-clock electricity generation at full capacity after partial restoration of infrastructure damaged by a landslide and floods last September.\n\nAccording to the project officials, the plant is now producing at its full capacity around the clock.\n\nIn late September last year, a landslide struck above the area housing the desander ponds—the structures to remove sand and silt—an underground culvert, and a control room, causing significant damage to key infrastructure.\n\nAs a result, electricity generation was suspended for three months.\n\nBy mid-January, the left desander pond had been repaired, and the plant resumed electricity production partially by opening all the dam gates and operating on a run-of-the-river basis.\n\nPurna Gopal Ranjit, project chief, said the partial repair of the right-side desander has allowed the dam to store water, enabling the hydropower station to operate at full capacity.\n\nLast Thursday, the Upper Tamakoshi Hydropower Plant started putting out 456 megawatts, said Ranjit.\n\nHe added that while full reconstruction is incomplete, partial operation of both desanders during the three-month monsoon period will help reduce losses.\n\nFull reconstruction of the desanders is expected to take another 45 days.\n\n“If we had waited another month and a half for full repairs, the company would have incurred even greater losses. So, we opted to proceed with partial readiness to begin full-capacity generation,” Ranjit said.\n\n“Repairs of the underground tunnel damaged by the landslide have been completed, and now that the dam is storing water, the plant will continue generating 456 megawatts around the clock until at least October.”\n\nConsidering the current monsoon season, Ranjit also said the plant is monitoring flooding conditions carefully during operations.\n\nThe hydropower plant is designed for a water discharge of 66 cubic metres per second.\n\nHowever, during last September's heavy and continuous rainfall, the Tamakoshi river’s flow reached up to 461 cusec at the dam site.\n\nUnder the Power Purchase Agreement (PPA) with the Nepal Electricity Authority, the plant must shut down if water flow exceeds 250 cubic metres per second.\n\nRepairs to the damaged underground tunnel have already been completed.\n\nConstruction of the plant’s new electricity control room is ongoing. The previous control room was destroyed in the landslide, killing two employees and two army personnel stationed there.\n\nThe heavy rainfall in September last year triggered floods and landslides in most parts of the country, causing a loss of Rs46.68 billion to Nepal's economy.\n\nThe government reported that the flood significantly damaged Nepal's hydropower sector, with 11 operational projects, including Upper Tamakoshi, experiencing damage.\n\nFollowing the disaster, the Upper Tamakoshi project filed an insurance claim for Rs1.8 billion to cover damages to civil, electromechanical, electrical, and hydro equipment. The plant can produce Rs40 million worth of electricity daily.\n\nThe Upper Tamakoshi project has proven crucial in managing national electricity demands during winter by supplying power as needed. During the dry season, the Nepal Electricity Authority uses the plant as a backup for load management.\n\nUpper Tamakoshi has entered a PPA with the NEA to purchase energy for its entire project capacity at predefined tariffs. The tariff for the wet season (mid-April to mid-December) is Rs3.63 per kWh, while that for the dry season is Rs6.96 per kWh.\n\nThe Upper Tamakoshi started its full-fledged commercial operation on September 10, 2021, with all six turbines operating. The project had been partially operational since August 20, 2021, with four units running.\n\nThe semi-reservoir-type project operates at full capacity during the monsoon and provides four hours of peak generation in winter.\n\nAccording to project officials, Upper Tamakoshi Hydropower Company Limited is constructing a new diversion project to bring additional water from the Rolwaling river, increasing its wintertime generation to six hours at full capacity.\n\nThis new project will generate an additional 22 megawatts of electricity. The diverted water will be funnelled into the Upper Tamakoshi dam to support continuous operations.",
      "date": "2025-06-30",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/photocourtesyofuppertamakoshiproject-1751250256.jpg",
      "read_time": "3 min read"
    },
    {
      "url": "https://kathmandupost.com/money/2025/06/30/nicci-ficci-sign-mou-to-boost-bilateral-trade-and-investment",
      "title": "NICCI, FICCI sign MoU to boost bilateral trade and investment",
      "body": "In a significant move to deepen economic cooperation between Nepal and India, the Nepal-India Chamber of Commerce and Industry (NICCI) and the Federation of Indian Chambers of Commerce and Industry (FICCI) have signed a Memorandum of Understanding (MoU) to jointly promote trade, investment, and cross-border business engagement.\n\nAccording to a statement issued by the NICCI, the agreement, signed in New Delhi by NICCI President Sunil KC and FICCI Director General Jyoti Vij, aims to institutionalise cooperation between the two apex industry bodies by exchanging business delegations, sharing information, and holding joint promotional events.\n\nUnder the terms of the MoU, both organisations have agreed to facilitate reciprocal participation of business representatives in trade missions, investment forums, fairs, and exhibitions held in each country.\n\nAccording to the understanding, NICCI will remain a Nepal partner for FICCI in Nepal, and FICCI will remain an exclusive Indian partner for India.\n\nThe two sides will also regularly share non-confidential publications and data relevant to trade and investment prospects.\n\n“We will organise at least one major joint event every year and facilitate the exchange of business delegations between Nepal and India,” said KC. “Our partnership will also include joint studies, market surveys, and publication exchanges focused on identifying emerging areas of mutual economic interest.”\n\nJyoti Vij, director general of FICCI, emphasised the responsibility of both institutions to foster closer economic ties. “As leading business organisations in our respective countries, both FICCI and NICCI are committed to strengthening the trade and investment relationship between India and Nepal,” she said.\n\nFounded in 1927 on Mahatma Gandhi's advice, FICCI is India’s oldest and most influential business federation. Headquartered in New Delhi, it represents over 250,000 companies across the public and private sectors and promotes policy reforms, economic growth, innovation, and investment.",
      "date": "2025-06-30",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/tyujk-1751250699.jpg",
      "read_time": "1 min read"
    },
    {
      "url": "https://kathmandupost.com/money/2025/06/30/skywalk-kathmandu-enters-third-year-of-operation-1751250955",
      "title": "Skywalk Kathmandu enters third year of operation",
      "body": "Skywalk Kathmandu, an urban attraction located in Kamaladi, has entered its third year of operation. Managed by Wonders Nepal Pvt Ltd, the tower is known for its views of the Kathmandu Valley.\n\nTo mark the anniversary, the company is offering a complimentary mug with a visitor’s photograph for every full-priced ticket purchased without a discount. The promotion will run for three months, according to company chairman Tej Bahadur Singh.\n\nBuilt on 13 ropanis of land, the 78.5-metre-high tower features a glass-floored platform on the 25th floor. The structure includes two lifts, each with the capacity to carry 45 people at a time. The upper deck can accommodate up to 500 visitors.\n\nAccording to managing director Bishnuhari Pandey, the tower offers a 360-degree view of Kathmandu and is 16 metres taller than the historic Dharahara. Entry remains free for senior citizens over 80 and children under three feet in height.",
      "date": "2025-06-30",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/unnamed-1751202061.jpg",
      "read_time": "1 min read"
    }
  ],
  "health": [
    {
      "url": "https://kathmandupost.com/health/2025/07/07/doctors-announce-protest-over-consumer-court-verdicts",
      "title": "Doctors announce protest over Consumer Court verdicts",
      "body": "Once again, thousands of ailing people from across the country will be deprived of treatment on Monday, with the Nepal Medical Association, the umbrella body of medical doctors, announcing a boycott of non-emergency services.\n\nThis time, the protest is against the Consumer Court’s recent verdicts, which slapped heavy penalties on doctors found guilty of gross negligence in treatments that resulted in serious complications and patient death.\n\nThis is the second time in two months that the association has called for a complete halt to non-emergency services at health facilities across the country. Earlier, in the last week of April, the association had instructed its member doctors to shun services to put pressure on private medical colleges to provide stipends on par with those offered by government-owned colleges.\n\nOn Sunday morning, the agitating doctors held one-hour sit-ins on hospital premises to show their disagreement with the Consumer Court’s verdicts.\n\nAs a symbolic protest, the association plans to collect photocopies of the Nepal Medical Council licence from its members on Monday, which will be returned to the Council’s office bearers on Tuesday.\n\n“The situation has escalated in such a dramatic way that we can no longer continue our work smoothly,” said Dr Anil Bikram Karki, president of the association. “Doctors cannot pay millions of rupees in fines for trying to save lives, and our experience shows that authorities do not listen unless we resort to stern protests.”\n\nKarki and other association members had earlier met Prime Minister KP Sharma Oli and urged him to amend some provisions of the National Penal Code Act-2017 and the Consumer Protection Act-2018. “The prime minister had assured us to sort out the issue soon,” Karki said.\n\nAccording to Karki, his association was forced to start a new protest programme because the Consumer Court continues to issue verdicts against hospitals and doctors.\n\nIn its recent verdicts, the court imposed heavy penalties on three private hospitals—Rs 5.68 million on the Chabahil-based Om Hospital (8 percent to the hospital and 20 percent to the doctors involved); Rs 5.7 million on Grande City Clinic (Rs 4 million to the doctors and Rs 1.7 million to hospital); and Rs 14.5 million on Himal Hospital (70 percent to the doctor and 30 percent to hospital).\n\n“Halting hospital services and depriving ailing patients of treatment has become a major tool for the association to put pressure on the government to meet its demands,” said Jyoti Baniya, chairman of the Forum for the Protection of Consumer Rights-Nepal. “Without knowing what the Consumer Court’s verdicts actually say, the NMA and its member doctors are again depriving patients of treatment, which in itself is a serious crime.”\n\nDepriving patients of treatment is against their constitutional right. As per the National Penal (Code) Act 2017, it can lead to imprisonment for up to three years or a fine of Rs 30,000.\n\n“The details of the verdicts are yet to be made public, and they have already started punishing patients,” said Baniya. “Courts have long been issuing verdicts in cases of gross negligence and have also slapped fines against those found guilty.”\n\nConsumer rights activists said that there is a serious case in the Consumer Court against the NMA General Secretary’s wife, also a doctor. They alleged that the association’s current protest aims to influence that case.\n\nExperts, as well as former office bearers of the Nepal Medical Council, say boycotting treatment to protest against court verdicts cannot be justified under any circumstances.\n\n“Patients and their relatives have the right to seek legal remedies if they feel they or their patients have been harmed due to medical negligence,” said a former office bearer of the Nepal Medical Council, asking not to be named, as he too is a doctor and the association is protesting. “The council’s investigations have shown sheer negligence by doctors, and actions have been taken.”\n\nHe added that doctors also have the right to challenge the Consumer Court’s verdicts in the High Court and the Supreme Court.\n\n“Not all doctors are equally competent, and no doctor can guarantee there will be no negligence from their fellow doctors,” said another former council member. “Are we again encouraging the public to take the law into their own hands by depriving them of the right to go to court?”",
      "date": "2025-07-07",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/thumb4-1751849482.jpg",
      "read_time": "3 min read"
    },
    {
      "url": "https://kathmandupost.com/health/2025/07/04/monsoon-brings-cholera-to-kathmandu-valley",
      "title": "Monsoon brings cholera to Kathmandu Valley",
      "body": "Weeks after the monsoon spread across the country, the Epidemiology and Disease Control Division has said that several cases of cholera infection have been reported from various parts of the country, including the Kathmandu Valley.\n\nOfficials said some diarrheal patients tested positive for cholera in rapid diagnostic tests, while stool samples of a few patients came positive in the stool culture in the laboratories.\n\n“Yes, cases of cholera infection are now being reported from a few places, including the Kathmandu Valley,” said Dr Chandra Bhal Jha, director at the division. “Some diarrhoeal patients have tested positive in rapid diagnostic tests, while some have been confirmed cholera-positive in lab tests.”\n\nCholera is a highly infectious disease that causes severe diarrhoea and vomiting, which can lead to dehydration and death within a few hours if left untreated.\n\nHealth officials said the Vibrio cholera 01 Ogawa serotype has been confirmed in the stool sample of infected patients.\n\nOutbreaks of cholera and other water-borne diseases during the monsoon season is not new in Nepal, as thousands of people get infected every year.\n\nLast year, at least 95 cases of cholera infection were confirmed in Kathmandu, Lalitpur, Kailali, Pyuthan, Makawanpur, Rolpa, Sindhupalchok, Achham, and Rautahat districts.\n\nKathmandu, Lalitpur, and Bhaktapur often witness cholera outbreaks during the monsoon season, with hundreds of people suffering from diarrhoeal infections that continue for months.\n\nPublic health experts say that due to poor sanitation and hygiene, the country remains highly vulnerable to waterborne diseases, including diarrhoea, dysentery, typhoid, hepatitis, and cholera.\n\nOfficials at the Ministry of Health and Population said that they have identified 30 districts, including Kathmandu, Lalitpur, and Bhaktapur as highly vulnerable to cholera outbreaks due to the poor water and sanitation conditions.\n\n“We have prepared a cholera elimination plan which includes a multisectoral approach and mass cholera vaccination,” said Jha. “The multisectoral approach includes improvement in water and sanitation, promoting hygiene, and coordinating with all stakeholders, including development partners.”\n\nPublic health experts say that the risk of waterborne diseases, including cholera, will not lessen until and unless the country's water and sanitation conditions improve, and people are ensured safe drinking water. Several other factors, including the condition of water storage, supply pipes, and pollution in water sources, also impact the quality of water supplied to households.\n\nMeanwhile, the Kathmandu Metropolitan City has launched an awareness drive against cholera infection.\n\n“We have launched an awareness drive against waterborne diseases including cholera in all 32 wards of the metropolis,” said Deepak Kumar KC, chief of the health department of the metropolis. “We have asked people to make sure their drinking water is safe and wash hands before eating.”\n\nA study carried out by the Health Ministry following an outbreak of cholera last year showed that nearly 70 percent of drinking water samples in Kathmandu Valley werecontaminatedwith E coli and faecal coliform.\n\nDoctors say a combination of surveillance; improvements in water, sanitation and hygiene; social mobilisation; and treatment is necessary for curbing the spread of infection.\n\nThe World Health Organisation says cholera isa global threat to public health, and a multifaceted approach is key to controlling the disease and reducing deaths.",
      "date": "2025-07-04",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/thumb4-1751631395.jpg",
      "read_time": "2 min read"
    },
    {
      "url": "https://kathmandupost.com/health/2025/07/04/nepal-fears-over-60-000-people-could-get-infected-with-dengue-in-next-three-months",
      "title": "Nepal fears over 60,000 people could get infected with dengue in next three months",
      "body": "The number of dengue-infected patients visiting hospitals in the Kathmandu Valley has been gradually rising recently, and this could be just the beginning.\n\nExperts warn that a sharp spike in cases is likely once the ongoing rainfall stops for a few days.\n\nIn the worst-case scenario, over 60,000 people could get infected with the dengue virus in the next three months, according to a projection prepared by the Epidemiology and Disease Control Division.\n\nThe division, which is responsible for the epidemic and outbreak control in the country, said that the figure is just an estimate, which is made for the preparation for possible worst-case scenarios.\n\n“Every year, we made a projection of the worst-case scenario, which is required for internal preparedness,” said Dr Chandra Bhal Jha, director at the division. “Our projection does not mean the estimated number of people will be infected with the deadly virus. The infection number depends on the measures we take to lessen the risks.”\n\nDengue is a viral disease transmitted by femaleAedes aegyptiandAedes albopictusmosquitoes. According to the World Health Organisation, the same vector also transmits chikungunya, yellow fever, and the Zika virus.\n\nSince January, 1,673 people from 73 districts have tested positive for the dengue virus. The deadly virus has not yet been reported in four out of 21 mountain districts—Rasuwa of Bagmati province, Manang of Gandaki province, and Humla and Dolpa of Karnali province.\n\nIn 2024, 15 people died, and 41,865 others were infected as the virus spread to 76 districts. In 2023, 88 persons died and more than 54,000 were infected by the virus, which had spread to all 77 districts. At the time, hospitals in Kathmandu Valley were overwhelmed with dengue patients, and pharmacies had run out of paracetamol, the most widely used medicine to treat fever.\n\nExperts say reported cases may represent only a small fraction of the true scale of infection, as around 90 percent of the infected people are asymptomatic, and many deaths and infections often go unreported.\n\nMany people infected with dengue show mild symptoms, which do not need any treatment or can be managed with paracetamol at home.\n\nSince dengue became endemic in Nepal years ago, meaning people get infected throughout the year, health officials no longer classify it as an outbreak of a deadly virus.\n\nOfficials at the division said that they have alerted all concerned health agencies about the looming crisis, supplied testing kits, and allocated a budget to carry out a dengue search-and-destroy drive.\n\n“We have already sent Rs 80 million to local levels to carry out the dengue search and destroy drive,”said Jha. “Health workers and health facilities are asked for necessary preparation as the disease could break out at any time. We have also requested help from other sectors and the general public to destroy dengue breeding grounds. ”\n\nOfficials say an outbreak could occur in any place at any time, as most districts across the country have reported dengue cases.\n\nExperts say that instead of counting the number of infected people, concerned authorities must focus on implementing mitigating measures.\n\nExperts warn that the rising temperatures, coupled with monsoon rainfall, create the perfect environment for dengue-spreading vectors to breed. They say that unless the general public is made aware of the problem and takes it seriously, the spread of the dengue virus will not lessen. They asked the authorities concerned to learn from past experiences while taking preventive measures.\n\n“Focus should be made on behavioural change, which needs continuous efforts and investments,” said Dr Sher Bahadur Pun, chief of the Clinical Research Unit at Sukraraj Tropical and Infectious Disease Hospital. “Breeding grounds of dengue-spreading mosquitoes could be anywhere, including schools, hospitals, private houses and others, and without the participation of the general public in dengue control efforts, we cannot expect control of infection of the deadly disease.”\n\nDoctors say along with launching a search-and-destroy drive on a regular basis, authorities should also focus on strengthening the capacity of health facilities to prevent them from being overwhelmed in the event of a possible massive outbreak, experts say.\n\nDengue-transmitting mosquitoes breed in clean water and bite people in daylight. Uncovered water tanks and discarded objects such as plastic cups and bottles could be breeding grounds for dengue-carrying mosquitoes.\n\nAccording to doctors, mild to high fever, severe muscle pain, rashes, severe headache and pain in the eyes are some symptoms of dengue. Doctors advise those with these symptoms to seek immediate treatment. While there is no specific cure for the disease, early detection and access to proper medical care can lower fatalities.\n\nNepal reported its first dengue case in a foreigner in 2004 in Chitwan district. Since then, an increasing number of dengue infections, including major outbreaks, have been reported from many districts.\n\nThe World Health Organisation says there is no specific cure for severe dengue, but early detection and access to proper medical care can save lives.",
      "date": "2025-07-04",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/imgi1thumb-1751594618.jpg",
      "read_time": "4 min read"
    },
    {
      "url": "https://kathmandupost.com/health/2025/07/02/nepal-mulls-covid-vaccine-for-the-immunocompromised",
      "title": "Nepal mulls Covid vaccine for the immunocompromised",
      "body": "Amid a surge in Covid cases in various parts of the country, health authorities are considering administering Covid booster shots to people with underlying health conditions.\n\nAccording to officials at the Epidemiology and Disease Control Division, discussions are underway with stakeholders about vaccinating vulnerable groups.\n\n“We held discussions with the National Immunisation Advisory Committee and other stakeholders about administering the Covid-19 vaccine to elderly people and others with compromised immunity,” said Dr Chandra Bhal Jha, director at the division. “We have around 600,000 doses of the Covid vaccine in stock, which can be administered as booster shots to highly vulnerable groups.”\n\nCurrently, the Covid vaccine is being administered at the Sukraraj Tropical and Infectious Disease Hospital in Teku, Kathmandu.\n\nOf late, Covid cases have been surging in many districts across the country. The country reported a Covid death last Tuesday, the first in over two years, which indicates that new variants of the coronavirus are once again spreading in communities and taking a toll.\n\nAt least 221 cases of infection have been reported since January.\n\nAccording to data provided by the division, all seven provinces in the country have reported cases of coronavirus infection. Bagmati province has reported 170 cases, the highest number in the country, followed by Sudurpaschim 21 cases, Koshi 12 cases, Madhesh 8, Lumbini 5, Gandaki 4, and Karnali one case.\n\nThe Ministry of Health and Population confirmed the spread of multiple subvariants of the Omicron strain of the coronavirus.\n\nOf the 14 swab samples from Covid-infected persons on which whole-genome sequencing was carried out recently, Omicron subvariants were detected in all.\n\nAccording to the National Public Health Laboratory, which carried out the genome sequencing, the subvariant XFG was confirmed in seven samples, XFG.3 in five samples, and JN.1 in two samples.\n\nOmicron’s subvariants XFG and XFG.3 are also thedominantstrains currently spreading in neighbouring India.\n\nThe NPHL said that NB.1.8.1 was not detected in any of the samples.\n\nHealth experts say that although the latest Omicron subvariants are not as deadly as earlier strains, they still pose a serious threat to the elderly and people with compromised immunity.\n\nHealth officials say that they have purchased 2,000 rapid diagnostic test kits to carry out screening in the health desks set up at international land crossings and international airports.\n\nHealth workers deployed there are tasked with screening only those individuals who show coronavirus-like symptoms—fever, cough, sore throat, among others.\n\n“We will purchase more if needed,” said Jha. “We have also requested with the World Health Organisation for testing kits.”\n\nMeanwhile, the division said that the mpox-infected Saudi Arabia returnee migrant worker has recovered fully and has been discharged from the hospital.",
      "date": "2025-07-02",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/imgi1thumb1-1751423429.jpg",
      "read_time": "2 min read"
    },
    {
      "url": "https://kathmandupost.com/health/2025/06/30/mental-health-problems-growing-among-new-mums-in-nepal",
      "title": "Mental health problems growing among new mums in Nepal",
      "body": "A few weeks ago, a 26-year-old working class mother was rushed to the Thapathali-based Paropakar Maternity and Women’s Hospital, as she suffered from persistent sadness, sleeplessness, and loss of interest in everything including her newborn.\n\nDoctors attending the patient identified that the woman was suffering from postpartum depression developed after the child birth.\n\n“We prescribed anti-depressants to the patients, as she was suffering from anxiety and depression, which are serious mental health problems,” said Dr Pratikshya Ghimire, a psychiatrist at the hospital. “The patient is recuperating now, as her family members and in-laws were supportive.”\n\nEvery day, doctors at the maternity hospital refer to over half a dozen pregnant or postnatal women seeking care at the hospital for psychiatric and psychological counseling. Of those referred, the number of working class women is significant.\n\nHowever, not all women suffering from prenatal depression (depression during pregnancy) and postpartum depression (depression after child birth) get proper treatment like the woman mentioned above, as most birthing centers throughout the country lack mental health screening services.\n\n“Health workers including physicians may ask pregnant and postnatal women they suspect have mental health issues for seeking psychiatric or psychological help, but all may not be able to afford,” said Ghimire. “Thousands of women would benefit if mental health services were made available in maternity hospitals.”\n\nStudies show that working mothers areat greater riskfor postpartum depression.\n\nMental health problems during pregnancy are the second leading cause of maternal deaths, after excessive bleeding during childbirth, also known as postpartum haemorrhage, and pre-eclampsia (pregnancy-related high blood pressure disorders). A report on maternal mortality unveiled in 2022 by the National Statistics Office showed that six percent of maternal deaths were due to self-harm (suicide), with most cases occurring during pregnancy.\n\nTo address mental health problems during pregnancy, the Ministry of Health and Population started outpatient care services at the Maternity Hospital in October last year with the help of the World Health Organisation.\n\nHealth Officials had planned to expand such services to at least one hospital in each province.\n\n“But due to the budget constraints, we could not expand the services this year,” said Dr Phadindra Baral, chief of the Mental Health Section at the Epidemiology and Disease Control Division. “We are aware that the service is essential and thousands of pregnant and postnatal women throughout the country will be benefitted if we provide it.”\n\nDoctors say mental health problems in pregnant women and new mothers are more severe than previously believed, with around 20 percent women affected.\n\nThey say prenatal and postnatal depression can occur at any time during pregnancy or after childbirth. Shifts in hormone levels during pregnancy and after childbirth can significantly affect mood. Many women feel anxious about changes happening to their bodies. Some may even have financial concerns and some worry about taking on new and additional responsibilities.\n\nSome women experience extreme sadness, anxiety, fatigue, and changes in sleeping and eating habits during pregnancy or after childbirth. Experts warn that prenatal and postnatal depression along with anxiety and other mental health issues, can lead some women to take their own lives.\n\nIn the case mentioned above, the woman worried excessively about her job, career, and future of the baby. She feared that she could not resume her job again, which not only increased her family’s financial troubles but also affected her career and the future of her newborn.\n\nAfter treatment, her condition is getting better every day.\n\n“We will adjust doses of her medicines in the coming days,” said Ghimire.\n\nHealth officials hope that screening pregnant women for mental health problems and providing prompt treatment will help reduce maternal deaths, which have been rising alarmingly of late.\n\nNepal reduced the maternal mortality rate from 539 per 100,000 births in 1996 to 239 per 100,000 births in 2016. For this, the country also received a Millennium Development Goals award.\n\nThe 2021 census report showed that in every 100,000 live births, 151 women died from maternity-related complications. A recent report by the UN health body shows that Nepal has reduced maternal deaths by over 70 percent since 2000. The UN health body, in its report stated that currently 142 Nepali women die from maternity-related complications per 100,0000 live births.\n\nNepal’s target under the UN’s Sustainable Development Goals is to reduce the maternal mortality rate to75 per 100,000 births by 2030.",
      "date": "2025-06-30",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/imgi1thumb-1751249248.jpg",
      "read_time": "3 min read"
    },
    {
      "url": "https://kathmandupost.com/health/2025/06/27/scrub-typhus-emerges-as-a-major-public-health-problem-in-nepal",
      "title": "Scrub typhus emerges as a major public health problem in Nepal",
      "body": "Patients with high fever and severe body aches, headache, abdominal pain, and joint and muscle pain are common in the outpatient department of Patan Hospital—and some of them have of late been testing positive for scrub typhus.\n\n“Patients infected with scrub typhus visit the outpatient department of our hospital regularly for treatment,” said Dr Samita Panta Acharya, medical director at the Patan Hospital. “The number of scrub typhus infections have risen over the years.”\n\nScrub typhus, or bush typhus, isa potentially fatal infectious diseasecaused by the parasiteOrientia tsutsugamushi, a mite-borne bacterium. Itspreadsto humans when bitten by infected chiggers (larval mites) found in mice.\n\nAlong with Patan Hospital, health facilities throughout the country have witnessed an uptick in the number of scrub typhus infections in the past few years.\n\nAccording to data provided by the Integrated Health Information Management Section under the Department of Health Services, 16,597 people across the country were infected with scrub typhus in the fiscal year 2024-25. Of the total cases of infection, Lumbini Province recorded 4,322 cases, the highest number in the country, followed by Sudurpaschim province (3,746 cases), Karnali province (2,539), Koshi province (2,119), Bagmati Province (1,838), Gandaki province (1,725) and Madhesh province (308).\n\nThe number could be higher still, as all cases of infection do not enter government records.\n\nWhat alarms health officials is that people living in urban settings are also getting infected with the deadly disease. Until a few years ago, it was believed that only those residing in rural areas or those working in grasslands or fields were at high risk.\n\n“Scrub typhus has emerged as a major public health problem in Nepal,” said Gokarna Dahal, chief of the Vector Control Section at the Epidemiology and Disease Control Division. “People residing in both rural and urban settings are getting infected.”\n\nHealth officials say some people may have died from the infection, but doctors often fail to identify scrub typhus deaths as the cause since patients suffer other complications, including multi-organ failure.\n\nNepal sawa surge in scrub typhus casesafter the calamitous 2015 earthquakes that killed nearly 9,000 persons across the country.\n\nThree months after the quakes, the BP Koirala Institute of Health Sciences, Dharan, alerted the Epidemiology and Disease Control Division about six children with unusual fevers and severe respiratory problems.\n\nSerum samples were collected for subsequent tests in Kathmandu and Bangkok, which confirmed a scrub typhus outbreak. By then, four children had already died in the course of the treatment. By the end of the year, 101 cases were confirmed in 16 districts, and four more people succumbed to the disease.\n\nThe magnitude of the outbreak escalated in 2016 when 831 cases of scrub typhus werereportedin 47 districts, and 14 people had died by the end of that year.\n\nAccording to the Ministry of Health and Population data, more than 1,026 people were infected with the disease in 2020. The number increased to 1,999 in 2021, and to more than 2,900 in 2022.\n\nIn 2023, over 5,000 people were infected.\n\nDoctors say the risk of severity and fatality can be minimised if patients are diagnosed and treated early.\n\nCommon antibiotics, such as doxycycline and azithromycin, which are on the government’s essential drugs list and distributed free to health facilities across the country, can cure the disease.\n\nHowever, what is concerning is that many health workers, including doctors, lack sufficient knowledge about diagnosing scrub typhus. Many health facilities also lack reagents to carry out tests for the disease.\n\nDoctors can diagnose the disease based on the symptoms, but the risk of misdiagnosis is high, as scrub typhus symptoms are similar to those of other illnesses.\n\nThey warn that waiting for lab results before starting treatment could be dangerous. It can take about a week to get lab results and, by that time, the patient can fall into coma and suffer multi-organ failure.\n\nDoctors point out high fever, headache, abdominal pain, backache, joint and muscle pain, red rash, nausea and vomiting as some of the symptoms of scrub typhus infection. Patients with severe illness may develop bleeding, which could lead to organ failure. The infection can lead to respiratory distress, inflammation of brain, lungs, kidney failure and then multi-organ failure. If not treated immediately, it can be fatal.",
      "date": "2025-06-27",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/WhatsAppImage20250627at63153AM-1750988907.jpg",
      "read_time": "3 min read"
    },
    {
      "url": "https://kathmandupost.com/health/2025/06/27/health-officials-seek-community-engagement-for-dengue-control",
      "title": "Health officials seek community engagement for dengue control",
      "body": "An expert team comprising entomologists was shocked to discover larvae ofAedes aegyptiandAedes albopictusmosquitoes, the primary carriers of the dengue virus, in government offices during the dengue search-and-destroy drive carried out about two years ago.\n\nThey not only found the larvae of the virus-spreading vector, but also several staffers infected with the deadly virus.\n\n“We found mosquito larvae in the stagnant water in discarded tyres, plastic glasses, flower pots and other containers,” said Professor Murari Lal Das, an entomologist at the BP Koirala Institute of Health Sciences, Dharan. “Not only in the government offices, breeding grounds of dengue-spreading mosquitoes were found in schools, hospitals, and private houses.”\n\nExperts say they have not noticed much change in public behaviour in the past two years. The only change they see is the spread of virus-spreading vectors throughout the country. They warned that without the active participation of the general public, it is impossible to contain further spread of deadly diseases.\n\n“Everyone must shoulder the responsibility of controlling the dengue infection,” said Das. “We will continuously suffer from the dengue infection if we only rely on health workers to contain the spread of the virus. It is impossible for health workers to reach every household to discard stagnant water.”\n\nDengue is a viral disease transmitted by femaleAedes aegyptiandAedes albopictusmosquitoes. According to the World Health Organisation, the same vector also transmits chikungunya, yellow fever, and the Zika virus.\n\nSo far, 1,576 people from 73 districts have tested positive for the dengue virus since January. The deadly virus has not yet been reported in four out of 21 mountainous districts—Rasuwa of Bagmati province, Manang of Gandaki province, and Humla and Dolpa of Karnali province.\n\nIn 2024, 15 people died, and 41,865 others were infected as the virus spread to 76 districts. In 2023, 88 persons died and more than 54,000 were infected by the virus, which had spread to all 77 districts. At the time, hospitals in Kathmandu Valley were overwhelmed with dengue patients, and pharmacies had run out of paracetamol, the most widely used medicine to treat fever.\n\nExperts say reported cases may represent only a small fraction of the true scale of infection, as around 90 percent of the infected people are asymptomatic, and many deaths and infections often go unreported.\n\nMany people infected with dengue show mild symptoms, which do not need any treatment or can be managed with paracetamol at home.\n\nSince dengue became endemic in Nepal years ago, meaning people get infected throughout the year, health officials no longer classify it as an outbreak of a deadly virus.\n\nEpidemiologists as well as virologists say that despite thousands of people getting infected and scores dying from the disease, authorities have failed to respond with proper measures. They believe that this lackadaisical approach is responsible for the spread.\n\nMeanwhile, officials at the Epidemiology and Disease Control Division said that they have been working to prepare a multi-year, multi-stakeholder action plan to control the growing burden of the dengue infection.\n\n“We have already held discussions with multiple stakeholders, including representatives of the Federation of Nepalese Chambers of Commerce and Industry, the Federation of Nepali Journalists, the Private and Boarding Schools’ Organisation Nepal and health workers at local governments in the Kathmandu Valley,” said Dr Gokarna Dahal, chief of the Vector Control Section at the division. “Without active community participation and public awareness, it is impossible to contain the spread of the virus.”",
      "date": "2025-06-27",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/thumb8-1751039147.jpg",
      "read_time": "2 min read"
    },
    {
      "url": "https://kathmandupost.com/health/2025/06/26/supply-delays-deprive-women-and-girls-of-iron-folic-acid",
      "title": "Supply delays deprive women and girls of iron, folic acid",
      "body": "Iron and folic acid supply to state-run health facilities will not resume before December, as the process of procuring the crucial supplements has just started, officials said.\n\nDue to a lack of such vital supplements in the state-run health facilities, hundreds of thousands of pregnant women, new mothers, and girls between 10 and 19 have been deprived of free iron and folic acid for months.\n\nThe disruption has raised concerns about the government’s failure to ensure continuous supply of the supplements critical to preventing anaemia.\n\n“We have asked provincial and local health agencies to purchase iron and folic acid on their own and distribute them to pregnant women, new mothers, and girls between 10 and 19,” said Lila Bikram Thapa, chief of Nutrition Section at the Family Welfare Division of the Department of Health Services. “It takes several months to purchase the supplements by fulfilling all due procedures.”\n\nThe free iron and folic acid supplementation programme, which was initiated to reduce the high prevalence of anaemia among adolescent girls, pregnant women, and new mothers, has stalled since February.\n\nAnaemia is a condition in which blood produces low levels of haemoglobin or healthy red blood cells. Iron and other nutritional deficiencies, malaria, infection with hookworm, chronic infections, and genetic conditions, including sickle cell diseases, are among the reasons for anaemia.\n\nDoctors say anaemia in adults can cause fatigue, lethargy, reduced physical productivity, and poor work performance. It is a major concern among pregnant women, as problems can lead to increased maternal mortality and poor birth outcomes.\n\nDoctors say anaemia during pregnancy increases multiple health risks including foetal growth retardation and low birth weight, premature delivery, increased perinatal mortality, and reduced resistance to infection for both mother and baby. The problem can impair the cognitive development of children and can have long-term health and economic implications for society.\n\nHealth ministry officials say the federal government has not purchased iron and folic acid tablets for the last two years, and has not allocated any budget for the programme. Responsibility for purchasing the supplement tablets was given to provincial government agencies, but they too have not made purchases.\n\n“We last purchased the supplement tablets around three years ago and thought that the stock would be sufficient for the ongoing fiscal year,” said Thapa. “For the fiscal year 2025-26, we have allocated Rs90 million to procure the supplements.”\n\nHealth officials say that many local units have purchased the supplements from their own resources and distributed them to target groups.\n\nEarlier, officials at the Ministry of Health and Population had requested aid agencies, including the Helen Keller International Nepal, Care Nepal, ADRA Nepal, and others, for financial support to purchase the supplement tablets for the three months of the ongoing fiscal year. However, it is not known if those agencies provide the support.\n\nNepal Demographic and Health Survey-2022 conducted by the ministry shows that 34 percent of women between the ages of 15 and 49 years were anaemic, 19 percent mildly anaemic, 15 percent moderately anaemic and one percent severely anaemic.\n\nWomen living in the Tarai region are more likely to be anaemic (45 percent) than those living in the hills (20 percent) and in the mountainous regions (23 percent). More than half the women (52 percent) are anaemic in the Madhesh Province.\n\nThe same study also divulged that 43 percent of the children aged between six and 59 months have been found to be anaemic—25 percent mildly anaemic, 18 percent moderately anaemic and one percent severely anaemic.\n\nMadhesh province had the highest child anaemia rate at 50.6 percent, followed by 48.9 percent in Lumbini, 45.4 percent in Sudurpaschim, 42.5 percent in Bagmati, 39.8 percent in Karnali, 33.9 percent in Koshi and 30.7 percent in Gandaki province.\n\nIn the 1990s, three in four pregnant women in Nepal were anaemic. To address the growing burden of anaemia and resulting health consequences, the government had initiated an iron and folic acid supplementation programme in 2003.\n\nUnder the programme, all pregnant women above four months of pregnancy and new mothers up to seven weeks postpartum were given a supplementation tablet daily. Girls between 10 and 19 were given 26 tablets a year.",
      "date": "2025-06-26",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/thumb-1750898797.jpg",
      "read_time": "3 min read"
    },
    {
      "url": "https://kathmandupost.com/health/2025/06/25/nepal-reports-first-covid-death-in-two-years",
      "title": "Nepal reports first Covid death in two years",
      "body": "Nepal on Tuesday reported a Covid death, the first in over two years. This indicates that new Omicron subvariants are once again spreading in communities and taking a toll.\n\nAccording to officials at Biratnagar-based Nobel Medical College and Teaching Hospital, a 39-year-old woman from Suryodaya Municipality, who was admitted to the hospital’s emergency department, succumbed to the infection.\n\n“The woman was brought to our hospital at 4:20 in the morning,” said Dipesh Rai, manager of the hospital. “The patient died at 6 am.”\n\nAccording to the hospital administration, the woman was brought to the hospital in a critical condition. Her relatives told doctors that the patient had been suffering from fever and respiratory problems, and had tested positive for coronavirus.\n\n“The police accompanied the patient and, after death, they [police] took the body to Ilam [the woman’s village],” said Rai.\n\nOfficials at the Epidemiology and Disease Control Division said they are aware of the latest death.\n\n“Yes, I am aware of the case,” said Dr Chandra Bhal Jha, director at the division. “We have directed officials concerned to coordinate with provincial health authorities and take stock of the situation.”\n\nThe last time the country recorded a Covid death was in April 2023.\n\nOf late, Nepal has been witnessing a surge in coronavirus cases.\n\nThe Ministry of Health and Population on Monday confirmed the spread of multiple subvariants of the Omicron variant of the coronavirus.\n\nOf the 14 swab samples of Covid-infected persons on which whole-genome sequencing was carried out recently, Omicron subvariants were detected in all.\n\nAccording to the National Public Health Laboratory, which carried out the whole genome sequencing, the subvariant XFG was confirmed in seven samples, XFG.3 in five samples, and JN.1 in two samples.\n\nThe Omicron’s subvariants XFG and XFG.3 are also thedominantstrains spreading in neighbouring India.\n\nThe NPHL said that NB.1.8.1 was not detected in any of the samples.\n\nWhole-genome sequencing isa comprehensive methodof analysing the entire DNA sequence of an organism’s genes. Researchers believe that whole-genome sequencing of the coronavirus could be instrumental in tracking the severity and properties of the virus.\n\nAccording to the Epidemiology and Disease Control Division, 180 people from 25 districts have tested positive for Covid since January. At least 25 people tested positive for the potentially deadly virus in the past week alone. The number of people testing positive in the past 24 hours stands at eight.\n\nHowever, people had been getting infected since the start of the year, as the virus had already become endemic in Nepal.\n\nHealth officials say rapid diagnostic testing is currently being carried out only on individuals with coronavirus-like symptoms—fever, cough, sore throat, among others.\n\nNo tests are being carried out on asymptomatic individuals, who may still be infected. Some may be arriving during the virus’ incubation period, but no agency in the country is tracking their movements. Health workers say they have asked infected people at border entry points to stay in isolation for five days before returning home.\n\nHealth Ministry officials also said they have started the process to buy rapid diagnostic test kits, which are in limited supply.\n\nIndia has of late reported a steady decline in the number of active cases. According tomedia reports, India’s active caseload dropped to 5,012 on Sunday, down from 5,976 on Friday.\n\nThousands of people from both countries enter each other’s territories every day on top of the large number of those who use unregulated points along the porous border.\n\nExperts say almost all variants of the coronavirus in India have found their way into Nepal. They say that even if the latest Omicron subvariants are not as deadly as other variants, the virus still poses a serious threat to the elderly and people with compromised immunity.",
      "date": "2025-06-25",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/covud-1750813862.jpg",
      "read_time": "3 min read"
    },
    {
      "url": "https://kathmandupost.com/health/2025/06/24/covid-and-dengue-cases-are-climbing-nationwide",
      "title": "Covid and dengue cases are climbing nationwide",
      "body": "With the onset of the monsoon season, health facilities across the country started reporting a surge in infectious diseases, including dengue and Covid.\n\nAccording to the Epidemiology and Disease Control Division, 180 people from 25 districts have tested positive for Covid since January. At least 25 people tested positive for the deadly virus in the past one week alone. The number of people testing positive to the virus in the last 24 hours stands at eight.\n\nData provided by the division shows that all provinces except Karnali have reported Covid.\n\nOf the 26 people who tested positive for the deadly virus in the past one week, 18 are from Bagmati province, five from Sudurpaschim, and three are from Koshi province.\n\n“Not only Covid, but also cases of dengue, diarrheal infections, food poisoning, among others, are on the rise,” said Dr Chandra Bhal Jha, director at the division. “We have stepped up surveillance measures, alerted health agencies and warned the public about growing risks.”\n\nNepal confirmed new coronavirus cases recently on June 4, when three people—two males and a female—who returned from India tested positive.\n\nHowever, people had been getting infected with the virus since the start of the year, as the virus had already become endemic in Nepal.\n\nHealth officials say that rapid diagnostic testing is being carried out only on those having coronavirus-like symptoms—fever, cough, sore throat, among others.\n\nTesting is not being carried out on asymptomatic people who might be infected. Some might have come during the incubation period, but no agency in the country tracks their movements. Health workers say they have asked the infected people to remain in isolation for five days and let them go home from the border entry points.\n\nThe Health Ministry officials also said they have started procedures to purchase rapid diagnostic test kits, which are in limited supply.\n\nIndia has reported a steady decline in the number of active cases recently. According tomedia reports, India’s active caseload dropped to 5,012 on Sunday, down from 5,976 on Friday.\n\nMeanwhile, the division’s data show that at least 1,541 people from 73 districts have tested positive for the dengue virus since January.\n\nThe deadly virus has not yet been reported in four out of 21 mountainous districts—Rasuwa of Bagmati province, Manang of Gandaki province, and Humla and Dolpa of Karnali province.\n\nBagmati has reported 371 cases of dengue infection, the highest number, followed by 299 cases in Koshi, 251 in Gandaki, 245 in Lumbini, 184 in Sudurpaschim, 32 in Karnali, and 21 cases in Madhesh province.\n\nDengue is a viral disease transmitted by femaleAedes aegyptiandAedes albopictusmosquitoes. According to the World Health Organisation, the same vector also transmits chikungunya, yellow fever, and the Zika virus.\n\nAt least 15 people died, and 41,865 others were infected in 2024 as the virus spread to 76 districts. In 2023, 88 persons died and more than 54,000 were infected by the virus, which had spread to all 77 districts. At the time, hospitals in Kathmandu Valley were overwhelmed with dengue patients, and pharmacies had run out of paracetamol, the most widely used medicine to treat fever.\n\nExperts say reported cases may represent only a small fraction of the true scale of infection, as around 90 percent of the infected people are asymptomatic, and many deaths and infections often go unreported.\n\nMany people infected with dengue show mild symptoms, which do not need any treatment or can be managed with paracetamol at home.\n\nSince dengue became endemic in Nepal years ago, meaning people get infected throughout the year, health officials no longer classify it as an outbreak of a deadly virus.\n\nEpidemiologists as well as virologists say that despite thousands of people getting infected and scores dying from the disease, authorities have failed to respond with proper measures. They believe that this lackadaisical approach is responsible for the spread.\n\nApart from coronavirus, dengue, and diarrheal diseases, infection of the mpox virus has also been reported of late. Health officials say that the health condition of the Saudi Arabia returnee migrant worker who tested positive for the disease is stable.\n\n“We have carried out testing on the people who came in close contact with the infected person, including his wife,” said Jha. “But reports of others are negative.”\n\nMonkeypox is a rare disease caused by infection with the monkeypox virus. Symptoms of mpox virus include fever, headache, swelling, body pains, exhaustion, and itchy rashes on the face, hands, and feet.\n\nAs the disease primarily spreads through close person-to-person contact, public health experts recommend self-isolation and good hygiene to avoid it.",
      "date": "2025-06-24",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/thumb-1750726551.jpg",
      "read_time": "3 min read"
    },
    {
      "url": "https://kathmandupost.com/health/2025/06/24/multiple-omicron-subvariants-responsible-for-latest-covid-surge",
      "title": "Multiple omicron subvariants responsible for latest Covid surge",
      "body": "Nepal on Monday confirmed the spread of multiple subvariants of the Omicron variant of the coronavirus.\n\nOf the 14 swab samples of Covid-infected persons on which whole-genome sequencing was carried out recently, omicron subvariants were detected in all.\n\nAccording to the National Public Health Laboratory, which carried out the whole genome sequencing, the subvariant XFG was confirmed in seven samples, XFG.3 in five samples, and JN.1 in two samples.\n\nThe omicron’s subvariants XFG and XFG.3 are also thedominantstrains spreading in neighbouring India.\n\nThe NPHL said that NB.1.8.1 was not detected in any of the samples.\n\nWhole-genome sequencing isa comprehensive methodof analysing the entire DNA sequence of an organism’s genes. Researchers believe that whole-genome sequencing of the coronavirus could be instrumental in tracking the severity and properties of the virus.\n\nNepal confirmed new coronavirus cases recently on June 4, when three people—two males and a female—who returned from India tested positive.\n\nAccording to the Epidemiology and Disease Control Division, 180 people from 25 districts have tested positive for Covid since January. At least 25 people tested positive for the deadly virus in the past one week alone. The number of people testing positive to the virus in the last 24 hours stands eight\n\nHowever, people had been getting infected with the virus since the start of the year, as the virus had already become endemic in Nepal.\n\nHealth officials say that rapid diagnostic testing is being carried out only on those having coronavirus-like symptoms—fever, cough, sore throat, among others.\n\nTesting is not being carried out on asymptomatic people who might be infected. Some might have come during the incubation period, but no agency in the country tracks their movements. Health workers say they have asked the infected people to remain in isolation for five days and let them go home from the border entry points.\n\nThe Health Ministry officials also said they have started procedures to purchase rapid diagnostic test kits, which are in limited supply.\n\nIndia has reported a steady decline in the number of active cases recently. According tomedia reports, India’s active caseload dropped to 5,012 on Sunday, down from 5,976 on Friday.\n\nThousands of people from both countries enter each other’s territories every day on top of the large number of those who use unregulated points along the porous border.\n\nExperts say almost all variants of the coronavirus outbreak in India have found their way into Nepal. They say that even if the latest omicron subvariants are not as deadly as other variants, the virus still poses a serious threat to the elderly and people with compromised immunity.",
      "date": "2025-06-24",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/thumb1-1750726662.jpg",
      "read_time": "2 min read"
    },
    {
      "url": "https://kathmandupost.com/health/2025/06/22/experts-raise-alarm-over-low-budget-for-non-communicable-diseases",
      "title": "Experts raise alarm over low budget for non-communicable diseases",
      "body": "The government has allocated Rs21.1 million to launch preventive measures against non-communicable diseases (NCDs), which account for 73 percent of the country's total deaths.\n\nAccording to the Non-communicable Disease and Mental Health Section of the Epidemiology and Disease Control Division, the allocation falls far short of the Rs35 million budget ceiling set for the upcoming fiscal year 2025-26. In comparison, around Rs47 million was allocated for mental health and NCDs in the current fiscal year.\n\n“We had planned several preventive measures against the growing burden of non-communicable diseases, but the allocated budget does not allow us to move forward,” said Dr Pomawati Thapa, chief of the section. “We cannot reduce the rising burden of non-communicable diseases without effective preventive measures.”\n\nThe burden of non-communicable diseases has risen alarmingly in recent years. The Nepal Burden of Disease 2017 report had attributed two-thirds (66 percent) of total deaths to non-communicable diseases, while the figure jumped to 71.1 percent in the 2019 report.\n\n“The Global Burden of Disease 2021 has shown that non-communicable diseases are responsible for 73 percent of total deaths, and the ratio could be even higher now,” said Dr Meghnath Dhimal, chief researcher at Nepal Health Research Council. “Despite the rising burden of non-communicable diseases, we have not invested much in preventive measures.”\n\nOfficials say that the Rs 21.1 million allocation under non-communicable diseases also has to cover mental health programmes. But this is a problem because the Supreme Court had on December 2 last year had ordered that mental health and non-communicable disease programmes should be run separately, which means additional budget is required.\n\nThe top court’s directive concerns budgetary commitment, enactment of mental health legislation, development of multidisciplinary workforces, awareness against stigma and discrimination, integration of people with mental health issues in communities, and promotion of alternative therapies, among other things.\n\nDoctors say preventive measures in the NCD and mental health include addressing risk factors, promoting healthy lifestyles, discouraging use of tobacco and alcohol, promoting a healthy diet and physical activity, managing weight, and promoting mental relaxation techniques. Studies show growing consumption of alcohol, tobacco, salt and junk food, and insufficient intake of vegetables and fruits—which leads to cardiovascular diseases.\n\nTo lessen the existing disease burden of NCD and mental health, investment should be made for behaviour change, which requires more investments, according to doctors.\n\n“Early diagnosis of ailments and timely, quality care should be ensured,” said Dr Basudev Karki, a mental health expert. “I don’t think the budget allocated for the non-communicable diseases and mental health programmes is enough to carry out preventive measures extensively.”\n\nThe government has also allocated a budget for financial relief to people having financially burdensome conditions—cardiovascular disease, cancer, renal failure, Alzheimer’s disease, Parkinson’s disease, head and spinal injury, sickle cell anaemia, and stroke.\n\nDoctors say although financial relief helps address patients’ immediate needs, it is a curative measure and does not lessen overall disease burden.\n\nPublic health experts say it is high time to focus on non-communicable diseases, as their prevalence has risen alarmingly. They said many lives could be saved if testing for non-communicable diseases were made free. Along with free testing, authorities should focus on behavioural changes—improvements in eating habits and physical exercise, among other things, experts say.\n\n“To address the existing burden of non-communicable diseases and mental health, investments should also be made in preventive measures,” said Karki.",
      "date": "2025-06-22",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/news/Budget05292025J2A9574copy-1750553367.jpg",
      "read_time": "2 min read"
    },
    {
      "url": "https://kathmandupost.com/health/2025/06/19/nepal-drops-plan-to-expand-maternal-and-perinatal-death-tracking",
      "title": "Nepal drops plan to expand maternal and perinatal death tracking",
      "body": "The Family Welfare Division under the Department of Health Services has not proposed expanding the maternal and perinatal death surveillance programme for the upcoming fiscal year citing the budget ceilings that leave no room for scaling up existing healthcare programmes.\n\nOfficials say that even if new health care programmes are designed, it is very difficult to convince officials to allocate a budget, and even if budgets are allocated, most of the time, they are later asked to scrap the programme.\n\n“We all know that budgets are made not on the basis of realistic assessment of the country’s economic health and this makes it difficult to achieve targets,” said an official in condition of anonymity, as he is not authorised to speak to the media. “When they [government] cannot release funds for crucial programmes, they ask to cancel such programmes.”\n\nMaternal and perinatal death surveillance is a key intervention for improving maternal, perinatal, and neonatal survival. Experts say such surveillance helps identify the causes of death.\n\nThe World Health Organisation said that maternal and perinatal death surveillance and response (MPDSR) is an essential quality improvement intervention, which permits the identification, notification, quantification and determination of causes and avoidability of maternal and neonatal deaths and stillbirth with the goal of orienting the measures necessary for their prevention.\n\nAccording to the UN health body, systematic analyses of overall mortality trends, as well as events and contributing factors leading to individual deaths, can identify barriers in health systems and inspire local solutions to prevent such deaths in the future.\n\n“The primary goal of MPDSR is reducing future preventable maternal mortality through a continuous action and surveillance cycle followed by the interpretation of the aggregated information on the findings, which is used for recommended actions to prevent future deaths,” says the WHO.\n\nNepal has committed to reducing maternal and neonatal deaths, but the MPDSR programme has not been implemented nationwide.\n\nSo far, the programme has been launched in only 51 districts. Officials say maternal and perinatal deaths are monitored only in the districts which have been implementing the MPDSR programme.\n\n“We were directed not to plan any new programme at the time the budget ceiling was given to us,” said Nisha Joshi, an official at the division. “We did not plan the extension of the MPDSR programme this time.”\n\nThe government has allocated Rs95.81 billion for the health sector for the upcoming fiscal year—Rs9.57 billion more than the allocation for the current fiscal year and around Rs13 billion over the ceiling set during budget preparation.\n\nOfficials say even if the budget allocation has risen, it is not for new programmes but to reimburse past dues. Maternal health experts say that without the MPDSR programme, ongoing maternal and perinatal deaths cannot be prevented effectively.\n\n“How can the ongoing deaths of mother and newborn be prevented, when health workers do not know the real cause of the deaths and complications,” said Dr Aruna Karki, a consultant gynaecologist at the Kathmandu Model Hospital. “The MPDSR programme not only explores the real causes of maternal and perinatal deaths but also helps design action plans to avoid similar cases in the future.”\n\nExcessive bleeding after childbirth, pre-eclampsia and eclampsia (pregnancy-related high blood pressure disorders) have been identified as some of the major causes of maternal deaths in Nepal. Likewise, prematurity (neonates born at less than 37 weeks' gestation), birth asphyxia (a condition in which a baby does not receive enough oxygen before, during, or directly after birth), and sepsis (organ dysfunction caused by a dysregulated host response to infection) are considered major reasons for neonatal deaths.\n\nMaternal and child health experts say unless the causes of deaths of mothers and babies are determined, it is impossible to reduce the mortality rates. This makes maternal and perinatal death surveillance extremely important, according to them.\n\nNepal has reduced maternal deaths by over 70 percent since 2000, according to a report by the World Health Organisation.\n\nThe UN health body, in its report, stated that currently 142 Nepali women die from maternity-related complications per 100,000 live births.\n\nA previous study carried out by the National Statistics Office in 2021 had shown 151 maternal deaths per 100,000 live births. Similarly, neonatal mortality now stands at 16.6 per 1,000 live births, and the stillbirth rate has decreased to 13.5 per 1,000 births.\n\nTheNepal Demographic and Health Survey-2022, carried out by the Ministry of Health and Population, showed that 21 neonates die per 1,000 live births.\n\nThe health target under the UN’s Sustainable Development Goals is to reduce the maternal mortality rate to75 for every 100,000 births by 2030.\n\nSDGs, a follow-up on the Millennium Development Goals (MDGs), aim to end poverty and hunger and all forms of inequality in the world by 2030, and Nepal has committed to meeting the goals.",
      "date": "2025-06-19",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/thumb2-1750294123.jpg",
      "read_time": "3 min read"
    },
    {
      "url": "https://kathmandupost.com/health/2025/06/18/air-pollution-is-top-cause-of-death-and-disability-in-nepal",
      "title": "Air pollution is top cause of death and disability in Nepal",
      "body": "Air pollution has emerged as the number one risk factor for death and disability in Nepal, surpassing malnutrition and tobacco use, according toa new World Bank report.\n\nThe report titled, ‘Towards Clean Air in Nepal: Benefits, Pollution Sources, and Solutions,’ unveiled on Tuesday, stated that polluted air cuts life expectancy by 3.4 years for the average Nepali and causes approximately 26,000 premature deaths annually.\n\n“Air pollution heavily contributes to various diseases: 75 percent of chronic obstructive pulmonary disease cases, 46 percent of strokes, 44 percent of ischemic heart disease, 41 percent of lower respiratory infections, 38 percent of lung cancer, 30 percent of neonatal issues like low birth weight and preterm birth, and 20 percent of diabetes,” reads the report.\n\nEconomically, the consequences are severe. “It affects labor productivity due to increased health-related absences and impaired cognition. The negative impact on the tourism industry and the aviation sector is also significant. The economic cost of poor air quality is estimated to exceed six percent of Nepal’s GDP each year,” the report says.\n\nOver the past decade, growing air pollution has emerged as a major public health problem in Nepal. Kathmandu Valley and the Tarai are Nepal’s air pollution hotspots, with no significant improvement seen over the past decade.\n\nThe main sectoral sources of air pollution in the Valley are industrial production, cooking, and mobility, and these will remain dominant over the next decade unless further action is taken, according to the report.\n\nIndustrial fuel combustion — led by boiler usage — is expected to increase significantly. Forest fires dominate during the dry months (February to May) and constitute the fourth largest local source of annual average air pollution exposure, the most relevant metric for adverse impacts on public health. Transboundary air pollution significantly impacts air quality in both Kathmandu Valley and in the Terai region.\n\nThe study shows a quarter of the pollution in the Kathmandu Valley comes from outside the Valley and more than half of that from outside of the country. Despite being surrounded by hills, the valley experiences pollution transported from regional sources, as wind patterns and atmospheric conditions carry pollutants into the area.\n\nIn the Tarai, pollution coming from across the border is even more dominant, largely driven by its geographic proximity to other countries in the Indo-Gangetic Plain Himalayan Foothills. Two thirds of PM2.5 exposure in the Tarai comes across the international borders, a region with high agriculture and industrial emissions.\n\nIf no additional measures are taken, the report warns, air pollution will worsen significantly by 2035. Under the baseline scenario, average PM2.5 concentrations will reach 52 µg/m³ in Kathmandu Valley and 42 µg/m³ in the Tarai, far above the World Health Organisation’s interim target of 35 µg/m³.\n\nThese levels would result in tens of thousands of additional premature deaths, particularly impacting children and the elderly, a further strain on the healthcare system, and a growing drag on productivity and competitiveness.\n\nWithout intervention, the economic burden is also expected to grow proportionally, the report warns, while calling for multi-sectoral and multi-regional actions.\n\nTo address the crisis, the World Bank calls for continuing the electrification of vehicle fleets, including cars, motorcycles, buses, and trucks along with stricter vehicle inspection and maintenance systems, and reducing road dust.\n\nThe report suggests that support for cleaner technology and fuel adoption in industries— including electric and pellet boilers and furnaces in small and medium enterprises—will help promote cleaner industries. Industrial facilities such as brick and cement factories also need to be supported to burn cleaner and more efficient fuels.\n\nSimilarly, supporting households to adopt cleaner and, preferably, electric cookstoves is key to cutting household sources of air pollution. Biomass-fueled stoves create both indoor and ambient air pollution.\n\nThe report also stresses the importance of forest fire prevention through fuel load management, awareness programmes, and improved response systems to reduce the frequency and intensity of forest fires.\n\nLikewise, an effective partnership with neighbouring countries is also critical. Transboundary airflows carry pollutants across borders. The Indo-Gangetic Plain and Himalayan Foothills Region share an airshed, meaning that pollutants can travel across borders, affecting air quality in multiple countries.\n\nNepal’s unique geographical location, particularly the bowl-shaped Kathmandu Valley surrounded by mountains, exacerbates the problem.\n\n“Single sector solutions are not sufficient to meet any clean air target; thus, public policy and investment need to optimise air quality actions across sectors, prioritising the most cost-effective solutions,” stated the report.\n\nExperts ask the authorities concerned to take the findings seriously and to take urgent measures to address the growing burden of air pollution.\n\nAir quality expert Bhusan Tuladhar called growing air pollution a public health crisis. “Most of us are aware of the crisis and have personally been affected. So we must act with urgency to address the problems.”\n\nDoctors say the key pollutant of concern for human health is Particulate Matter (PM) smaller than 2.5 microns (i.e. PM2.5), due to its ability to penetrate deeply into the lungs and other vital organs. They say poor air quality can have short- and long-term effects on public health.\n\nIn the short term, it can lead to pneumonia, bronchitis, conjunctivitis, skin allergy, stroke, and heart problems. In the long run, it can contribute to severe conditions like ulcers, cancer of the lungs and intestines, kidney disease, and heart complications.\n\nPast studies also show that Nepal had the world’s highest age-standardised death rates for chronic lung disease caused by air pollution in 2019—182.5 per 100,000 population—with 3318.4 years lost due to ill health or disability.\n\nAccording to a past study carried out by the Nepal Health Research Council, the prevalence of COPD surpassed all non-communicable diseases—coronary artery disease, diabetes, and kidney disease—in the country. The problem was responsible for 16.3 percent of the total deaths in 2019, an increase from 6.1 percent in 1990.",
      "date": "2025-06-18",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/main1743569434-1750207232.jpg",
      "read_time": "4 min read"
    },
    {
      "url": "https://kathmandupost.com/health/2025/06/16/drink-only-boiled-water-during-monsoon-doctors-advise",
      "title": "Drink only boiled water during monsoon, doctors advise",
      "body": "As most sources of drinking water have been contaminated by rainwater, health workers have urged the public to boil water properly before drinking.\n\nThey said that even commercially purified jar water is not entirely safe to drink directly, as recent tests found the presence of deadly microbes—faecal coliform and E. coli—in samples tested recently.\n\n“We urge everyone to ensure that water is safe before drinking,” said Deepak KC, chief of the Health Department under the Kathmandu Metropolitan City. “A recent test showed the presence of E. coli and faecal coliform in the samples of jar water supplied to our office.”\n\nFaecal coliform and E. coli are microscopic organisms found in the intestines of warm-blooded animals or their faeces. Bottled water is widely used by households and offices in the Kathmandu Valley and is generally considered safe. However, every year, tests have been showing the presence of dangerous microbes in bottled water, too, which means not all jar water brands are safe to drink without treatment.\n\nOfficials at the department said that the test was carried out in the National Public Health Laboratory, the central lab of the health ministry. Following the results, the city office fined the water supplier company Rs200,000.\n\nDuring the monsoon, health agencies in the Kathmandu valley routinely test drinking water from various sources. These include public taps, jar water, water supplied by the state utility, tanker water, tube well water, water from wells, and water from the Melamchi river, which is a major source of water for the state utility.\n\n“We have also planned to conduct testing of drinking water samples and have made the necessary preparations,” said Basanta Adhikari, chief of the Health Office, Kathmandu. “We are also working to launch water and sanitation programmes in some local units in the district [Kathmandu].”\n\nDoctors say this is not the first time that the water in the Valley has tested positive for harmful microbes. What concerns them more is that water quality has not improved much over the years.\n\nConsumption of contaminated water not only causes diarrheal infections and deadly cholera but also increases the chances of contracting dysentery, typhoid, and hepatitis A and E.\n\nMeanwhile, hospitals in Kathmandu Valley have already reported an uptick in the number of cases of waterborne diseases, including diarrhoea, food poisoning, and typhoid, among others.\n\n“Around 10 to 15 diarrheal patients seek treatment in our hospital every day,” said Dr Yuba Nidhi Basaula, director at the Sukraraj Tropical and Infectious Disease Hospital. Fever, typhoid and food poisoning cases have also risen in recent days. Some patients return home from the hospital emergency after treatment for a few hours, and some need to be hospitalised”\n\nPublic health experts expect further rise in the number of diarrheal cases in the coming days, as the monsoon rainfall has just started, during which most water sources get contaminated by rainwater and sewage. What alarms them is most Nepalis do not boil water before drinking.\n\nIn Nepal, the monsoon season often brings outbreaks of both water- and vector-borne diseases that infect thousands.\n\n“We are seeing patients infected with waterborne and foodborne diseases in our hospital, but the number is not yet alarming as in previous monsoons,” said Dr Samita Panta Acharya, medical director at the Patan Hospital. “As monsoon rainfall has just started, we expect a surge in the coming days.”\n\nDiarrhoeal disease is a common and seasonal public health concern usually triggered by food and water safety or hygiene issues. It is one of Nepal’s leading causes of illness and death among young children.\n\nLast year, thousands of people in the Kathmandu valley fell ill due to diarrhoea, and dozens were infected with cholera. A study carried out by the health ministry following an outbreak last year showed that nearly 70 percent of drinking water samples in Kathmandu Valley werecontaminatedwith deadly microbes—E. coli and faecal coliform. Even bottled water.\n\nDoctors say initiating awareness drives and ensuring safe drinking water are the only ways to save people from waterborne diseases. They say that a combination of careful surveys, safe drinking water, good sanitation and hygiene standards, social mobilisation and treatment is required to prevent outbreaks.",
      "date": "2025-06-16",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/thumb1-1750035471.jpg",
      "read_time": "3 min read"
    },
    {
      "url": "https://kathmandupost.com/health/2025/06/13/at-least-19-tested-positive-for-covid-19-one-hospitalised",
      "title": "At least 19 tested positive for Covid-19, one hospitalised",
      "body": "At least 19 people have tested positive for Covid-19 in the past one week.\n\nAccording to officials at the Epidemiology and Disease Control Division, most of the people tested positive for the virus are those who returned from India. Some are also locals from the Kathmandu valley.\n\n“One patient has been admitted to a hospital in Kathmandu due to complications,” said an official at the division on the condition of anonymity, as he is not authorised to speak publicly about the cases. “The infected patient is recuperating now.”\n\nNepal confirmed new coronavirus cases on May 4, when three people—two males and a female—returned from India, tested positive for Covid-19. Health officials say that rapid diagnostic testing is being carried out only on those having coronavirus-like symptoms—fever, cough, sore throat, among others.\n\nTesting is not being carried out on asymptomatic people, who might be infected. Some might have come in the incubation period, but no agency in the country traces their movements.\n\nHealth workers say that they have asked the infected people to remain in isolation for five days and let them go home from the border entry points.\n\nOf late, India has been witnessing a spike in coronavirus cases. On Wednesday, the southern neighbour reported three coronavirus-related deaths in 24 hours and the active case tally rose to 7,154, according tomedia reports.\n\nIndia has also confirmed the emergence of four new sub-variants of Omicron—NB.1.8.1 and LF.7, XFG and JN.1.\n\nAlong with India, several other countries including Singapore, Thailand, China (Hong Kong), and the US have also reported a surge in coronavirus cases.\n\nThe World Health Organisation has classified NB.1.8.1subvariant as avariant under monitoring. The UN health body said that the additional public health risk posed by NB.1.8.1 is evaluated as low at the global level as per the available evidence.\n\nExperts in Nepal say that even if the new variant of coronavirus is mild, elderly people and those with underlying conditions remain at risk of developing severe symptoms.\n\nThey had earlier warned that the Covid could enter the country at any time due to geographic proximity with, and the movement of people, from countries that are seeing a spike in infections. The country in the past witnessed Covid outbreaks shortly after cases shot up in other countries.\n\nMeanwhile, health officials say they have supplied 600 rapid diagnostic test kits in the districts having border crossings with India. They say that they have also started a process to procure 20,000 rapid diagnostic test kits and requested the World Health Organisation Nepal office for rapid diagnostic test kits.\n\nPublic health experts say a Covid outbreak could hit Nepal soon, as cases are sharply rising in neighbouring India. In the past, it has usually taken two to three weeks for the virus to spread to Nepal after a surge in India.\n\nThey have called on health authorities to step up surveillance measures, including testing patients with influenza-like symptoms. The public, they say, should return to the basics—wearing face masks, washing hands and avoiding crowds to cut down on infection risk.",
      "date": "2025-06-13",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/thumb2-1749825032.jpg",
      "read_time": "2 min read"
    },
    {
      "url": "https://kathmandupost.com/health/2025/06/10/nepal-drug-regulator-orders-recall-of-contaminated-saline-solutions",
      "title": "Nepal drug regulator orders recall of contaminated saline solutions",
      "body": "Two saline solutions have been recalled from the market after lab tests detected the growth of hazardous microorganisms. Doctors say patients exposed to contaminated saline solutions may suffer from septic shock and even die, and the deadly bacteria could spread within hospitals.\n\n“Samples were sent to us by the Seti Provincial Hospital of Sudurpaschim province,” said Narayan Dhakal, director general at the Department of Drug Administration (DDA). “We have instructed agencies concerned to stop using these substandard saline solutions immediately and have ordered companies and dealers to recall products from the market.”\n\nThe department, which is the national drug regulatory agency, admitted that testing the contaminated saline solutions took around three months.\n\n“Due to understaffing in our laboratory, it took around three months to carry out the testing,” said Dhakal. “Saline solutions contaminated with hazardous microorganisms should not be used on patients, as this increases the risk of spread of infection and severity. Patients may suffer septic shock.”\n\nThe recalled saline solutions are RL 500 ml [Compound Sodium Lactate Injection IP] batch A0581030, and D5% 500 ML batch A0181004, both manufactured by the Nepali pharma company Lomus Parentals and Formulation Pvt Ltd.\n\nIn a press statement on Tuesday, the DDA said that RL 500 ml did not meet sterility standards under IP2022, and D5% 500 ml did not comply with USP 2024 sterility test requirements.\n\nEnsuring the quality of medicine in Nepal has long been a challenge, as the drug regulator struggles with limited staff and laboratory capacity, which cause delays in timely tests.\n\nDrug inspectors deployed from the DDA collect samples through random market checks and send them to government labs for testing. If drugs are found to be problematic or substandard, the department directs manufacturing companies to recall those drugs from the market.\n\nHowever, due to staff shortages, it often takes months for the department to carry out testing. In many cases, substandard drugs are sold and consumed long before tests are compelled and recalls ordered. The department also lacks an effective mechanism to enforce drug recalls.\n\nExperts warn that the use of substandard medicines could seriously harm patients’ health.\n\nDDA officials acknowledge that manufacturers may have supplied substandard batches of saline solutions, which doctors have already used on patients. They also said that they are unaware of the current quantity of substandard saline solutions in the market.\n\nThe department publishes recall notices on its website, urging respective companies to recall the drugs immediately. However, most substandard drugs are sold out by the time these notices are published. The department’s report shows that around 11 percent of medicines sold in the last fiscal year across the country were found substandard.\n\nDespite thousands of medicines being sold across the country from both national and international pharma companies, DDA inspectors collect only around 1,000 samples from the market in a year. The inspection work is especially daunting because DDA has only around two dozen drug inspectors tasked with monitoring over 24,000 registered pharmacies and thousands of unregistered ones.\n\nAs it takes several months to test some medicines, the department currently allows manufacturing to supply medicines directly from factories.",
      "date": "2025-06-10",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/thumb10-1749562061.jpg",
      "read_time": "2 min read"
    },
    {
      "url": "https://kathmandupost.com/health/2025/06/09/nepal-performs-first-sex-change-surgery",
      "title": "Nepal performs first gender affirmation surgery",
      "body": "The Tribhuvan University Teaching Hospital said it has successfully carried out a gender reaffirmation surgery at the hospital.\n\nThis marks the first time such a procedure has been undertaken in Nepal. In the past, transgender Nepalis needed to travel abroad, mostly to India or Thailand, for such surgeries.\n\n“Yes, we have successfully carried out gender reaffirmation surgery on a 25-year-old transgender woman from Janakpur,” said Dr Jayan Man Shrestha, head of the Plastic Surgery Department at the hospital. “The surgery was successful and the patient has already been discharged.”\n\nThe hospital sought the help of foreign experts for the surgery.\n\nAccording to the hospital administration, Dr Alireza Hamidian Jaromi, an LGBTQ-affirming plastic surgeon at Temple Health in the US, led a team of TUTH doctors in performing the surgery.\n\nThe team comprised Dr Shrestha and other plastic surgeons serving at the hospital, including Dr Ishwar Lohani, Dr Sangam Rayamajhi, Dr Samit Sharma, Dr Bikesh Rajbandari, Dr Himalaya Niraula, and resident doctors.\n\nDoctors removed the penis and the testes and used tissues from the penis to construct the vagina, clitoris, and labia. This procedure is called vaginal construction or vaginoplasty.\n\nDoctors at the hospital said that the person sought only gender reaffirmation surgery and did not seek breast augmentation or facial surgery to achieve feminine features.\n\n“We are ready to provide other surgeries, if the person requests them,” said Shrestha.\n\nDoctors say that with the start of this service at the Tribhuvan University Teaching Hospital, many transgender people seeking gender reassignment surgery will now be able to access gender-affirming care within the country.\n\n“We hope the person who underwent the surgery has now achieved the gender identity of his choice,” said Dr Lohani, a consultant plastic surgeon at the hospital. “Others can also get the service at the hospital. The procedure costs only around Rs150,000 to Rs200,000, which is about the same price as a plane ticket to go abroad.”\n\nDue to a lack of such services in Nepal, sexual and gender minorities were previously forced to travel to India, Thailand, and other countries for expensive and sometimes risky surgeries.\n\nThe hospital plans to set up a gender-affirming clinic to better serve transgender people and continue these services.\n\n“Those who want to undergo gender-reassignment surgery can contact doctors at the outpatient department of the plastic surgery unit of our hospital,” said Shrestha, the department head. “Some people have already expressed interest in the service.”\n\nAlthough surgeries are not required for gender affirmation, many patients seek surgical procedures to align their physical appearance with their gender identity.",
      "date": "2025-06-09",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/news/teachinghospital28420200930141000x02842021031721-1749431364.jpg",
      "read_time": "2 min read"
    },
    {
      "url": "https://kathmandupost.com/health/2025/06/07/covid-cases-rise-in-sudurpaschim-but-test-kits-running-out",
      "title": "Covid cases rise in Sudurpaschim, but test kits running out",
      "body": "Sudurpaschim Province has seen a steady rise in Covid-19 cases over the past four days, with 13 returnees from India testing positive.\n\nHealth officials warn that the actual number could be higher due to a severe shortage of rapid diagnostic test kits at key border points.\n\nOn Saturday, three individuals who entered through the Gauriphanta checkpoint in Kailali and one from the Jhulaghat crossing in Baitadi tested positive, according to the Provincial Health Emergency Operations Centre.\n\n“Of the 27 people tested at Gauriphanta, three were found infected,” said Hem Raj Joshi, the province’s Covid focal person. “One more case was confirmed at Jhulaghat.”\n\nDespite daily detections, testing has been severely limited. Only 28 individuals were tested at the Gauriphanta and Jhulaghat border points on Saturday, even though over 1,100 people coming from India entered Nepal through various crossings in Kailali, Baitadi, Darchula, and Kanchanpur.\n\n“We received 200 kits from Kathmandu on Friday, but due to the limited supply, we are only testing individuals who show strong symptoms or have high exposure risk,” Joshi added.\n\nThe rise in infections comes at a time when India is also reporting an uptick in Covid cases, raising concerns about cross-border transmission. Public health experts have long warned that Nepal could see a fresh wave of infections following spikes in neighbouring countries.\n\nOfficials said those who test positive are being contacted through local authorities and advised to self-isolate at home. Increased surveillance has also been introduced at border checkpoints, and all local health units have been instructed to remain alert.\n\nJoshi noted that the province has requested additional test kits but acknowledged that further delays in supply could weaken containment efforts.\n\n“We’re operating with extreme caution, but we can’t properly monitor the situation without enough testing,” he said.\n\nHealth officials are urging the public to adopt preventive measures such as mask-wearing, hand hygiene, and avoiding crowded places, especially as monsoon travel increases movement across borders.",
      "date": "2025-06-07",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/news/corona0119420220248320762025110450-1749302877.jpg",
      "read_time": "1 min read"
    }
  ],
  "sports": [
    {
      "url": "https://kathmandupost.com/sports/2025/07/06/djokovic-hits-century-to-lead-veterans-into-last-16-krejcikova-crashes",
      "title": "Djokovic hits century to lead veterans into last 16, Krejcikova crashes",
      "body": "Seven-times champion Novak Djokovic scored his 100th match win at Wimbledon and led the march of the old guard into the last 16 on Saturday while an ailing Barbora Krejcikova’s title defence ended in defeat and tears.\n\nWorld number one Jannik Sinner was at his ruthless best yet again as the Italian gathered momentum in his quest for a maiden All England Club title while American Ben Shelton and Australian Alex de Minaur announced themselves as dark horses.\n\nDjokovic is on an altogether different plane as he looks to capture his eighth title to match Roger Federer’s record on the pristine lawns of London and his 25th major overall to surpass Margaret Court on the all-time list of champions.\n\nThe 38-year-old showed exactly why Wimbledon could be his best chance of achieving the elusive targets when the 2023 and 2024 runner-up dismantled Davis Cup teammate Miomir Kecmanovic 6-3 6-0 6-4 in a little under two hours.\n\nA ton of victories put him among elite company as the sixth seed became only the third player to achieve that feat at the tournament after nine-times champion Martina Navratilova and Swiss great Federer.\n\n“Wimbledon is a favourite and a dream tournament for not just myself, but probably the majority of players. Growing up, most of the kids dream of playing here and winning here,” Djokovic said.\n\n“I’ve been blessed to do it multiple times. Any history that I make in my favourite tournament, I’m blessed.”\n\nGrigor Dimitrov, the Bulgarian 34-year-old, also scored his 100th match win across the four Grand Slams when he quelled the challenge of Austrian Sebastian Ofner 6-3 6-4 7-6(0).\n\nJoining him was fellow veteran Marin Cilic, the Croatian 36-year-old getting past spirited Spaniard Jaume Munar 6-3 3-6 6-2 6-4 to book a meeting with Italian 22nd seed Flavio Cobolli who took apart big-serving Czech teenager Jakub Mensik 6-2 6-4 6-2.\n\nWhile Cobolli may not be relishing a meeting with the tricky Cilic, his compatriot Sinner will welcome the chance to test his metronomic hitting against Dimitrov’s elegant approach in what promises to be a classic.\n\nSUBLIME SINNER\n\nA sublime Sinner booked that clash with a 6-1 6-3 6-1 hammering of Pedro Martinez. The top seed, who has lost just 17 games in his first three matches, equalled the professional era record for fewest games dropped to make the Wimbledon fourth round along the way.\n\n“About the games lost, this is whatever,” Sinner said, his grounded nature coming into sharp focus.\n\n“I’m not looking on these kind of records. I know everything can change very quickly from one round to the other.”\n\nAfter the unexpected high of last year’s title triumph, Krejcikova came crashing down when she was beaten 2-6 6-3 6-4 by American 10th seed Emma Navarro in a disjointed Court One contest.\n\nThe distressed 29-year-old Czech, who has endured her share of injuries this season, was in tears as she prepared to serve to stay in the tournament at 3-5 in the deciding set before eventually crashing out.\n\n“It was tough, neither of us played our best tennis, she was dealing with some injuries and I was dealing with whatever I was dealing with,” Navarro said, adding that it was difficult to focus when her opponent was struggling.\n\n“It’s not easy to be composed. Part of you is saying just put a bunch of balls in the court and that’s all you need to do. But then you trick yourself into not playing the way that you want to play.”\n\nKrejcikova’s exit and 2022 champion Elena Rybakina’s 7-6(6) 6-3 defeat by Danish powerhouse Clara Tauson means a first-time women’s champion will be crowned at the Grand Slam for the eighth consecutive year.\n\nIga Swiatek will hope she can be the one after the five-times major champion secured a 6-2 6-3 victory over American Danielle Collins, whose compatriot Hailey Baptiste crashed to 18-year-old Russian Mirra Andreeva 6-1 6-3.\n\nShelton gave Americans something to smile about when the powerful left-hander made quick work of Hungarian lucky loser Marton Fucsovics 6-3 7-6(4) 6-2 while De Minaur swatted aside Dane August Holmgren 6-4 7-6(5) 6-3 to go through.",
      "date": "2025-07-06",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/world/imgi1KQER7BYWXVOV5GBCA3JVBGCPRQ-1751784461.jpg",
      "read_time": "3 min read"
    },
    {
      "url": "https://kathmandupost.com/sports/2025/07/05/angeldahl-strike-ensures-1-0-win-for-sweden-over-denmark-in-women-s-euros",
      "title": "Angeldahl strike ensures 1-0 win for Sweden over Denmark in Women’s Euros",
      "body": "Midfielder Filippa Angeldahl scored for Sweden in a third straight game as her second-half strike secured a 1-0 win over neighbours Denmark in the opening game of Group C at the Women's European Championship on Friday.\n\nReal Madrid’s Angeldahl, who scored in friendlies against Denmark and Norway last month, played a one-two with Kosovare Asllani as she entered the box from the right and netted a right-footed shot near the far post in the 55th minute after a tight first half.\n\n“There’s so much nerves when you start a tournament so it was a wonderful feeling to score that first goal,” player of the match Angeldahl said.\n\n“It’s really important to win the first match and give you a platform for the rest of the finals.”\n\nDenmark had fought hard to stay in the game as Sweden dominated possession, with Katrine Veje’s tackle denying Stina Blackstenius in the 17th minute and keeper Maja Bay Ostergaard tipping over Angeldahl’s free kick near the top corner just before the break.\n\nBlackstenius almost scored Sweden’s second goal shortly after the hour mark but her shot from close range was saved on the line by Frederikke Thogersen, leading to a groan from the more than 17,000 spectators in attendance.\n\nDenmark, who had only 10 attempts in the game, almost half of Sweden’s, came dramatically close to equalising in the 81st minute when Thogersen found Pernille Harder with a quick pass on the right, but the Danish captain’s thundering drive hit the crossbar.\n\n“It’s hard that we didn’t get a point from here today but we can take how we played today, how good we were, how good (we defended)... into the next game against Germany,” Denmark defender Stine Ballisager said.\n\nDenmark face eight-time champions Germany on Tuesday, while Sweden play Poland.",
      "date": "2025-07-05",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/world/WOMENSEUROS-1751712525.jpg",
      "read_time": "1 min read"
    },
    {
      "url": "https://kathmandupost.com/sports/2025/07/03/nepal-set-to-face-singapore-in-u-16-east-zone-cup-final",
      "title": "Nepal to face Singapore in title clash",
      "body": "Nepal will defend their title of the ACC U-16 East Zone Cup against Singapore in the final of the ongoing edition in Malaysia. The Nepal vs Singapore clash for the final was confirmed after the young Rhinos defeated the hosts and Singapore defeated Hong Kong in the semi-final matches on Thursday.\n\nNepal defeated Malaysia by nine wickets while Singapore defeated Hong Kong by four wickets in the other semifinal.\n\nThe final match for the championship will take place on Sunday. Nepal reached the final unbeaten in the tournament. Meanwhile, Singapore had advanced to the semifinals as the runners-up from the same group as Nepal.\n\nSingapore, who lost to Nepal in the group stage by six wickets on June 22, secured their place in the final by chasing Hong Kong’s target of 169 runs in 38.5 overs. Hong Kong were bundled out in 43 overs.\n\nIn Thursday’s first match, Malaysia batted first against the visitors. They could only reach 91 runs in 43.1 overs against a formidable Nepali bowling.\n\nIn at seven, Muhammad Fathul Muin (38 off 71), and skipper, Deeaz Patro (10 off 32), were the only ones who scored in double figures for Malaysia.\n\nAbhay Yadav led the attack with an excellent spell, finishing with figures of 4 for 15 runs from his 10-over bowling. He was ably supported by Shubham Khanal, who picked up 3 for 12 in 10 overs, including four maidens.\n\nMalaysia could never recover from their early setbacks. They were reduced to 4/2 in the third over and kept losing wickets at regular intervals.\n\nBipin Prasad Sharma and Sachin Bhatta took one wicket each, while Suyog Bhattarai bowled tightly, conceding just 25 runs in his nine overs.\n\nNepal’s tight lines, disciplined bowling, and sharp fielding effort ensured that Malaysia were never allowed to build any significant partnerships.\n\nIn turn, Nepal’s opener Parimarjan Yadav scored a brilliant half-century. Facing 35 balls, he remained unbeaten on 59 runs with the help of 5 fours and 5 sixes.\n\nComing in at number three, Shivansh Bajgain also contributed an unbeaten 23 runs, hitting five boundaries. Earlier, opener Prashiddha Jaishi was dismissed for just 2 runs after facing 16 balls.\n\nNagishwaran Sathkumaran took the only wicket for Malaysia.",
      "date": "2025-07-03",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/parimarjanyadav-1751540734.jpg",
      "read_time": "1 min read"
    },
    {
      "url": "https://kathmandupost.com/sports/2025/07/03/liverpool-s-portuguese-forward-diogo-jota-dies-in-car-crash-in-spain",
      "title": "Liverpool’s Portuguese forward Diogo Jota dies in car crash in Spain",
      "body": "Liverpool’s Portuguese forward Diogo Jota and his brother died in a car crash in northwestern Spain early on Thursday, when their Lamborghini veered off the road and burst into flames, authorities said.\n\nEvidence at the scene of the crash near the city of Zamora suggests Jota’s car suffered a burst tyre while overtaking, Spanish police said in a statement.\n\nJota, 28, had in late June just married his partner of ten years with whom he had three children.\n\n“We have lost two champions. Their deaths represent irreparable losses for Portuguese football, and we will do everything we can to honour their legacy every day,” the Portuguese Football Federation said of Jota and his brother Andre Silva, a footballer who played for Penafiel in the Portuguese second division.\n\nPolice said their bodies have been taken to a forensics unit in Zamora where autopsies will be performed.\n\n“The news of the death of Diogo Jota, an athlete who greatly honoured the name of Portugal, and his brother, is unexpected and tragic,” Portuguese Prime Minister Luis Montenegro said on X. “I offer my most sincere condolences to his family.”\n\nJota helped Liverpool win the Premier League last season and also won the FA Cup and League Cup with the Merseyside outfit.\n\nBorn in Porto, he began his career with local team Pacos de Ferreira before switching to Wolverhampton Wanderers in 2017. Jota arrived at Anfield in 2020 and scored 65 goals in 182 appearances for the club in all competitions.\n\n“Liverpool Football Club are devastated by the tragic passing of Diogo Jota,” the club said on X.\n\nHe also made 49 appearances for Portugal, twice winning the UEFA Nations League.\n\n“It is a remarkable achievement for a small guy that came from Gondomar, where I had this dream,” Jota said on Liverpool’s website of winning the Premier League. “It’s a moment I will cherish forever.”",
      "date": "2025-07-03",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/world/JOTA-1751537144.jpg",
      "read_time": "1 min read"
    },
    {
      "url": "https://kathmandupost.com/sports/2025/07/02/samba-s-hat-trick-leads-nepal-to-emphatic-8-0-win-over-sri-lanka-1751473205",
      "title": "Samba’s hat-trick leads Nepal to emphatic 8–0 win over Sri Lanka",
      "body": "Nepal thrashed Sri Lanka 8–0 on Wednesday in their second match of the AFC Women’s Asian Cup qualifiers, with captain Sabitra Bhandari—widely known as Samba—scoring a brilliant hat-trick to continue her team’s dominant run in Group F.\n\nThe win, played at the Milliy Stadium in Tashkent, follows Nepal’s 9–0 demolition of Laos in their opener, taking them to the top of the table with six points from two matches. Sri Lanka, meanwhile, exit the tournament early after back-to-back defeats.\n\nGeeta Rana opened the scoring in the 7th minute with a header from a corner delivered by Anita Basnet. Bhandari doubled the lead in the 20th minute and went on to complete her hat-trick with goals in the 42nd and stoppage time of the first half.\n\nNepal kept up the pressure after the break. Rana converted a penalty in the 54th minute for her second goal. Nisha Thokar made it 6–0 with a header, before substitutes Rekha Paudel and Puja Rana added two more goals in the 78th and 89th minutes respectively.\n\nSri Lanka managed only a single weak attempt throughout the match and failed to create any significant chances.\n\nWith this win, Nepal are now in pole position to qualify for the 2026 AFC Women’s Asian Cup in Australia. However, their final group-stage fixture against hosts Uzbekistan on July 5 is expected to be decisive.\n\nIf Uzbekistan defeat Laos later today as expected, both teams will enter the final game level on points, making it a winner-takes-all encounter. If the match ends in a draw, standard tiebreakers such as goal difference, total goals scored, and fair play points will be used to decide who qualifies.",
      "date": "2025-07-02",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/news/SabitraBhandari-1751473167.jpg",
      "read_time": "1 min read"
    },
    {
      "url": "https://kathmandupost.com/sports/2025/07/01/uefa-to-permit-water-bottles-for-women-s-euro-fans-as-swiss-temperatures-soar",
      "title": "UEFA to permit water bottles for Women’s Euro fans as Swiss temperatures soar",
      "body": "Fans will be allowed to bring bottles of water to the stadium for some of the games at the Women’s European Championship, which gets underway on Wednesday, as a heatwave has sent temperatures in Switzerland to over 30 degrees Celsius (86°F).\n\nEuropean soccer governing body UEFA said on Tuesday that the normally strict security rules would be relaxed to allow fans attending matches on the first two days (July 2 and 3) of Euro 2025 to bring a half-litre plastic or aluminium water bottle into the stadium. No glass bottles will be allowed.\n\nThe usual conditions attached to Euro 2025 tickets state that no “bottles, jugs or cans of any kind, as well as other objects made from plastic, glass or any other fragile materials” may be brought into any of the stadiums, with exceptions made for medical containers.\n\nAccording to meteorological service MeteoSwiss, the temperature in Basel is expected to reach 35 degrees ahead of Switzerland's opening game against Norway on Wednesday evening, with similar temperatures expected throughout the country.\n\n\"We want you to feel safe during Women's EURO so you can enjoy your tournament experience to the max even when high temperatures hit,\" UEFA said in a statement on their website advising fans to stay in the shade and to keep themselves hydrated.\n\nUEFA competition rules also allow for cooling breaks during the games if temperatures are above 35 degrees Celsius, with referees also allowed to use their discretion.\n\nThe four games that fans will be allowed to bring water bottles to are Iceland v Finland (July 2, Thun), Switzerland v Norway (July 2, Basel), Belgium v Italy (July 3, Sion) and Spain v Portugal (July 3, Bern).",
      "date": "2025-07-01",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/world/germanytraining-1751368835.jpg",
      "read_time": "1 min read"
    },
    {
      "url": "https://kathmandupost.com/sports/2025/07/01/nepal-cruise-past-bhutan-by-298-runs-to-reach-semi-finals-unbeaten",
      "title": "Nepal cruise past Bhutan by 298 runs to reach semi-finals unbeaten",
      "body": "Nepal maintained their perfect record in the ACC Men’s U-16 East Zone Cup 2025 with a commanding 298-run victory over Bhutan in their final group-stage match at the Selangor Turf Club in Kuala Lumpur on Monday.\n\nWinning the toss and electing to bat, Nepal piled up a formidable 358-5 in 50 overs, thanks to a scintillating century from Raunak Srivastav. The right-hander struck 168 off 132 balls, peppering the boundary with 16 fours and five sixes.\n\nHe was ably supported by Joy Thapa, who remained unbeaten on 61, while Shivansh Bajgain chipped in with 54 and Sugam Budhathoki added 35. Bhutan’s Sanjay Dorji claimed 3 wickets, with Tenzin Loday picking up one.\n\nIn reply, Bhutan never found their footing, limping to 60-9 in 32.4 overs. Their final batter did not appear at the crease. Sujan Dawa top-scored with 14, while Ugyog Chhophel added 10.\n\nNepal’s captain, Bipin Prasad Sharma, led the bowling attack with a miserly spell, claiming 4 wickets for just 7 runs in 10 overs. Sachin Bhatt and Suyog Bhattarai took two wickets apiece to wrap up the Bhutanese innings.\n\nWith this fourth consecutive win, Nepal top Group A and advance to the semi-finals, where they will face Malaysia on Thursday. Singapore join them from Group A, while Hong Kong and hosts Malaysia qualify from Group B.\n\nNepal, the defending champions, had lifted the title in 2023 by defeating Malaysia in the final. The 2025 edition features 10 nations, with Group A comprising Nepal, Singapore, Indonesia, Bhutan and Japan; and Group B including Malaysia, Hong Kong, Maldives, Thailand and Myanmar.",
      "date": "2025-07-01",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/third-party/can-1751364609.jpg",
      "read_time": "1 min read"
    },
    {
      "url": "https://kathmandupost.com/sports/2025/06/30/inter-miami-coach-javier-mascherano-sees-benefits-despite-psg-defeat",
      "title": "Inter Miami coach Javier Mascherano sees benefits despite PSG defeat",
      "body": "Inter Miami exited the Club World Cup with a 4-0 defeat to Paris St Germain on Sunday, but coach Javier Mascherano believes their experience at the tournament will benefit both his side and Major League Soccer.\n\nWHY IT’S IMPORTANT\n\nWith eight-times Ballon d'Or winner Lionel Messi in their ranks, Inter Miami reached the knockout stages by securing second place in Group A.\n\nHowever, their decisive defeat by PSG, Messi’s former team, highlighted the gap between the MLS and top European clubs.\n\nKEY QUOTES\n\nMascherano: \"There's a huge lesson to be learned from here. We're going to be reviewing all of this and I think that they go hand in hand now if we are going to be able to take stock of this experience.\"\n\n\"I think that this is going to help us when we take this to our National League. It goes without saying that it depends on our own personal intelligence that we have at our disposal as a team to be able to leverage this experience.\"\n\n\"PSG is a wonderful team. They have high-calibre players and an amazing head coach, Luis Enrique, who I know personally. I feel that this is a team that will be remembered.\"",
      "date": "2025-06-30",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/world/PSGVSINTERMIAMI-1751277646.jpg",
      "read_time": "1 min read"
    }
  ],
  "climate-environment": [
    {
      "url": "https://kathmandupost.com/climate-environment/2025/06/19/forests-parks-and-ponds-can-help-cool-capital-by-up-to-1-6-c-study-finds",
      "title": "Forests, parks and ponds can help cool Capital by up to 1.6°C, study finds",
      "body": "Urban forests, parks and ponds could reduce temperatures in the Kathmandu valley by as much as 1.6 degrees Celsius if they are strategically managed, according to a new study published in the journalUrban Climate.\n\nThis is the first study to examine how different types of blue-green infrastructure contribute to cooling effects across the Valley’s urban areas.\n\nAn international team from seven institutions used satellite-based data and machine learning algorithms to analyse 301 parks, 130 forest patches, and 26 ponds within densely populated parts of the Valley.\n\nThe study finds that temperatures rise notably as one moves away from blue-green spaces such as forests, parks and ponds. For instance, the Swoyambhu forest recorded a temperature of 31.9 degrees Celsius, compared to 36.0 degrees in adjacent built-up areas—a difference of 4.1 degrees Celsius.\n\nUN Park remained at 34.3 degrees Celsius while nearby areas climbed to 38.2 degrees, showing a 3.9-degree difference. A traditional pond, Na Pukhu in Bhaktapur, registered 39.6 degrees Celsius, while the surrounding urban zone hit 42.5 degrees.\n\nThese figures—captured from satellite data over five summers—represent the highest recorded cooling impacts, demonstrating the crucial role these natural features play during peak heat periods.\n\nAlthough the temperature estimates need to be confirmed with on-ground measurements, relative differences point to clear patterns of urban heat mitigation.\n\nAt Ranipokhari, for example, the central water body measured 37.1 degrees Celsius, while the surrounding streets were at 39.8 degrees, hotter by 2.7 degrees.\n\nThe study found that the cooling effect of ponds generally extends up to 150 metres from the edge, with the most noticeable impact within the first 100 meters.\n\nIn Bhaktapur, Siddha Pokhari recorded a temperature of 36.0 degrees Celsius, compared to 38.5 degrees in nearby urban areas.\n\nPimbahal pond in Lalitpur showed a cooling effect of 2.1 degrees, with its surroundings at 40.4 degrees, while the pond stayed at 38.3 degrees.\n\nThe effect extended up to 300 meters from the water’s edge.\n\nOn average, urban forests delivered the strongest cooling, reducing temperatures by up to 1.2 degrees Celsius. Parks followed with a cooling impact of 0.9 degrees, while ponds lowered temperatures by up to 0.85 degrees.\n\nHowever, the cooling capacity depends heavily on the surrounding landscape. In vegetation-dominated areas, blue-green spaces can reduce heat by as much as 1.6 degrees Celsius. However, in densely built zones, the cooling effect falls between 0.3 and 0.6 degrees.\n\nLead researcher Saurav Bhattarai, a PhD candidate at the Jackson State University, Mississippi and an ORISE (Oak Ridge Institute for Science and Education) fellow, said the findings show that simply adding green spaces is insufficient. “Cooling strategies must be adapted to the local context. Green spaces need to be well integrated into the urban fabric to be effective,” he said.\n\nThe study comes amid a steady warming of Kathmandu. Since 1976, average temperatures in the Valley have risen by 0.38 degrees Celsius decade on decade.\n\nToday, core city areas are typically 2–3 degrees hotter than surrounding regions.\n\nAdding to the concern, the researchers found that soil moisture levels across the Valley have declined by an average of 2.1 percent in the past 10 years. In some central areas, the reduction has been as high as 35 percent.\n\nDr Rocky Talchabhadel of Jackson State University stressed the urgency of urban climate planning. “Our study shows that Kathmandu’s densely built areas are especially vulnerable to extreme heat. Without immediate intervention, these heat islands will grow,” he said.\n\nUrban forests showed the strongest correlation between size and cooling impact: when forest area doubles, the cooling effect increases by roughly 30 percent.\n\nParks, on the other hand, showed that cooling effectiveness depends more on internal design than size. Tree canopy coverage was the single most important factor.\n\nIn small parks, a 1 percent increase in high canopy coverage led to almost a 1-degree increase in cooling. In large parks, the same increase brought a 1.76-degree drop in temperature.\n\n“This isn’t just about planting more trees,” said Professor Vishnu Prasad Pandey at the Tribhuvan University Institute of Engineering. “The ratio of tree canopy, grass and paved areas within a park influences cooling more than size alone. Well-designed parks can be powerful tools against heat, even in space-constrained cities.”\n\nThe study offers tailored recommendations for different urban contexts.",
      "date": "2025-06-19",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/news/Ranipokhari03222025DJI202503221533440005Dcopy-1750293749.jpg",
      "read_time": "3 min read"
    }
  ],
  "science-technology": [
    {
      "url": "https://kathmandupost.com/science-technology/2025/06/27/chile-observatory-captures-the-universe-with-3-200-megapixel-camera",
      "title": "Chile observatory captures the universe with 3,200-megapixel camera",
      "body": "Chile’s Vera C. Rubin Observatory, which boasts the world’s largest digital camera, has begun displaying its first images of the cosmos, allowing astronomers to figure out how the solar system formed and even whether an asteroid poses a threat to Earth.\n\nLocated on Pachon Hill in the northern region of Coquimbo, the 8.4-meter (27-1/2-foot) telescope has a 3,200-megapixel camera feeding a powerful data processing system.\n\n“It’s really going to change and challenge the way people work with their data,” said William O’Mullane, a project manager focused on data at Vera Rubin.\n\nThe observatory detected over 2,100 previously unseen asteroids in 10 hours of observations, focusing on a small area of the visible sky. Its ground-based and space-based peers discover in total some 20,000 asteroids a year.\n\nO’Mullane said the observatory would allow astronomers to collect huge amounts of data quickly and make unexpected finds.\n\n“Rather than the usual couple of observations and writing an (academic) paper. No, I’ll give you a million galaxies. I’ll give you a million stars or a billion even, because we have them: 20 billion galaxy measurements,” he said.\n\nThe centre is named after American astronomer Vera C. Rubin, a pioneer in finding conclusive evidence of the existence of large amounts of invisible material known as dark matter.\n\nEach night, Rubin will take some 1,000 images of the southern hemisphere sky, letting it cover the entire southern sky every three or four nights. The darkest skies above the arid Atacama Desert make Chile one of the best places worldwide for astronomical observation.\n\n“The number of alerts the telescope will send every night is equivalent to the inboxes of 83,000 people. It’s impossible for someone to look at that one by one,” said astrophysicist Francisco Foster.\n\n“We’re going to have to use artificial intelligence tools.”",
      "date": "2025-06-27",
      "author": "By Kathmandu Post",
      "image_url": "https://assets-cdn.kathmandupost.com/uploads/source/news/2025/world/imgi1RCTY3BKU3FPGHB6ZBLLI5UGQVE-1751030135.jpg",
      "read_time": "1 min read"
    }
  ]
}