{
  "politics": [
    {
      "title": "Hindu state debate returns in Congress",
      "summary": "The issue of restoring Nepal's Hindu state status has resurfaced in the ongoing central committee meeting of the Nepali Congress. Shekhar Koirala, a leader from the dissident faction of the party, has consistently expressed his support for a Hindu state. The Congress Professional and Intellectuals Department, along with the party-affiliated Democratic Lawyers’ Association, submitted a report to party president Sher Bahadur Deuba in March.",
      "url": "https://kathmandupost.com/politics/2025/07/07/hindu-state-debate-returns-in-congress",
      "date": "2025-07-07"
    },
    {
      "title": "Parties agree to form special parliamentary committee to probe civil service bill tampering",
      "summary": "The Business Advisory Committee will finalise the candidates for the probe committee on Monday. The House will endorse it the same day. The committee will have to complete its task within 15 days.",
      "url": "https://kathmandupost.com/politics/2025/07/06/parties-agree-to-form-special-parliamentary-committee-to-probe-civil-service-bill-tampering",
      "date": "2025-07-06"
    }
  ],
  "money": [
    {
      "title": "Economists warn rising bad loans could threaten financial stability",
      "summary": "Rise in nonperforming loans (NPLs) could pose serious risks to the economy. The average NPL ratio has climbed to 4.8 percent, up from 3.65 percent during the same period last year. The government is preparing to establish a separate institution dedicated to managing the increasing volume of bad loans in the financial system.",
      "url": "https://kathmandupost.com/money/2025/07/07/economists-warn-rising-bad-loans-could-threaten-financial-stability",
      "date": "2025-07-07"
    },
    {
      "title": "NEPSE falls as turnover also declines",
      "summary": "The Nepal Stock Exchange (NEPSE) index declined by 22.35 points on Monday, closing at 2,684.01 points. Total turnover stood at Rs8.37 billion, down from Rs9.5 billion on Sunday. Only two sub-indices registered gains, with the Hotels & Tourism sector rising by 41.80 points.",
      "url": "https://kathmandupost.com/money/2025/07/07/nepse-falls-as-turnover-also-declines",
      "date": "2025-07-07"
    },
    {
      "title": "NEPSE rises for sixth straight session",
      "summary": "Nepal Stock Exchange's index rose slightly by 2.40 points on Sunday, closing at 2,706. Total turnover stood at Rs9.5 billion. Nepal Reinsurance, Laxmi Sunrise Bank promoter shares and Himalayan Reinsurances were the most actively traded stocks.",
      "url": "https://kathmandupost.com/money/2025/07/06/nepse-rises-for-sixth-straight-session",
      "date": "2025-07-06"
    },
    {
      "title": "boAt plans to sail beyond India with Nepal launch",
      "summary": "BoAt, India's number one audio wearable brand, announced its entry into the Nepali market on July 1. The brand is now distributed nationwide by TeleTalk, a subsidiary of Ramesh Corp. BoAt has expanded its business into Dubai, Sri Lanka and Nepal.",
      "url": "https://kathmandupost.com/money/2025/07/06/boat-plans-to-sail-beyond-india-with-nepal-launch",
      "date": "2025-07-06"
    }
  ],
  "health": [
    {
      "title": "Doctors announce protest over Consumer Court verdicts",
      "summary": "Nepal Medical Association is boycotting non-emergency services on Monday. The association is protesting the Consumer Court's recent verdicts against doctors found guilty of gross negligence in treatments that resulted in serious complications and patient death. This is the second time in two months the association has called for a complete halt to non- emergency services at health facilities across the country.",
      "url": "https://kathmandupost.com/health/2025/07/07/doctors-announce-protest-over-consumer-court-verdicts",
      "date": "2025-07-07"
    }
  ],
  "sports": [
    {
      "title": "Djokovic hits century to lead veterans into last 16, Krejcikova crashes",
      "summary": "Novak Djokovic, Jannik Sinner, Ben Shelton, Alex de Minaur and Grigor Dimitrov are into the last 16 at Wimbledon. Barbora Krejcikova's title defence ended in defeat. Elena Rybakina was beaten by Clara Tauson. Hailey Baptiste lost to Mirra Andreeva.",
      "url": "https://kathmandupost.com/sports/2025/07/06/djokovic-hits-century-to-lead-veterans-into-last-16-krejcikova-crashes",
      "date": "2025-07-06"
    }
  ]
}