{
  "politics": [
    {
      "title": "Feud in Congress after disciplinary action against leaders from dissident faction",
      "summary": "The Nepali Congress has taken action against 18 lower committee leaders on charges of betraying the party’s official candidates during the November 2022 general elections. The party also took disciplinary action against 26 more individuals for undermining official decisions and failing to cooperate with the party's official candidates in the same election. Shekhar Koirala, who leads a dissident faction in the Congress, expressed discontent with the disciplinary decision.",
      "url": "https://kathmandupost.com/politics/2025/07/11/feud-in-congress-after-disciplinary-action-against-leaders-from-dissident-faction",
      "date": "2025-07-11"
    },
    {
      "title": "Now PM holds the key to constitutional appointments",
      "summary": "Narayan Dahal is the National Assembly Chairman of the CPN (Maoist Centre). Speaker Devraj Ghimire and Deputy Speaker Indira Rana were elected under the UML and Rastriya Swatantra Party quotas.",
      "url": "https://kathmandupost.com/politics/2025/07/10/now-pm-holds-the-key-to-constitutional-appointments",
      "date": "2025-07-10"
    }
  ],
  "money": [
    {
      "title": "Nepal set for pilgrim influx as Kailash yatra resumes",
      "summary": "At least 25,000 Indian pilgrims are embarking on the revered Kailash Manasarovar yatra in Tibet, China this year. Beijing officially resumed the pilgrimage for Indian citizens in June following a five-year hiatus. The annual pilgrimage season brings a boom to the tourism industry and boosts government tax revenue.",
      "url": "https://kathmandupost.com/money/2025/07/11/nepal-set-for-pilgrim-influx-as-kailash-yatra-resumes",
      "date": "2025-07-11"
    },
    {
      "title": "The real issue is governance, not who owns bank shares",
      "summary": "Ashoke SJB Rana is the CEO of Himalayan Bank Ltd. He has decades of experience in the banking sector and is regarded as one of Nepal’s most seasoned bankers. The Finance Committee of the federal parliament is currently discussing the BAFIA bill. There are concerns over the separation of bankers and businesspersons and non-performing loans.",
      "url": "https://kathmandupost.com/money/2025/07/10/the-real-issue-is-governance-not-who-owns-bank-shares",
      "date": "2025-07-10"
    },
    {
      "title": "NEPSE climbs 25.89 points as index nears 2,750 on Wednesday",
      "summary": "Nepal Stock Exchange's index advanced by 25.89 points on Wednesday, marking a 0.95 percent rise to close at 2,731.80. Out of 161 traded companies, 161 registered an increase in share prices and 87 declined. A total of 88,615 transactions were recorded during the session, generating a turnover of Rs9.68 billion.",
      "url": "https://kathmandupost.com/money/2025/07/10/nepse-climbs-25-89-points-as-index-nears-2-750-on-wednesday",
      "date": "2025-07-10"
    }
  ],
  "sports": [
    {
      "title": "PM Oli urges sports council to expedite NPL preparations",
      "summary": "Prime Minister KP Sharma Oli has instructed the National Sports Council to expedite preparations for the second edition of the Nepal Premier League. Oli also ordered the NSC to ensure the 10th National Games are held as scheduled from November 18 to 25 in Birendranagar, Surkhet.",
      "url": "https://kathmandupost.com/sports/2025/07/11/pm-oli-urges-sports-council-to-expedite-npl-preparations",
      "date": "2025-07-11"
    },
    {
      "title": "Prime Minister Oli urges National Sports Council to expedite NPL preparations",
      "summary": "Prime Minister KP Sharma Oli has instructed the National Sports Council to expedite preparations for the second edition of the Nepal Premier League. Oli also ordered the NSC to ensure the 10th National Games are held as scheduled from November 18 to 25 in Birendranagar, Surkhet.",
      "url": "https://kathmandupost.com/sports/2025/07/10/prime-minister-oli-urges-national-sports-council-to-expedite-npl-preparations",
      "date": "2025-07-10"
    },
    {
      "title": "Kathmandu Gorkhas reveal Monty Desai as head coach for second edition of NPL",
      "summary": "Monty Desai has been appointed as head coach of Kathmandu Gorkhas for the second edition of the Nepal Premier League. Desai left Nepal in February and will return after nine months.",
      "url": "https://kathmandupost.com/sports/2025/07/10/kathmandu-gorkhas-reveal-monty-desai-as-head-coach-for-second-edition-of-npl",
      "date": "2025-07-10"
    }
  ],
  "climate-environment": [
    {
      "title": "Tibetan glacial lake drainage triggered deadly flood in Nepal, climate body says",
      "summary": "The Bhote Koshi River flood in Nepal killed at least nine people and left more than two dozen missing this week, including six Chinese workers at the Inland Container Depot. The flood originated from the draining of a supraglacial lake in the Tibet region of China. The June-September monsoon causes massive floods and landslides in mountainous Nepal.",
      "url": "https://kathmandupost.com/climate-environment/2025/07/10/tibetan-glacial-lake-drainage-triggered-deadly-flood-in-nepal-climate-body-says",
      "date": "2025-07-10"
    },
    {
      "title": "Erratic monsoon frustrates forecasters and farmers alike",
      "summary": "It has been six weeks since the monsoon entered Nepal. Several places, especially in the Tarai regions of Lumbini, Madhesh, and Koshi provinces, have not seen sufficient rainfall. The maximum temperature in Nepal is rising faster than the global average. Extreme weather events such as excessive rainfall in a short span, prolonged rains after themonsoon, droughts, and above-average winter temperatures are common in Nepal.",
      "url": "https://kathmandupost.com/climate-environment/2025/07/10/erratic-monsoon-frustrates-forecasters-and-farmers-alike",
      "date": "2025-07-10"
    }
  ]
}